[
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-06T16:44:25.248200#4224582556",
    "GSI1PK": "COMPANY#Mercor",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer",
    "company": "Mercor",
    "location": "United States (Remote)",
    "description": "About the job\n\nAbout the Role\n\nJoin a groundbreaking project at the forefront of AI innovation. As a Junior SWE, you will drive the development of intricate database schemas, build sophisticated APIs, and create realistic environments designed to support cutting-edge Reinforcement Learning models. Your technical leadership will be essential in crafting globally-used platforms for advanced AI training and deployment.\n\nA brief 15-minute interview precedes candidate selection, with decisions typically made within two days following assessment completion. Currently, applicants must be based in the U.S., UK, or Canada.\n\nWhy You’re a Great Fit\n\nYou're a strong candidate if you:\n\nHave 1+ years of elite software engineering experience from top-tier technology startups, quantitative trading firms, hedge funds, or similarly demanding environments.\nHold a Computer Science degree from a prestigious university in the U.S., Canada, or the UK.\nHave demonstrated success leading teams to build complex database schemas.\nPossess expert-level proficiency in API development, including creation, testing, and integration.\nAre highly skilled in SQL and database structuring.\nDemonstrate exceptional attention to detail and rigorous problem-solving skills.\nExcel in both written and verbal communication.\n\nRole Highlights\n\nLead engineering teams in building sophisticated database structures and API systems.\nOversee the development and deployment of secure authentication mechanisms, policy enforcement, and comprehensive backend systems.\nPopulate environments with realistic, synthetic data optimized for advanced AI model training.\nEnsure applications are performant, secure, and modular.\nNavigate the unique constraints presented by Reinforcement Learning environments.\nFlexible workload: 10–20 hours weekly, with the potential to scale to 40 hours.\nFully remote and asynchronous scheduling.\nInitial commitment of 1–2 months, with opportunities for extension.\n\nCompensation and Legal Details\n\nIf you receive an offer for this position, you will be assigned to one of our ongoing projects. Contrary to what you might be used to, these projects follow a hybrid blend of hourly and commission-based pay, or just commission-based pay. More details will be shared in the onboarding form for the project you are assigned to.\nBased on average efficiency and quality, your blended hourly rate should be around $120/hr. However, this is fully dependent on your individual throughput.\n\nAbout Mercor\n\nMercor connects elite talent with leading AI research labs and is headquartered in San Francisco, CA. Our distinguished investors include Benchmark, General Catalyst, Peter Thiel, Adam D’Angelo, Larry Summers, and Jack Dorsey.\n\nApply today to leverage your elite software engineering skills in advancing revolutionary AI technologies!\n\n\n",
    "posted_date": "2025-05-06T16:44:25.248200",
    "job_id": "4224582556",
    "search_embedding": [],
    "job_type": "UNKNOWN",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/mercor-ai/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=1752105600&v=beta&t=7rkV3wmx43fFe4lvWBU-Af86_j_xtDS3DeX1BCYy2wo",
    "link": "https://www.linkedin.com/jobs/view/4224582556/?eBP=CwEAAAGWvJXtDYwY4j8li8PX8DmUaGdqNWrPndo9k8-9KYWFqbAOKpSxZdhwg2cmqsW2RA54wHQKvhmRtKfj5lsOqJ_LguzELuNHPK4o-am7qmjQX1j_Nd7dJBpzufXVTEAU5lDb8lue8DJutWsA4IaEGqMmL7Wlgl8EjP-hvRKLOEmkAM21I9OKUJBr3bPNHz8vRsff7TZyvYUAHvWeuBP3Scp7gzFuhn6Y_hCrwle71W1_lg3ZUommKGEWhv9BHGkD7qCkfwYnkR34RYQFaWjsgldLau2EtHM_e6mSQQh2XC53gQJilRhpAjVyL1yz1xPvD5WoHl6a6miiIVD8j7wgTjm3ZPRlxNdWqyvFF_qvI8p2RxDqRB5in_Dey9dP5TASlDM7yiOb1U8zxi0f8Er0NNrdWr1qaSLYtDWNpjRDUkjHD2yiVrUMtDSsre8roh0BIN7NGjixyu9_aXPDR7zviIDAuJm6gylhymoPmNB0C0kg7f2L3_8FBCkJ-hP8lJj6dq_XbvjuMCAt-Fqi3qjK7Q&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=ZFaChCbH8vJqrg%2BbsUAvDg%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:25.248200"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-09T16:44:26.558015#4227156071",
    "GSI1PK": "COMPANY#DS Technologies Inc",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer",
    "company": "DS Technologies Inc",
    "location": "United States (Remote)",
    "description": "About the job\n\nAbout US: We are a company that provides innovative, transformative IT services and solutions. We are passionate about helping our clients achieve their goals and exceed their expectations. We strive to provide the best possible experience for our clients and employees. We are committed to continuous improvement and innovation, and we are always looking for ways to improve our services and solutions. We believe in working collaboratively with our clients and employees to achieve success.\n\nDS Technologies Inc is looking for Software Engineer role for one of our premier clients.\n\nJob Title: Software Engineer\n\nLocation: Remote(Only W2)\n\nIndustry: Information Technology\n\nJob Category: Software Development\n\nApplication Process: Please Take The Below Assessment According to Your experience level\n\nTo move forward, candidates are required to complete the AI test using the link below And Further Step Move Forward For Submission After Completion Of Test\n\nJunior - Level (3-5 Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=072ad114-6f61-4430-860d-b548f1a1b184&ping=ok\n\nMid - Level (5-10 Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=b80b928f-bcdf-467e-b698-f576b1735317&ping=ok\n\nSenior - Level (10+ Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=da489672-78b0-4c10-a257-a02dc74018f7&ping=ok\n\nOverview\n\nWe are seeking a skilled and detail-oriented Software Engineer to design, develop, and maintain reliable, efficient, and cost-effective software systems in support of Nassau County operations. This role involves hands-on software development, systems integration, and architectural responsibilities within a collaborative team environment.\n\nPosition: [Specify Contract Duration or Employment Type]\n\nResponsibilities\n\n\nDesign and implement scalable and efficient software systems aligned with County requirements \nAnalyze and elaborate technical and functional requirements from stakeholders \nWrite clean, maintainable code (approximately 50% of time), using standard development practices and tools \nDevelop proof-of-concept solutions and automation tools to streamline development and deployment \nConduct system integration ensuring compatibility with other platforms and domains \nParticipate in architectural planning and ensure consistency across supported systems \nBuild, test, and deploy APIs and software modules following defined specifications \nPerform code reviews, unit testing, and debugging to ensure code quality and performance \nMaintain technical documentation and adhere to best practices in version control and DevOps processes \n\n\nRequirements & Qualifications\n\n\nStrong hands-on experience in software engineering and full-stack development \nProficiency in one or more programming languages (e.g., Java, C#, Python, JavaScript) \nExperience with API development and integration across diverse systems \nSolid understanding of software development life cycle (SDLC) methodologies \nFamiliarity with automation tools, testing frameworks, and CI/CD pipelines \nStrong problem-solving skills, analytical thinking, and attention to detail \nExcellent collaboration and communication skills \n\n\nPreferred Qualifications\n\n\nExperience in public-sector or government software development projects \nKnowledge of enterprise software architecture and legacy system modernization \nFamiliarity with cloud platforms and containerization technologies (e.g., AWS, Azure, Docker, Kubernetes) \n\n\nIf you are interested, Kindly share your resume to Gayathri@dstechnologiesinc.com\n\nThanks\n\nDS Technologies - Team\n\nDS Technologies Inc. is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive environment for all employees and applicants for employment and prohibit discrimination and harassment of any kind. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other protected characteristic in accordance with applicable federal, state, and local laws. We actively seek to build a workforce that reflects the communities we serve and encourage applicants from all backgrounds to apply.",
    "posted_date": "2025-05-09T16:44:26.558015",
    "job_id": "4227156071",
    "search_embedding": [],
    "job_type": "CONTRACT",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/ds-technologies-inc-america/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQHzOkVboWEtyA/company-logo_100_100/company-logo_100_100/0/1710359298545/ds_technologies_inc_america_logo?e=1752105600&v=beta&t=No313WSITCGzHzjtxzpOGT_B46Xx0Fid0KWbfmzNf0o",
    "link": "https://www.linkedin.com/jobs/view/4227156071/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=L%2B%2BTdqYxP9wLn0BrAFJ0gQ%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:26.558015"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-08T16:44:27.890565#4226391285",
    "GSI1PK": "COMPANY#Raydar",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER  INTERNSHIP",
    "title": "Software Engineer - Internship",
    "company": "Raydar",
    "location": "United States (Remote)",
    "description": "About the job\n\nSoftware Engineer Intern\n\n\n\n\nLocation: Remote (US-based preferred) | Internship (Part-Time or Full-Time)\n\n\n\n\nHelp build the future of AI-powered recruiting software.\n\n\n\n\nWe’re an early-stage startup on a mission to reinvent how recruiting agencies operate. Our AI-first SaaS platform automates and streamlines the full recruiting workflow—from sourcing and outreach to scheduling and CRM management. Our customers are high-performing agencies that rely on speed, precision, and technology that actually delivers.\n\n\n\n\nWe’re a lean, fast-moving team with real traction, real users, and ambitious plans ahead. We’re looking for a high-aptitude, driven Software Engineering Intern to work directly with the founding team. You’ll help us ship real product, experiment with cutting-edge AI integrations, and scale systems that power the modern recruiter’s toolkit.\n\n\n\n\nWhat You’ll Do\n\n\n\n\nBuild features across the stack (Python, FastAPI, Postgres, React, TypeScript)\nIntegrate with external APIs like Apollo, Smartlead, and recruiting CRMs\nShip fast—turning prototypes into live features in days, not weeks\nContribute to key architectural decisions around infrastructure and scalability\nHelp define how AI can replace manual recruiting workflows end-to-end\n\n\n\n\nYou Might Be a Fit If You\n\n\n\n\nHave strong coding fundamentals and pick up tools quickly\nAre excited by startup environments, ownership, and high-impact work\nThink deeply about product experience—not just function, but feel\nEnjoy solving hard problems, debugging fast, and optimizing for speed\nAre curious about AI, automation, or the future of B2B software\nWant to build something real and get it in users’ hands\n\n\n\n\nBonus Points For\n\n\n\n\nExperience working with LLMs or agent frameworks\nUnderstanding of outbound email infrastructure or deliverability\nPast internships or side projects at startups\nBuilt your own tools or shipped indie projects—even if unfinished\n\n\n\n\nWhat You’ll Get\n\n\n\n\nHands-on experience. Work on critical product features with real users.\nMentorship. Collaborate closely with experienced founders and operators.\nAutonomy. We treat interns like core team members, not task runners.\nImpact. Your code will ship, get used, and shape what we build next.\nOption to grow. High-performing interns may be offered a full-time role.",
    "posted_date": "2025-05-08T16:44:27.890565",
    "job_id": "4226391285",
    "search_embedding": [],
    "job_type": "FULL_TIME",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/raydar-xyz/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQG1fXMvh_19dg/company-logo_100_100/company-logo_100_100/0/1669078545750/meta_work_logo?e=1752105600&v=beta&t=JT-JPEEg07WO9EKJTlyPuUqDWZkEQJyWXVED72ue8_Q",
    "link": "https://www.linkedin.com/jobs/view/4226391285/?eBP=CwEAAAGWvJXtDVaZbKCLgOJijUw0ezRD2rGkV4Uge5reyRc-ePBmBJsd-ZCPkdk0wCD6uDYXFYF6lljyAtfqds2wemo2qqpKSHOH7dRR7Mikfl1jLyLtlEN-1p7pYuDpjMcysY1LSJmVTBwrckLTeuTMrc1gD1QVp5_klWnPM_ZOrk5mHJZSYXCaRHd23vhfCjS2QeTeWjbfPUUFylQESJbE131UsCIkBo82123O6WpQZG2bNnEtFes-lv7_yiStJ5beM3MjYp1wrcGy-a64mXLfYQHKsADIQ36qgQEcwFJ32POLTpqOUBQAfEOPK8tnCukoyg7erDD6fYeh4isn5w8DCz7cgVjXKZaxybSwfiGDtDApLHuo9ws_ndFvyfCj01bYLtew2iGh27epHATShmHSP-zgPz0A-jNtPy45iyXDCBhItmoc14OtSRYGtYMmlhMMOEPbEjHmzoQY81Kwzo5kVZq6zl2CIq6rtPgUlJGf45mAMtb_UcOE-97Xz-zafqD4fLMXhrJYGIxRR7lzcf4&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=1zesWyHz%2FDDKfwF4bocNCA%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:27.890565"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-08T16:44:29.319465#4226360986",
    "GSI1PK": "COMPANY#Studio23Labs",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER INTERN",
    "title": "Software Engineer Intern",
    "company": "Studio23Labs",
    "location": "United States (Remote)",
    "description": "About the job\n\nJOB INFORMATION—-------------------------\n\n\n\n\nPay: $25/hr, in addition to per-project bonus\n\n\n\n\nInternship Period: 4 weeks initially subject to unrestricted extensions\n\n\n\n\nAbout Studio23Labs:\n\nStudio23 Labs is a cutting-edge technology firm specializing in AI-powered software solutions that help organizations automate processes, enhance data insights, and improve operational efficiency. With a focus on innovation and impact, the company delivers high-quality custom applications, strategic consulting, and secure, scalable platforms for clients across industries.\n\n\n\n\nJob Description:\n\nWe're looking for a motivated Software Engineering Intern to join our dynamic team. This role offers hands-on experience with modern web technologies and development practices in a collaborative environment.\n\nPosition Overview\n\nThis internship provides an opportunity to work on real-world projects using React, Next.js, MongoDB, Python, and Nginx. You'll develop skills across the full stack while receiving mentorship from experienced engineers.\n\nResponsibilities\n\n • Assist in developing and maintaining frontend applications using React and Next.js\n\n • Write clean, well-documented code following team standards\n\n • Collaborate on database design and implementation using MongoDB\n\n • Support backend functionality using Python\n\n • Learn about server configuration and deployment using Nginx\n\n • Participate in code reviews and team meetings\n\n • Debug issues across the development stack\n\n • Document features and processes\n\nRequirements\n\n • Currently pursuing a degree in Computer Science, Software Engineering, or related field\n\n • Basic understanding of JavaScript/TypeScript and React fundamentals\n\n • Familiarity with HTML, CSS, and responsive design principles\n\n • Interest in learning server-side development with Python\n\n • Basic understanding of database concepts\n\n • Strong problem-solving abilities and eagerness to learn\n\n • Good communication skills and ability to work in a team environment\n\nNice to Have\n\n • Experience with Next.js or similar React frameworks\n\n • Basic knowledge of MongoDB or other NoSQL databases\n\n • Understanding of RESTful API principles\n\n • Familiarity with Git version control\n\n • Knowledge of deployment processes\n\nWhat We Offer\n\n • Hands-on experience with industry-standard technologies\n\n • Mentorship from senior developers\n\n • Exposure to full-stack development\n\n • Collaborative and supportive work environment\n\n • Opportunity to work on meaningful projects\n\n\n\n\nCANDIDATE'S ENTRY—----------------------\n\n\n\n\nBasic Information\n\nFirst Name; Last Name\nEmail:\nResume:\n\n\n\n\nSchool Information:\n\nSchool Name\nSchool Degree\nSchool Discipline; GPA\nLatest Transcript\n\n\n\n\nAdditional Information\n\nLinkedin Profile (Optional)\nAre you over 18 (Y/N)\nAre you located in the U.S and have unlimited and unrestricted authorization to work in the U.S.? (Y/N)\nAre you currently subject to any restrictive covenant, non-compete, non-solicit, confidentiality or any other agreement that may limit or restrict your scope and ability to work for Studio23labs LLC? (Y/N)'\n\n\n\n\nApplicants must be authorized to work for 20+ hours per week in the United States.",
    "posted_date": "2025-05-08T16:44:29.319465",
    "job_id": "4226360986",
    "search_embedding": [],
    "job_type": "INTERNSHIP",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/studio23labs/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGWVeyYQ7mRYQ/company-logo_100_100/B4EZadpeWbHcAQ-/0/1746401617671/studio23labs_logo?e=1752105600&v=beta&t=jApnKi8Nou9fSAuDcbCXSuly-RsfHU3lL_jwWroN2qk",
    "link": "https://www.linkedin.com/jobs/view/4226360986/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=EiZRCVjBQFyjmeoCLicAsA%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:29.319465"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-08T16:44:30.615559#4223779716",
    "GSI1PK": "COMPANY#Stellar Consulting Solutions, LLC",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer",
    "company": "Stellar Consulting Solutions, LLC",
    "location": "United States (Remote)",
    "description": "About the job\n\nJob Title: Software Engineer\n\nLocation: Remote\n\nDuration: 6+ Months Contract\n\n\n\n\nPreferring someone with:\n\n ● Interest and experience within the hobby gaming industry\n\n ● Experience with eCommerce and high-volume transaction-based applications\n\n\n\n\nAs a Senior Software Engineer, you have a proven track record of success delivering projects of critical importance. You are comfortable with both greenfield development (including deployment pipelines) and working in existing microservices and monoliths. You write code that follows best practices, is maintainable, and is tested. You break down product requirements into units of work that can begin delivering value quickly and can easily be iterated upon. If you are someone who is a continuous learner, a problem solver, passionate about code quality and loves working with the latest and greatest technologies in a team environment – then this is the job for you!\n\n \n\n The Impact You Will Make Here:\n\n● You will build the backend (including datastores, APIs, and event streams) that will support our next-generation catalog, omni-channel inventory, price points, and orders systems.\n\n ● Ensure that our backend systems are highly performant and scalable to accommodate an ever growing amount of data and load.\n\n ● Work closely with internal teams integrating with our backend systems and ship iterative improvements based on their requirements and feedback.\n\nWhat You Bring to the Team\n\n ● Bachelor’s degree in computer science, information technology or a related field, or a combination of education and experience\n\n ● 7+ years of large-scale microservice application development (we’re using .NET Core, Docker, and Kubernetes in AWS), including experience with decomposing monolithic applications.\n\n ● Expert knowledge of multiple datastore technologies including both RDBMS (PostgreSQL, SQL Server) and NoSQL (MongoDB, Redis).\n\n ● Strong communication, leadership, and collaboration skills with teammates and stakeholders.\n\n ● A ship-often mindset and ability to break down requirements into components that can be released rapidly.\n\n \n\n You’ll Go Beyond If You Have:\n\n ● Interest and experience within the hobby gaming industry\n\n ● Experience with eCommerce and high-volume transaction-based applications\n\n ● Experience with:\n\n ○ GitHub Actions\n\n ○ Terraform\n\n ○ Automated testing\n\n ○ Kafka\n\n ○ Data sharding strategies\n\n ○ AWS Technologies",
    "posted_date": "2025-05-08T16:44:30.615559",
    "job_id": "4223779716",
    "search_embedding": [],
    "job_type": "CONTRACT",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/stellar-consulting-solutions/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQHqMsGAs2X5ag/company-logo_100_100/company-logo_100_100/0/1666027551517/stellar_consulting_solutions_logo?e=1752105600&v=beta&t=v2tXD5z3MPEDBLP7n_GRYr5Bd4JN03Ou0eR5OmqAeQM",
    "link": "https://www.linkedin.com/jobs/view/4223779716/?eBP=CwEAAAGWvJXtDaQeZVBxqPPJHJ51fpHpyFzc1SR4hH07kjqYzPkL5GFCWxpJNxw4vKdLSFJjc3zrSxkiwB8cBKW2IAXoIEYMYbSXoYDJN0xJeuNx2n5pEvNpuJww4hQ_s5jeerPK29VjHzlyk4GkmIWxGvEBJGSoH7Cdo3djlMruLLJf2GRhKtoV0Y0Hz7Jax28ePlfeHJ4c6oIsH8QZo9BaUq1wauF_2o08UgfxvcZp5c84nXinM3ZjR2XdVFiNZAaP7fA84ulDuAEieqKMFJm8GziZUmbwv3ARPc7eAicuZe5YL9pNdeAzpKh7SzrWOQwqiVdWEZXof0JIvBq4jEIUT2IiIWBbQKSIU-pptqjevoEwymkRUYJe9phZso7m0VCq99aaD09FxLy5-Dmcc3Ol7DgwK2zYppui1ay5OGDWOb8xNk4aRCLTd2I84sniH49z-exYbmiG8d5j6T5tSw4RmXHbuv4kyk14CrdBgbesyS4&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=umMPBRsWiT6kgXJ10%2Fnhvg%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:30.615559"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-09T16:44:31.939918#4224665377",
    "GSI1PK": "COMPANY#Cook'd",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer",
    "company": "Cook'd",
    "location": "United States (Remote)",
    "description": "About the job\n\nThis Isn't a Role at Cook'd — It's a way to apply to all the companies we're partnered with.\n\n\n\n\nWe are partnered with a bunch of companies that are searching for AI, Full Stack, and Founding Engineers, and we're looking for candidate that can just ship!\n\n\n\n\nWhat You'll Be Doing\n\nWhile each company is different, most roles share a few core themes:\n\nBuilding and scaling backend systems, APIs, and data pipelines\nIntegrate AI models into production\nDesigning and shipping product features with a small, fast-moving team\nContributing across the stack, especially in Python, Node.js/TypeScript, and React\nWriting clean, maintainable code in a modern cloud-native environment (Docker, Kubernetes, AWS/GCP)\n\n\n\n\nYou Should Only Apply If\n\nYou have solid software engineering fundamentals\nYou enjoy being hands-on across the stack\nYou're able to learn new technologies quickly\nYou thrive in a fast-paced startup environment\nYou're excited about the intersection of software and AI \nYou're open to full-time, in-person roles in NYC\n\n\n\n\nYou Should NOT Apply If \n\nYou prefer highly specialized roles with narrowly defined responsibilities\nYou're uncomfortable with the ambiguity and rapid changes of an early-stage startup\n\n\n\n\nWhat We’re Looking For\n\nFor Solid engineering fundamentals and a builder’s mindset\nExperience working with APIs, databases, and distributed systems\nCuriosity and initiative — you like figuring things out\nAbility to ship clean code quickly without constant oversight\nEagerness to learn and grow in a fast-changing AI ecosystem",
    "posted_date": "2025-05-09T16:44:31.939918",
    "job_id": "4224665377",
    "search_embedding": [],
    "job_type": "FULL_TIME",
    "exp_level": "UNKNOWN",
    "company_link": "https://www.linkedin.com/company/cookd-dev/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGSAZmrxhlzcA/company-logo_100_100/company-logo_100_100/0/1730915764621/cookd_dev_logo?e=1752105600&v=beta&t=GQVjhLW5R5TQO4zDCHoc9PyAz-_F3YadDXAuQamjn9E",
    "link": "https://www.linkedin.com/jobs/view/4224665377/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=EzhgI6f5KuXoCOmL%2FuPiBA%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:31.939918"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-03T16:44:33.179674#4217062903",
    "GSI1PK": "COMPANY#Synchro",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer",
    "company": "Synchro",
    "location": "United States (Remote)",
    "description": "About the job\n\nLooking for a mid-level Backend Engineer for a client of ours in the Privacy, Security, and Software space. 6 month project paying around 50/hour.\n\n\n\n\nAWS \n\nJavascript\n\nTypescript\n\nTerraform\n\nSnowflake",
    "posted_date": "2025-05-03T16:44:33.179674",
    "job_id": "4217062903",
    "search_embedding": [],
    "job_type": "UNKNOWN",
    "exp_level": "MID",
    "company_link": "https://www.linkedin.com/company/wearesynchro/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQFVvN8WmY_DYg/company-logo_100_100/company-logo_100_100/0/1662734305366/wearesynchro_logo?e=1752105600&v=beta&t=Dc0TNk7OA58Jk5_t2l59RMd5rOZAPSiP7FszstQs5f0",
    "link": "https://www.linkedin.com/jobs/view/4217062903/?eBP=CwEAAAGWvJXtDdOmTJu9vAMlwkXY65OPHII_xpXkSgnbAWZyog2li1h4wY7_5pXcxkrDf2VOrA1PeChblxMiyPT2YHPp3b-AwnMnbxJYhHm2xA8ObsREiQ8tnE3Hv6JfEXfM8VKonPeDugCyfnza9zDCLovskLln-6YRlNcq8_7_tioc-AqYAQoBwvf8e1H3IUd9VoQcNUHqNCQqkksC0PxfLXeA8q4zW0eqPM9o3yyawJ2OwYzE8sOfCi8AUOuqrtD7dFQQ5IXQvKoWSQLU7ViypDdT4lPyVAqpkarAbE18RP2cmwJT3_jMSrDmisM5mttrD5jDUqTsnQ2LslUVyL93GXAVu_HzwxMmdyCUU1Y6w0SYt5ciGwoksxX0dEW9c6s_9sapq_675gdFwcYhLYf0WfAHyxdiVB94Mj41WnDXB91iGlflZUqj24OlqT0SbEHt-KodKGDQbUdO7Xoc5PE9omxyvPHBhgplFScWZOeYzMUSRO80rjNKnsiuIGyl_kRZnhwg20gsnxo&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=36eGq6Oe0%2B%2FEfCI73uZl0A%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:33.179674"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-06T16:44:34.484110#4221976948",
    "GSI1PK": "COMPANY#Jobgether",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER II",
    "title": "Software Engineer II (Remote - US)",
    "company": "Jobgether",
    "location": "United States (Remote)",
    "description": "About the job\n\nAbout Jobgether\n\nJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.\n\nOne of our companies is currently looking for a Software Engineer II in the United States.\n\nWe're seeking a talented Software Engineer II to join a high-impact data engineering team focused on building scalable, high-performance data pipelines and infrastructure in the cloud. In this role, you'll work with complex and high-volume datasets to support analytics, machine learning, and fraud prevention technologies. You'll partner closely with cross-functional teams to deliver real-time data solutions that power intelligent decision-making across products. This is a great opportunity for someone with a passion for big data technologies, cloud platforms, and operational excellence to grow their career in a mission-driven, fast-paced environment.\n\nAccountabilities:\n\n\nDesign and implement resilient data ingestion pipelines for diverse datasets including transactional and third-party data\nTransform batch or prototype pipelines into scalable, enterprise-grade systems\nDevelop distributed processing solutions using Apache Spark on AWS EMR\nCollaborate with data science, analytics, and engineering teams to integrate data-driven capabilities\nOptimize infrastructure for real-time identity scoring and fraud detection\nEnsure strong data quality controls, monitoring systems, and operational best practices\nIncorporate GenAI tools to automate data classification and feature extraction workflows\nManage infrastructure with Terraform or similar Infrastructure-as-Code tools\n\n\n\nRequirements\n\n\n2-4+ years of experience in data or software engineering, ideally in large-scale or real-time environments\nStrong programming skills in Scala, Java, or Python, with a solid grasp of system design and data structures\nExperience with Apache Spark or other distributed data frameworks (e.g., Hadoop)\nFamiliarity with AWS services like EMR, Lambda, Glue, S3, and Step Functions\nProficiency in SQL and data analysis across large datasets\nQuick learner with a collaborative, solution-oriented mindset\nStrong communication skills and ability to work across technical and business teams\n\n\n\nBenefits\n\n\nCompetitive salary: $150,000-$180,000 base (final offer may vary by location and experience)\nEquity package and performance bonus potential\nFully remote work model for U.S.-based employees\nComprehensive health benefits (medical, dental, vision, life insurance)\n401(k) retirement plan with matching\nGenerous paid time off and flexible scheduling\nAccess to professional development resources and GenAI technology exposure\nInclusive and mission-driven team culture focused on innovation and impact\n\n\n\nJobgether Hiring Process Disclaimer\n\nThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.\n\nOur AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.\n\nOur process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.\n\nIf you are among the top 5 candidates, you will be notified within 7 days.\n\nIf you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.\n\nThank you for your interest!\n\n",
    "posted_date": "2025-05-06T16:44:34.484110",
    "job_id": "4221976948",
    "search_embedding": [],
    "job_type": "UNKNOWN",
    "exp_level": "UNKNOWN",
    "company_link": "https://www.linkedin.com/company/jobgether/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQEFATQCdWa6tg/company-logo_100_100/company-logo_100_100/0/1635587710644/jobgether_logo?e=1752105600&v=beta&t=wVyri86acQwWgC1v31pfii29kqrmOYBr3jhSV31lFBk",
    "link": "https://www.linkedin.com/jobs/view/4221976948/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=eq5%2BmvjyYJjc1%2FXOv1c5PQ%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:34.484110"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-10T12:44:35.755778#4227790275",
    "GSI1PK": "COMPANY#Wiraa",
    "GSI1SK": "ROLE#SOFTWARE ENGINEERINEER",
    "title": "Software Engineer (Banking)",
    "company": "Wiraa",
    "location": "United States (Remote)",
    "description": "About the job\n\nAbout The Company\n\nFirst Citizens Bank is a leading financial institution committed to providing exceptional banking and financial services. As part of its ongoing efforts to enhance its technology services, the bank is seeking a Senior Developer/Lead for the Consumer Banking Technology division. This role will be instrumental in driving technical excellence and innovation in the development and maintenance of complex systems.\n\nAbout The Role\n\nThe Senior Developer/Lead position is responsible for managing all phases of data processing system projects, from requirements definition to production deployment. The role involves leading technical efforts, providing architecture guidance, and ensuring the successful implementation and maintenance of complex systems. This position will focus on developing software solutions and test plans, improving processing capabilities, and resolving complex issues to support production systems. As a technical expert, the individual will also provide leadership and mentorship to less experienced team members.\n\nKey Responsibilities\n\n\nArchitect, develop, and maintain full-stack on-premises and cloud web applications.\nProvide leadership, technical guidance, and best practices during the solution design process.\nDesign and build strategic patterns and components for reusability while adhering to SOLID principles.\nCollaborate and demonstrate proof of concepts (POCs) to drive technical change and innovation.\nOversee all aspects of the software development lifecycle, including design, coding, code review, integration testing, deployment, and documentation.\nEstablish and enforce quality standards in software architecture and design.\nFocus on scalability, maintainability, testability, security, and performance in software development.\nThrive in a fast-paced and dynamic work environment.\n\n\nQualifications\n\n\nBachelor's degree and 6+ years of experience in software application development OR High School diploma/GED and 10+ years of experience in software application development.\nPreferred: 8+ years of experience in software development, with a strong focus on the banking domain.\nAt least 4 years of relevant experience in designing and implementing solutions using the Microsoft tech stack (e.g., .Net Framework, C#, Core Service, RESTful services).\n4+ years of experience with Java, Spring Boot, and Kafka.\nExperience with API gateways, Single Sign-On (SSO) solutions using OKTA, and JWT.\nStrong knowledge of microservices, event-driven architecture, and service-oriented design.\nExperience with front-end frameworks such as Angular (16+), ReactJs, and ReactNative.\nProficient in JavaScript frameworks and modern web design principles, including HTML5/CSS3, SaSS, and Flex layout.\nHands-on experience with microservice/API design using MuleSoft or TIBCO.\nFamiliarity with DevSecOps, containerization, and platforms like Kubernetes.\nExperience with databases like SQL DB, ETL solutions, and Azure Platform is a plus.\nExperience in Agile/SAFe scrum methodologies.\nStrong problem-solving and communication skills.\n\n\nBenefits\n\nFirst Citizens Bank offers a competitive benefits package, including healthcare, retirement plans, and various employee incentives designed to meet the needs of its associates. Details of the benefits package will be discussed during the hiring process.\n\nEqual Opportunity\n\nFirst Citizens Bank is an Equal Opportunity Employer and is committed to ensuring that all qualified applicants receive consideration for employment without regard to race, color, sex, national origin, sexual orientation, gender identity, religion, age, disability, genetic information, protected veteran status, or any other status protected by applicable law.\n\n\n\nDesired Skills and Experience\n\nInformation Technology",
    "posted_date": "2025-05-10T12:44:35.755778",
    "job_id": "4227790275",
    "search_embedding": [],
    "job_type": "UNKNOWN",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/wiraa/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQE9LwORhIbvLg/company-logo_100_100/company-logo_100_100/0/1692029735102?e=1752105600&v=beta&t=Np5ZlAb_vfe3B-csdya_FnRMO8cNYIGcaFqD7mPIeOA",
    "link": "https://www.linkedin.com/jobs/view/4227790275/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=U6HrF8ClVz7qhKZDNqgmDQ%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:35.755778"
  },
  {
    "PK": "JOB#TECH",
    "SK": "POSTED#2025-05-10T13:44:37.085797#4225464449",
    "GSI1PK": "COMPANY#hotsourced",
    "GSI1SK": "ROLE#SOFTWARE DEVELOPERELOPRODUCT_MANAGERENT INTERN",
    "title": "Software Development Intern",
    "company": "hotsourced",
    "location": "United States (Remote)",
    "description": "About the job\n\nWe’re offering an exciting internship opportunity for students currently enrolled in a BSc or MSc program, passionate about engineering and eager to dive into the world of commercial web application development.\n\nAs a Software Development Intern in our dynamic team, you’ll gain hands-on experience in developing cutting-edge software using modern technologies and frameworks.\n\nYou’ll work alongside our talented developers on various aspects of application development, from coding to design, in an environment that values good engineering and customer-centric design.\n\nThis internship is your chance to contribute to projects that reach thousands of users worldwide while being mentored by some of the best in the industry. If you’re ready to take your coding skills to the next level and make a real impact, we want to hear from you.\n\n\n\n\n\nResponsibilitie\n\nsAssist in the development and testing of commercial web application\nsCollaborate with senior developers on various software development project\nsApply user-centered design principles in software developmen\ntParticipate in agile development processes and team meeting\nsContribute to the improvement of existing software and the creation of new feature\n\n\n\n\ns\nRequirements and skil\n\nlsCurrently enrolled in a relevant BSc or MSc progr\namInterest in commercial web application developme\nntKnowledge in at least one object-oriented web framewo\nrkInterest in user-centered interaction desi\ngnAgile thinker and capable of working effectively as part of a te\namMotivated to learn new technologies and framewor\n\n\n\n\nks",
    "posted_date": "2025-05-10T13:44:37.085797",
    "job_id": "4225464449",
    "search_embedding": [],
    "job_type": "INTERNSHIP",
    "exp_level": "SENIOR",
    "company_link": "https://www.linkedin.com/company/hotsourced/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQEofS9Cw1kaUw/company-logo_100_100/company-logo_100_100/0/1719257266898/hotsourced_logo?e=1752105600&v=beta&t=h9c8oz_eoSsCn3tfzRTi57EVUKOjqZxbGPdFg6LZysw",
    "link": "https://www.linkedin.com/jobs/view/4225464449/?eBP=BUDGET_EXHAUSTED_JOB&refId=OE%2Br8ejx%2BJdkEHPIvE9ZQQ%3D%3D&trackingId=QOph9FT%2F59ageyGKYn7%2FdA%3D%3D&trk=flagship3_search_srp_jobs",
    "processed_at": "2025-05-10T16:44:37.085797"
  }
]