[
  {
    "job_id": "4224582556",
    "link": "https://www.linkedin.com/jobs/view/4224582556/?eBP=CwEAAAGWvBuWRl8eheTrvJMhcsSL_ZP4UuFmSQRvJfvvKQ6XrywORCv6r7hIZG-EKCVnIt3Z87RGPfC3hY3Am1XwemvhyWgmP-UJyv9-0QGLXDxYNt3teugfzfEkbmzd86pxj9JIsaO7nHGE-oYc__zPgIbgttmo3SgHVfcvlmMo3QwGO84nJlMOC8auKSeYVJtOMyG-tPdpSJd0rJEk___3ULDuw-WP0G7yMprao6VYxvmtKWX9b6qZ_vmxCVNm4PngdrdD2qQ1AEAEpheCPQARP2tbIoIrrLC9lDWtTNepQydC7uuRI6CS5umjrh08V_gJpQKaF12MUIOm9--_i6zNRGcJQqHQ7snp8oyPS21n8e1mIAiQt9CIBxsJ1w_-14GF50467deSjCfTA-e_IoTF_S3ejao08_IOSRyXGM7mRgt3tfeYq5d9eH3NNIXCB17FeGqfEZhblKCyOOgsP04-AVVufhJUpGGUTfB2KSzgE3MgbIU6LTlH1yPbA9h-274Tr-ell4pI5quXqm1q&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=CH2JpJx9YhMA7OGsr8bQ%2Bg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Mercor",
    "company_link": "https://www.linkedin.com/company/mercor-ai/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQH9Gn3NF9HQTQ/company-logo_100_100/company-logo_100_100/0/1698629074329/mercor_io_logo?e=1752105600&v=beta&t=7rkV3wmx43fFe4lvWBU-Af86_j_xtDS3DeX1BCYy2wo",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout the Role\n\nJoin a groundbreaking project at the forefront of AI innovation. As a Junior SWE, you will drive the development of intricate database schemas, build sophisticated APIs, and create realistic environments designed to support cutting-edge Reinforcement Learning models. Your technical leadership will be essential in crafting globally-used platforms for advanced AI training and deployment.\n\nA brief 15-minute interview precedes candidate selection, with decisions typically made within two days following assessment completion. Currently, applicants must be based in the U.S., UK, or Canada.\n\nWhy You’re a Great Fit\n\nYou're a strong candidate if you:\n\nHave 1+ years of elite software engineering experience from top-tier technology startups, quantitative trading firms, hedge funds, or similarly demanding environments.\nHold a Computer Science degree from a prestigious university in the U.S., Canada, or the UK.\nHave demonstrated success leading teams to build complex database schemas.\nPossess expert-level proficiency in API development, including creation, testing, and integration.\nAre highly skilled in SQL and database structuring.\nDemonstrate exceptional attention to detail and rigorous problem-solving skills.\nExcel in both written and verbal communication.\n\nRole Highlights\n\nLead engineering teams in building sophisticated database structures and API systems.\nOversee the development and deployment of secure authentication mechanisms, policy enforcement, and comprehensive backend systems.\nPopulate environments with realistic, synthetic data optimized for advanced AI model training.\nEnsure applications are performant, secure, and modular.\nNavigate the unique constraints presented by Reinforcement Learning environments.\nFlexible workload: 10–20 hours weekly, with the potential to scale to 40 hours.\nFully remote and asynchronous scheduling.\nInitial commitment of 1–2 months, with opportunities for extension.\n\nCompensation and Legal Details\n\nIf you receive an offer for this position, you will be assigned to one of our ongoing projects. Contrary to what you might be used to, these projects follow a hybrid blend of hourly and commission-based pay, or just commission-based pay. More details will be shared in the onboarding form for the project you are assigned to.\nBased on average efficiency and quality, your blended hourly rate should be around $120/hr. However, this is fully dependent on your individual throughput.\n\nAbout Mercor\n\nMercor connects elite talent with leading AI research labs and is headquartered in San Francisco, CA. Our distinguished investors include Benchmark, General Catalyst, Peter Thiel, Adam D’Angelo, Larry Summers, and Jack Dorsey.\n\nApply today to leverage your elite software engineering skills in advancing revolutionary AI technologies!\n\n\n",
    "date": "2025-05-06T14:30:46.616768"
  },
  {
    "job_id": "4227156071",
    "link": "https://www.linkedin.com/jobs/view/4227156071/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=JVIigxApojmLsligUdFe%2Fw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "DS Technologies Inc",
    "company_link": "https://www.linkedin.com/company/ds-technologies-inc-america/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQHzOkVboWEtyA/company-logo_100_100/company-logo_100_100/0/1710359298545/ds_technologies_inc_america_logo?e=1752105600&v=beta&t=No313WSITCGzHzjtxzpOGT_B46Xx0Fid0KWbfmzNf0o",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout US: We are a company that provides innovative, transformative IT services and solutions. We are passionate about helping our clients achieve their goals and exceed their expectations. We strive to provide the best possible experience for our clients and employees. We are committed to continuous improvement and innovation, and we are always looking for ways to improve our services and solutions. We believe in working collaboratively with our clients and employees to achieve success.\n\nDS Technologies Inc is looking for Software Engineer role for one of our premier clients.\n\nJob Title: Software Engineer\n\nLocation: Remote(Only W2)\n\nIndustry: Information Technology\n\nJob Category: Software Development\n\nApplication Process: Please Take The Below Assessment According to Your experience level\n\nTo move forward, candidates are required to complete the AI test using the link below And Further Step Move Forward For Submission After Completion Of Test\n\nJunior - Level (3-5 Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=072ad114-6f61-4430-860d-b548f1a1b184&ping=ok\n\nMid - Level (5-10 Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=b80b928f-bcdf-467e-b698-f576b1735317&ping=ok\n\nSenior - Level (10+ Years):- https://www.interview.micro1.ai/intro/dc1838d2-367f-4c54-b907-96e9463ff98e/?skill=da489672-78b0-4c10-a257-a02dc74018f7&ping=ok\n\nOverview\n\nWe are seeking a skilled and detail-oriented Software Engineer to design, develop, and maintain reliable, efficient, and cost-effective software systems in support of Nassau County operations. This role involves hands-on software development, systems integration, and architectural responsibilities within a collaborative team environment.\n\nPosition: [Specify Contract Duration or Employment Type]\n\nResponsibilities\n\n\nDesign and implement scalable and efficient software systems aligned with County requirements \nAnalyze and elaborate technical and functional requirements from stakeholders \nWrite clean, maintainable code (approximately 50% of time), using standard development practices and tools \nDevelop proof-of-concept solutions and automation tools to streamline development and deployment \nConduct system integration ensuring compatibility with other platforms and domains \nParticipate in architectural planning and ensure consistency across supported systems \nBuild, test, and deploy APIs and software modules following defined specifications \nPerform code reviews, unit testing, and debugging to ensure code quality and performance \nMaintain technical documentation and adhere to best practices in version control and DevOps processes \n\n\nRequirements & Qualifications\n\n\nStrong hands-on experience in software engineering and full-stack development \nProficiency in one or more programming languages (e.g., Java, C#, Python, JavaScript) \nExperience with API development and integration across diverse systems \nSolid understanding of software development life cycle (SDLC) methodologies \nFamiliarity with automation tools, testing frameworks, and CI/CD pipelines \nStrong problem-solving skills, analytical thinking, and attention to detail \nExcellent collaboration and communication skills \n\n\nPreferred Qualifications\n\n\nExperience in public-sector or government software development projects \nKnowledge of enterprise software architecture and legacy system modernization \nFamiliarity with cloud platforms and containerization technologies (e.g., AWS, Azure, Docker, Kubernetes) \n\n\nIf you are interested, Kindly share your resume to Gayathri@dstechnologiesinc.com\n\nThanks\n\nDS Technologies - Team\n\nDS Technologies Inc. is an Equal Opportunity Employer. We are committed to creating a diverse and inclusive environment for all employees and applicants for employment and prohibit discrimination and harassment of any kind. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability, veteran status, sexual orientation, gender identity, or any other protected characteristic in accordance with applicable federal, state, and local laws. We actively seek to build a workforce that reflects the communities we serve and encourage applicants from all backgrounds to apply.",
    "date": "2025-05-09T14:30:47.874197"
  },
  {
    "job_id": "4226391285",
    "link": "https://www.linkedin.com/jobs/view/4226391285/?eBP=CwEAAAGWvBuWR5B-NyMdsnDPJ9W7M0BeO5qf_gZhdZGzsMNKHHSwOL9cmcKDVk1xj0mrqGv7-nGxykBj3hWBwMeO9aNi4FXlfrHOXfGt_wkNTvJ0U5wMpLsQFsjXrSwHOZsN1r6kNhcOR91BzxXE8mlitFQLRcZRBR6un-V5vUrcnr8fN31XolN-K1YcAEIy_At0AFXjIbydtFKBZWTgSarihrQ85AlPxnHvenek9He3oAkBgMY8_prUf2Wh8seTzOtW9N7hYQ9NmXoFEsfLpUUuogHRX-QAHW18NskAYLWsinmv07vZEJ0RKM1x5CNPw1GA29GlqZTS12EhvJi5GAPgnQM25UehF8_kRlWiuXln7hA18qup2Cmtdh_p0wpo96Dhgh7F8-OeLFDt2UjOxoCqIUlR0rryAnXDwcVcggEAwMxwVC-BMjfC-0dI3_kkaLxMpeQy-jX7Fse66SrUaYxutXpdS-VC5NDkYcBxSKpJJufMLD7go7eRJlGMxnlMweY24LmgNnY2Z1V1fg&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=1nBc9H%2BdSE7JOfTWtEx44g%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer - Internship",
    "company": "Raydar",
    "company_link": "https://www.linkedin.com/company/raydar-xyz/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQG1fXMvh_19dg/company-logo_100_100/company-logo_100_100/0/1669078545750/meta_work_logo?e=1752105600&v=beta&t=JT-JPEEg07WO9EKJTlyPuUqDWZkEQJyWXVED72ue8_Q",
    "place": "United States (Remote)",
    "description": "About the job\n\nSoftware Engineer Intern\n\n\n\n\nLocation: Remote (US-based preferred) | Internship (Part-Time or Full-Time)\n\n\n\n\nHelp build the future of AI-powered recruiting software.\n\n\n\n\nWe’re an early-stage startup on a mission to reinvent how recruiting agencies operate. Our AI-first SaaS platform automates and streamlines the full recruiting workflow—from sourcing and outreach to scheduling and CRM management. Our customers are high-performing agencies that rely on speed, precision, and technology that actually delivers.\n\n\n\n\nWe’re a lean, fast-moving team with real traction, real users, and ambitious plans ahead. We’re looking for a high-aptitude, driven Software Engineering Intern to work directly with the founding team. You’ll help us ship real product, experiment with cutting-edge AI integrations, and scale systems that power the modern recruiter’s toolkit.\n\n\n\n\nWhat You’ll Do\n\n\n\n\nBuild features across the stack (Python, FastAPI, Postgres, React, TypeScript)\nIntegrate with external APIs like Apollo, Smartlead, and recruiting CRMs\nShip fast—turning prototypes into live features in days, not weeks\nContribute to key architectural decisions around infrastructure and scalability\nHelp define how AI can replace manual recruiting workflows end-to-end\n\n\n\n\nYou Might Be a Fit If You\n\n\n\n\nHave strong coding fundamentals and pick up tools quickly\nAre excited by startup environments, ownership, and high-impact work\nThink deeply about product experience—not just function, but feel\nEnjoy solving hard problems, debugging fast, and optimizing for speed\nAre curious about AI, automation, or the future of B2B software\nWant to build something real and get it in users’ hands\n\n\n\n\nBonus Points For\n\n\n\n\nExperience working with LLMs or agent frameworks\nUnderstanding of outbound email infrastructure or deliverability\nPast internships or side projects at startups\nBuilt your own tools or shipped indie projects—even if unfinished\n\n\n\n\nWhat You’ll Get\n\n\n\n\nHands-on experience. Work on critical product features with real users.\nMentorship. Collaborate closely with experienced founders and operators.\nAutonomy. We treat interns like core team members, not task runners.\nImpact. Your code will ship, get used, and shape what we build next.\nOption to grow. High-performing interns may be offered a full-time role.",
    "date": "2025-05-08T14:30:49.097652"
  },
  {
    "job_id": "4226360986",
    "link": "https://www.linkedin.com/jobs/view/4226360986/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=RJKw7a2vppOAEObw2%2B83vg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer Intern",
    "company": "Studio23Labs",
    "company_link": "https://www.linkedin.com/company/studio23labs/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGWVeyYQ7mRYQ/company-logo_100_100/B4EZadpeWbHcAQ-/0/1746401617671/studio23labs_logo?e=1752105600&v=beta&t=jApnKi8Nou9fSAuDcbCXSuly-RsfHU3lL_jwWroN2qk",
    "place": "United States (Remote)",
    "description": "About the job\n\nJOB INFORMATION—-------------------------\n\n\n\n\nPay: $25/hr, in addition to per-project bonus\n\n\n\n\nInternship Period: 4 weeks initially subject to unrestricted extensions\n\n\n\n\nAbout Studio23Labs:\n\nStudio23 Labs is a cutting-edge technology firm specializing in AI-powered software solutions that help organizations automate processes, enhance data insights, and improve operational efficiency. With a focus on innovation and impact, the company delivers high-quality custom applications, strategic consulting, and secure, scalable platforms for clients across industries.\n\n\n\n\nJob Description:\n\nWe're looking for a motivated Software Engineering Intern to join our dynamic team. This role offers hands-on experience with modern web technologies and development practices in a collaborative environment.\n\nPosition Overview\n\nThis internship provides an opportunity to work on real-world projects using React, Next.js, MongoDB, Python, and Nginx. You'll develop skills across the full stack while receiving mentorship from experienced engineers.\n\nResponsibilities\n\n • Assist in developing and maintaining frontend applications using React and Next.js\n\n • Write clean, well-documented code following team standards\n\n • Collaborate on database design and implementation using MongoDB\n\n • Support backend functionality using Python\n\n • Learn about server configuration and deployment using Nginx\n\n • Participate in code reviews and team meetings\n\n • Debug issues across the development stack\n\n • Document features and processes\n\nRequirements\n\n • Currently pursuing a degree in Computer Science, Software Engineering, or related field\n\n • Basic understanding of JavaScript/TypeScript and React fundamentals\n\n • Familiarity with HTML, CSS, and responsive design principles\n\n • Interest in learning server-side development with Python\n\n • Basic understanding of database concepts\n\n • Strong problem-solving abilities and eagerness to learn\n\n • Good communication skills and ability to work in a team environment\n\nNice to Have\n\n • Experience with Next.js or similar React frameworks\n\n • Basic knowledge of MongoDB or other NoSQL databases\n\n • Understanding of RESTful API principles\n\n • Familiarity with Git version control\n\n • Knowledge of deployment processes\n\nWhat We Offer\n\n • Hands-on experience with industry-standard technologies\n\n • Mentorship from senior developers\n\n • Exposure to full-stack development\n\n • Collaborative and supportive work environment\n\n • Opportunity to work on meaningful projects\n\n\n\n\nCANDIDATE'S ENTRY—----------------------\n\n\n\n\nBasic Information\n\nFirst Name; Last Name\nEmail:\nResume:\n\n\n\n\nSchool Information:\n\nSchool Name\nSchool Degree\nSchool Discipline; GPA\nLatest Transcript\n\n\n\n\nAdditional Information\n\nLinkedin Profile (Optional)\nAre you over 18 (Y/N)\nAre you located in the U.S and have unlimited and unrestricted authorization to work in the U.S.? (Y/N)\nAre you currently subject to any restrictive covenant, non-compete, non-solicit, confidentiality or any other agreement that may limit or restrict your scope and ability to work for Studio23labs LLC? (Y/N)'\n\n\n\n\nApplicants must be authorized to work for 20+ hours per week in the United States.",
    "date": "2025-05-08T14:30:50.359691"
  },
  {
    "job_id": "4223779716",
    "link": "https://www.linkedin.com/jobs/view/4223779716/?eBP=CwEAAAGWvBuWR664O2xSPAHWRVU6BBehw77N6RdiYTdp217WDb4xN50wtHQUUcQvxGjf85fwqVJyr33BACw02RmGI-OhDN--nCjSWtaz3Y3uXfkaU5OJRqODIQa1efukSbLoQC2fUmKo0DyylFQGgMxJNljxRMWoSOBv4sqLXbUEbGK0_p3hEJeL3AT-Urpq0mKiveZ64PB_FMWskLbcNS65zU-ZgfS3hxP9c79mOmTCyR9hXIDZXh2nzYVf7LpibvJ-A5NnzKze-3yYbKNMDJrXC-JWQ7WO5V-Uvl4TN1y_AkWxwkyR85qY8I4P4syPFNbL3pS--ilRXtrrX-RjH_B_lMR4FRtZL_Yw_ylymzI9a4Mnn0uoODGrk89ZkD6kYlpNV4TprAKpC1zNlwqUmfv_0gp3q67zdsJfIquLr_Rwzpp4KBDJ5PomLhrgrgfgQ4wn0HRiIlr3oSFCGuC8IKhcDIVXNyeCnlYzcmtseTTx-F3cOtMSpibEYgTQcnnP76J5DtsxBmju&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=XDQNBFomyPZwajrNPq6DJw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Stellar Consulting Solutions, LLC",
    "company_link": "https://www.linkedin.com/company/stellar-consulting-solutions/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQHqMsGAs2X5ag/company-logo_100_100/company-logo_100_100/0/1666027551517/stellar_consulting_solutions_logo?e=1752105600&v=beta&t=v2tXD5z3MPEDBLP7n_GRYr5Bd4JN03Ou0eR5OmqAeQM",
    "place": "United States (Remote)",
    "description": "About the job\n\nJob Title: Software Engineer\n\nLocation: Remote\n\nDuration: 6+ Months Contract\n\n\n\n\nPreferring someone with:\n\n ● Interest and experience within the hobby gaming industry\n\n ● Experience with eCommerce and high-volume transaction-based applications\n\n\n\n\nAs a Senior Software Engineer, you have a proven track record of success delivering projects of critical importance. You are comfortable with both greenfield development (including deployment pipelines) and working in existing microservices and monoliths. You write code that follows best practices, is maintainable, and is tested. You break down product requirements into units of work that can begin delivering value quickly and can easily be iterated upon. If you are someone who is a continuous learner, a problem solver, passionate about code quality and loves working with the latest and greatest technologies in a team environment – then this is the job for you!\n\n \n\n The Impact You Will Make Here:\n\n● You will build the backend (including datastores, APIs, and event streams) that will support our next-generation catalog, omni-channel inventory, price points, and orders systems.\n\n ● Ensure that our backend systems are highly performant and scalable to accommodate an ever growing amount of data and load.\n\n ● Work closely with internal teams integrating with our backend systems and ship iterative improvements based on their requirements and feedback.\n\nWhat You Bring to the Team\n\n ● Bachelor’s degree in computer science, information technology or a related field, or a combination of education and experience\n\n ● 7+ years of large-scale microservice application development (we’re using .NET Core, Docker, and Kubernetes in AWS), including experience with decomposing monolithic applications.\n\n ● Expert knowledge of multiple datastore technologies including both RDBMS (PostgreSQL, SQL Server) and NoSQL (MongoDB, Redis).\n\n ● Strong communication, leadership, and collaboration skills with teammates and stakeholders.\n\n ● A ship-often mindset and ability to break down requirements into components that can be released rapidly.\n\n \n\n You’ll Go Beyond If You Have:\n\n ● Interest and experience within the hobby gaming industry\n\n ● Experience with eCommerce and high-volume transaction-based applications\n\n ● Experience with:\n\n ○ GitHub Actions\n\n ○ Terraform\n\n ○ Automated testing\n\n ○ Kafka\n\n ○ Data sharding strategies\n\n ○ AWS Technologies",
    "date": "2025-05-09T14:30:51.644382"
  },
  {
    "job_id": "4224665377",
    "link": "https://www.linkedin.com/jobs/view/4224665377/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=7PbE8wkQL1RNxE84KqD1hg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Cook'd",
    "company_link": "https://www.linkedin.com/company/cookd-dev/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGSAZmrxhlzcA/company-logo_100_100/company-logo_100_100/0/1730915764621/cookd_dev_logo?e=1752105600&v=beta&t=GQVjhLW5R5TQO4zDCHoc9PyAz-_F3YadDXAuQamjn9E",
    "place": "United States (Remote)",
    "description": "About the job\n\nThis Isn't a Role at Cook'd — It's a way to apply to all the companies we're partnered with.\n\n\n\n\nWe are partnered with a bunch of companies that are searching for AI, Full Stack, and Founding Engineers, and we're looking for candidate that can just ship!\n\n\n\n\nWhat You'll Be Doing\n\nWhile each company is different, most roles share a few core themes:\n\nBuilding and scaling backend systems, APIs, and data pipelines\nIntegrate AI models into production\nDesigning and shipping product features with a small, fast-moving team\nContributing across the stack, especially in Python, Node.js/TypeScript, and React\nWriting clean, maintainable code in a modern cloud-native environment (Docker, Kubernetes, AWS/GCP)\n\n\n\n\nYou Should Only Apply If\n\nYou have solid software engineering fundamentals\nYou enjoy being hands-on across the stack\nYou're able to learn new technologies quickly\nYou thrive in a fast-paced startup environment\nYou're excited about the intersection of software and AI \nYou're open to full-time, in-person roles in NYC\n\n\n\n\nYou Should NOT Apply If \n\nYou prefer highly specialized roles with narrowly defined responsibilities\nYou're uncomfortable with the ambiguity and rapid changes of an early-stage startup\n\n\n\n\nWhat We’re Looking For\n\nFor Solid engineering fundamentals and a builder’s mindset\nExperience working with APIs, databases, and distributed systems\nCuriosity and initiative — you like figuring things out\nAbility to ship clean code quickly without constant oversight\nEagerness to learn and grow in a fast-changing AI ecosystem",
    "date": "2025-05-09T14:30:52.929943"
  },
  {
    "job_id": "4217062903",
    "link": "https://www.linkedin.com/jobs/view/4217062903/?eBP=CwEAAAGWvBuWR7zSnXUoSwcj2qB_ltX8Uv5fE3T1LtZCPAi7tJO-n2BL_v3bLWFHEWZPBx8hMhcSVER5Bv5FU0ZYWtM4hSMggwYuoKNhqbWdiKIADsHQOLwp7kl2und9as1nRLkLPXWtvmqcVlGDpFGdwq1Cn1u_Esn2S0z_Ojkqs3_6FfKrtd2l-9rruQRy247tURZOzSmLkQFrnDGlFgg9M5C68wo_xUINKOBAO5Cgj-or6ZkLWlLfZ-3dyKjR-37Ol9EL_k1xhow36i3EEF37EYra5NAufAw8t-ze438ZTnO6a4KcBiFMPOvxObPGH8HYJUZPWGYfrvrXJvMny4tZ4isBo8oCbr2_hLdqN8p2VdZ6FJVHC8UIPkHE9ya8s7Ua1y5ILAfG7EKw52tHsvFBTe69fmGHxAiiUwBIAIoZhaESQ3kemGyzHfeaSZMNHA62OfB3YvzMX5nSktgeSTr8RRsvpxaW8xTU6ltyx6tDOOeL-4UWn5JmaFHs6BYFrx5t8sBVdg&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=FtvMcFo2gLRDEKPSyoz0nA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Synchro",
    "company_link": "https://www.linkedin.com/company/wearesynchro/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQFVvN8WmY_DYg/company-logo_100_100/company-logo_100_100/0/1662734305366/wearesynchro_logo?e=1752105600&v=beta&t=Dc0TNk7OA58Jk5_t2l59RMd5rOZAPSiP7FszstQs5f0",
    "place": "United States (Remote)",
    "description": "About the job\n\nLooking for a mid-level Backend Engineer for a client of ours in the Privacy, Security, and Software space. 6 month project paying around 50/hour.\n\n\n\n\nAWS \n\nJavascript\n\nTypescript\n\nTerraform\n\nSnowflake",
    "date": "2025-05-03T14:30:54.189140"
  },
  {
    "job_id": "4221976948",
    "link": "https://www.linkedin.com/jobs/view/4221976948/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=UK4ZFUkPctHJEqFfFNC2Lg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer II (Remote - US)",
    "company": "Jobgether",
    "company_link": "https://www.linkedin.com/company/jobgether/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQEFATQCdWa6tg/company-logo_100_100/company-logo_100_100/0/1635587710644/jobgether_logo?e=1752105600&v=beta&t=wVyri86acQwWgC1v31pfii29kqrmOYBr3jhSV31lFBk",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout Jobgether\n\nJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.\n\nOne of our companies is currently looking for a Software Engineer II in the United States.\n\nWe're seeking a talented Software Engineer II to join a high-impact data engineering team focused on building scalable, high-performance data pipelines and infrastructure in the cloud. In this role, you'll work with complex and high-volume datasets to support analytics, machine learning, and fraud prevention technologies. You'll partner closely with cross-functional teams to deliver real-time data solutions that power intelligent decision-making across products. This is a great opportunity for someone with a passion for big data technologies, cloud platforms, and operational excellence to grow their career in a mission-driven, fast-paced environment.\n\nAccountabilities:\n\n\nDesign and implement resilient data ingestion pipelines for diverse datasets including transactional and third-party data\nTransform batch or prototype pipelines into scalable, enterprise-grade systems\nDevelop distributed processing solutions using Apache Spark on AWS EMR\nCollaborate with data science, analytics, and engineering teams to integrate data-driven capabilities\nOptimize infrastructure for real-time identity scoring and fraud detection\nEnsure strong data quality controls, monitoring systems, and operational best practices\nIncorporate GenAI tools to automate data classification and feature extraction workflows\nManage infrastructure with Terraform or similar Infrastructure-as-Code tools\n\n\n\nRequirements\n\n\n2-4+ years of experience in data or software engineering, ideally in large-scale or real-time environments\nStrong programming skills in Scala, Java, or Python, with a solid grasp of system design and data structures\nExperience with Apache Spark or other distributed data frameworks (e.g., Hadoop)\nFamiliarity with AWS services like EMR, Lambda, Glue, S3, and Step Functions\nProficiency in SQL and data analysis across large datasets\nQuick learner with a collaborative, solution-oriented mindset\nStrong communication skills and ability to work across technical and business teams\n\n\n\nBenefits\n\n\nCompetitive salary: $150,000-$180,000 base (final offer may vary by location and experience)\nEquity package and performance bonus potential\nFully remote work model for U.S.-based employees\nComprehensive health benefits (medical, dental, vision, life insurance)\n401(k) retirement plan with matching\nGenerous paid time off and flexible scheduling\nAccess to professional development resources and GenAI technology exposure\nInclusive and mission-driven team culture focused on innovation and impact\n\n\n\nJobgether Hiring Process Disclaimer\n\nThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.\n\nOur AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.\n\nOur process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.\n\nIf you are among the top 5 candidates, you will be notified within 7 days.\n\nIf you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.\n\nThank you for your interest!\n\n",
    "date": "2025-05-06T14:30:55.483571"
  },
  {
    "job_id": "4227790275",
    "link": "https://www.linkedin.com/jobs/view/4227790275/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=Rg1g%2BVGDW7%2FgfKv4IMSRYg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer (Banking)",
    "company": "Wiraa",
    "company_link": "https://www.linkedin.com/company/wiraa/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQE9LwORhIbvLg/company-logo_100_100/company-logo_100_100/0/1692029735102?e=1752105600&v=beta&t=Np5ZlAb_vfe3B-csdya_FnRMO8cNYIGcaFqD7mPIeOA",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout The Company\n\nFirst Citizens Bank is a leading financial institution committed to providing exceptional banking and financial services. As part of its ongoing efforts to enhance its technology services, the bank is seeking a Senior Developer/Lead for the Consumer Banking Technology division. This role will be instrumental in driving technical excellence and innovation in the development and maintenance of complex systems.\n\nAbout The Role\n\nThe Senior Developer/Lead position is responsible for managing all phases of data processing system projects, from requirements definition to production deployment. The role involves leading technical efforts, providing architecture guidance, and ensuring the successful implementation and maintenance of complex systems. This position will focus on developing software solutions and test plans, improving processing capabilities, and resolving complex issues to support production systems. As a technical expert, the individual will also provide leadership and mentorship to less experienced team members.\n\nKey Responsibilities\n\n\nArchitect, develop, and maintain full-stack on-premises and cloud web applications.\nProvide leadership, technical guidance, and best practices during the solution design process.\nDesign and build strategic patterns and components for reusability while adhering to SOLID principles.\nCollaborate and demonstrate proof of concepts (POCs) to drive technical change and innovation.\nOversee all aspects of the software development lifecycle, including design, coding, code review, integration testing, deployment, and documentation.\nEstablish and enforce quality standards in software architecture and design.\nFocus on scalability, maintainability, testability, security, and performance in software development.\nThrive in a fast-paced and dynamic work environment.\n\n\nQualifications\n\n\nBachelor's degree and 6+ years of experience in software application development OR High School diploma/GED and 10+ years of experience in software application development.\nPreferred: 8+ years of experience in software development, with a strong focus on the banking domain.\nAt least 4 years of relevant experience in designing and implementing solutions using the Microsoft tech stack (e.g., .Net Framework, C#, Core Service, RESTful services).\n4+ years of experience with Java, Spring Boot, and Kafka.\nExperience with API gateways, Single Sign-On (SSO) solutions using OKTA, and JWT.\nStrong knowledge of microservices, event-driven architecture, and service-oriented design.\nExperience with front-end frameworks such as Angular (16+), ReactJs, and ReactNative.\nProficient in JavaScript frameworks and modern web design principles, including HTML5/CSS3, SaSS, and Flex layout.\nHands-on experience with microservice/API design using MuleSoft or TIBCO.\nFamiliarity with DevSecOps, containerization, and platforms like Kubernetes.\nExperience with databases like SQL DB, ETL solutions, and Azure Platform is a plus.\nExperience in Agile/SAFe scrum methodologies.\nStrong problem-solving and communication skills.\n\n\nBenefits\n\nFirst Citizens Bank offers a competitive benefits package, including healthcare, retirement plans, and various employee incentives designed to meet the needs of its associates. Details of the benefits package will be discussed during the hiring process.\n\nEqual Opportunity\n\nFirst Citizens Bank is an Equal Opportunity Employer and is committed to ensuring that all qualified applicants receive consideration for employment without regard to race, color, sex, national origin, sexual orientation, gender identity, religion, age, disability, genetic information, protected veteran status, or any other status protected by applicable law.\n\n\n\nDesired Skills and Experience\n\nInformation Technology",
    "date": "2025-05-10T12:30:56.734596"
  },
  {
    "job_id": "4225464449",
    "link": "https://www.linkedin.com/jobs/view/4225464449/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=p3hqTfP58eN0RW4ReWHPIA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Development Intern",
    "company": "hotsourced",
    "company_link": "https://www.linkedin.com/company/hotsourced/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQEofS9Cw1kaUw/company-logo_100_100/company-logo_100_100/0/1719257266898/hotsourced_logo?e=1752105600&v=beta&t=h9c8oz_eoSsCn3tfzRTi57EVUKOjqZxbGPdFg6LZysw",
    "place": "United States (Remote)",
    "description": "About the job\n\nWe’re offering an exciting internship opportunity for students currently enrolled in a BSc or MSc program, passionate about engineering and eager to dive into the world of commercial web application development.\n\nAs a Software Development Intern in our dynamic team, you’ll gain hands-on experience in developing cutting-edge software using modern technologies and frameworks.\n\nYou’ll work alongside our talented developers on various aspects of application development, from coding to design, in an environment that values good engineering and customer-centric design.\n\nThis internship is your chance to contribute to projects that reach thousands of users worldwide while being mentored by some of the best in the industry. If you’re ready to take your coding skills to the next level and make a real impact, we want to hear from you.\n\n\n\n\n\nResponsibilitie\n\nsAssist in the development and testing of commercial web application\nsCollaborate with senior developers on various software development project\nsApply user-centered design principles in software developmen\ntParticipate in agile development processes and team meeting\nsContribute to the improvement of existing software and the creation of new feature\n\n\n\n\ns\nRequirements and skil\n\nlsCurrently enrolled in a relevant BSc or MSc progr\namInterest in commercial web application developme\nntKnowledge in at least one object-oriented web framewo\nrkInterest in user-centered interaction desi\ngnAgile thinker and capable of working effectively as part of a te\namMotivated to learn new technologies and framewor\n\n\n\n\nks",
    "date": "2025-05-10T13:30:58.035932"
  },
  {
    "job_id": "4226377082",
    "link": "https://www.linkedin.com/jobs/view/4226377082/?eBP=CwEAAAGWvBuWRw7droWjA53IbqSZqo5TFn_h0UWTOHd6n2JN4WDTp2h1dU1-X5ocORB9d7CuwBCUtQL-dBcbTa9qJq7GgYpvovurMZdIGeWBPHXNDtqc65WTDofkjw-9SnTpcMd2qQsryZplOWKFabO9DzAyqMFSMX_ckGztKDPpJ-w3l-cA4FISRj3OuH7-ssLoBVDEhA4T8RW7ZNTv3evugGcduI4ngZsXbNN9Ymet9x4swFQqTNNsKEwHgvDgWazIH2KxZZioV572rL5cAeJuA86SgILtX38ZU3BVOVHBvF2UzNlTVfj1z1F-CD4v6nlkPLAopMnIVAWbaiG8twxgDULU9OdL55qkoouiOtVmNnyKbsPZKi8AspzGO6nHNifrS_s8QC-uRg5Rh430gOVwFhu7PWxGzOgeF3NH5ZsyDeLbhL-t9z1jCziT_2BPLu7K51foYbmX9s86MfePLwgCVHAMeBi9fB4RtVUq3BcT7wJRP8h32YR3trPEK97hZ6oS-BF_tIU4KWg&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=W7%2BSbhpx53k7wE4Pa5sWYg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Talent Groups",
    "company_link": "https://www.linkedin.com/company/talentgroups-connections/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGS3TP5aPm3XQ/company-logo_100_100/company-logo_100_100/0/1695120243789/talentgroup_staffing_logo?e=1752105600&v=beta&t=89mpfUtwv6yfBFWletPtBEtbxz4QolEBc41VmC45U3Q",
    "place": "United States (Remote)",
    "description": "About the job\n\nRemote (Mountain or Pacific Time Zones Only) \n\nCannot reside in: California, Washington, Nebraska, or Wyoming\n\n\n\n\nLocation: 100% Remote (Must work Alaska Time Zone hours)\n\n\n\n\nDuration: 6-month Contract to Hire as W2 employee of Talent Groups.\n\n\n\n\nWe have an exclusive opportunity with a mid-sized telecommunications company focused on expanding access to vital internet services in rural U.S. communities. This organization is actively hiring a Mid-Level Software Engineer to support their internal application development team.\n\n \n\nKey Responsibilities\n\nDesign, develop, and maintain internal business applications using .NET and related technologies\nCollaborate with engineering team members across the Western U.S.\nContribute to platforms including billing systems, customer support tools, and internal service apps\nParticipate in daily standups, code reviews, and deployments\n\n\n\n\nRequired Qualifications\n\nBachelor’s degree in Computer Science or related field\nOR 4+ additional years of software development experience in lieu of a degree\n5–10 years of software development experience\nStrong hands-on experience with .NET / C#, Angular and SQL\nExperience in Java development environments is a plus\nComfortable working in Linux environments\nMust be comfortable working Alaska Time Zone hours",
    "date": "2025-05-08T14:30:59.261902"
  },
  {
    "job_id": "4227404858",
    "link": "https://www.linkedin.com/jobs/view/4227404858/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=8U%2F6BCev3MQJGtqK6miyXg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer II with verification",
    "company": "Experian",
    "company_link": "https://www.linkedin.com/company/experian/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQE0Wm7-5HlQ0Q/company-logo_100_100/company-logo_100_100/0/1720618979628/experian_logo?e=1752105600&v=beta&t=mmitKVIDenrNxrmGlLX4qCMWyu7yaxYVmb9Xex13-4c",
    "place": "United States (Remote)",
    "description": "About the job\n\nJob Posting - Salary Range: $80,237 - $139,077\n\nCompany Description\n\nExperian is a global data and technology company, powering opportunities for people and businesses around the world. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics and software. We also assist millions of people to work towards their financial goals and help them save time and money.\n\nWe operate across a range of markets, from financial services to healthcare, automotive, agribusiness, insurance, and many more industry segments.\n\nWe invest in people and new advanced technologies to unlock the power of data. As an FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 22,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com\n\nJob Description\n\nReporting to the Software Engineering Manager the Software Engineer II will:\n\n\nRequirements Analysis and Design\nAttend and contribute to discussions and backlog refinement\nTranslate functional requirements into technical requirements\nContribute ideas and estimates of tasks and risks according to process and team standards\nContribute ideas for technical design\nDevelopment \nImplement correct and reliable code\nInvestigate and fix defects\nCreate automated tests at all levels\nRun the automated test suite, analyzing and assessing the test results\nEnsure that code created is of the required quality standards\nTest Automation & DevOps \nImplement test automation script and pipeline\nMaintain the result of the automation\nImprove test automation whenever possible\nImplement DevOps change to support product and test pipeline development\nDeployment \nProvide support to implement and operations teams to install/upgrade and maintain delivery environments\nSupport managing CI/CD pipelines\nAgile Teamwork \nParticipate in all Agile meetings\nCoach more junior team members\n\nQualifications\n\n\nExperience in Java, Rest API, Spring Framework, Spring-MVC, Spring-Security\n2+ years of experience\nKnowledge of OOP principles, data structures, algorithms and design pattern\nKnowledge of SQL, NoSQL and relational databases\nKubernetes, Docker and AWS, EKS, Jenkins, Kafka, Maven, unit testing frameworks, Prometheus/Grafana/Dynatrace/Datadog/Splunk\\UI testing (Selenium, Cypress or similar)\nExperience with test automation frameworks, monitoring and analytics tools\nExperience with microservice architectures, building tools, version control system – preferably Git, Virtualization/Containerization\n\n\nBenefits/Perks\n\nAdditional Information\n\n\nGreat compensation package and bonus plan\nCore benefits including full medical, dental, vision, and matching 401K\nFlexible schedule, ability to work remotely, hybrid, or in-office\nFlexible time off, including volunteer time off, vacation, sick, and 12-paid holidays\n\n\nAdditional Information\n\nOur uniqueness is that we celebrate yours. Experian's culture and people are important differentiators. We take our people agenda very seriously and focus on what matters; DEI, work/life balance, development, authenticity, engagement, collaboration, wellness, reward & recognition, volunteering... the list goes on. Experian’s people first approach is award-winning; Great Place To Work™ in 24 countries, FORTUNE Best Companies to work and Glassdoor Best Places to Work (globally 4.4 Stars) to name a few. Check out Experian Life on social or our Careers Site to understand why.\n\nExperian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is an important part of Experian's DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, irrespective of their gender, ethnicity, religion, color, sexuality, physical ability or age. If you have a disability or special need that requires accommodation, please let us know at the earliest opportunity.\n\n",
    "date": "2025-05-09T17:31:00.644873"
  },
  {
    "job_id": "4227438712",
    "link": "https://www.linkedin.com/jobs/view/4227438712/?eBP=CwEAAAGWvBuWR5o5Z4sVpMFcV5GInKnRf693VlNZalrytxQR3mfRVsrehBNiC8g-rj0Y1FioWn1lgLiF9znWyuaZqalUR0akmwjLsgwRTyQKZh4cTlZjw6cUNBpDzUPkV-wdDUl415oQ-WOzCZSPhZLRjAqB5QGL21h61LieNZWpBo_DLt53zY6ZOFBmwaC9I9X2PZq4hnkLI8iDMDbG0L04Mzi3xMZ1NnFN80oiZycJpTe7LNHzp0JlPmAuyRuIViIy-H6hWZ8mRpwTkKUL_t0me2N6N1vuy4sK9UnDJqYP0m6HJ017NDlWCWZ4o3q-CPo3JjAAsn_GqJKCJLMRk23_FG2w32Yib74V-ex62LqOtjD2_94wzUDbcJlHeMp5uom7VZniY00KKxkVO9qjDreRouiCHGsMU6ruXkbhov-tJ0xq0Fns4jVfLz-ugIZKlyGPpkDSJI0kNtgSeNG6dfi36mV2n_8-QplTxJozvTyQM2eomavZh1L9iId3CwRsSYZx2RHNYP9yLYY&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=8SS2NPBGcG6k4uvzkT7obA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Software Engineer with verification",
    "company": "Roc Search",
    "company_link": "https://www.linkedin.com/company/roc-search/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQFzDYXnRcAPiQ/company-logo_100_100/company-logo_100_100/0/1735816869383/roc_search_logo?e=1752105600&v=beta&t=zbrapgxCXggJWIdoHwpOH7hn3AtgDsNffpux3G_8tKA",
    "place": "United States (Remote)",
    "description": "About the job\n\nRoc Search is currently working with a leading technology organization that is looking for a Full Stack Software Engineer to join their team.\n\n\n\n\nAs the Full Stack Software Engineer, you will play a key role in helping build a cutting-edge internal AI platform, designed to transform the way users give and receive feedback. This LLM-powered tool will directly support performance reviews by integrating with Workday and the internal systems, enabling managers and employees to generate high-quality summaries and interact with our career frameworks via natural language queries.\n\n\n\n\nKey Responsibilities:\n\n\n\n\nPDesign and build a 0→1 enterprise-grade, user-facing product powered by Large Language Models (LLMs)\nIntegrate securely with Workday APIs andthe company's internal systems, ensuring proper authentication and data access controls\nArchitect and maintain a sandboxed data index, ensuring user-specific data access\nLead or contribute to key technical decisions regarding tech stack and system integration\nDevelop accessible and responsive front-end interfaces using React and TypeScript\nBuild RESTful APIs and backend logic using FastAPI (Python) and PostgreSQL\nLeverage OpenAI APIs and LlamaIndex for semantic search and summarization capabilities\nCollaborate in agile sprints, using tools like Asana or Jira to track bugs, enhancements, and user feedback\nContribute to internal UI libraries and design systems, promoting consistency and accessibility across platforms\n\n\n\n\nQualifications:\n\n\n\n\nStrong experience in backend development, especially with Python, FastAPI, and external API integrations\nProficiency with modern front-end technologies, including React, TypeScript, and responsive UI design\nDeep understanding of OAuth workflows, particularly for enterprise apps \nFamiliarity with Workday data models and HRIS system integration\nAbility to work cross-functionally with design, product, and people teams to ship high-quality software\nComfortable operating in an agile team environment and contributing to team rituals (standups, retros, sprint planning)\nExcellent communication and problem-solving skills\n\n\n\n\nPreferred Qualifications:\n\n\n\n\nExperience working with OpenAI APIs or similar LLMs (e.g., Anthropic, Cohere)\nFamiliarity with Workday APIs, internal HR tech stacks, or enterprise tools like ServiceNow, Asana, or Greenhouse\nPrevious work on performance feedback platforms, career frameworks, or people enablement tools\nPortfolio of past projects, showing real-world examples of problem-solving, UI/UX, and integration capabilities\n\n\n\n\nRecap:\n\n\n\n\nLocation – Fully Remote\nW2 Rate – $50/hr - $65/hr dependent on relevant experience\nLength – 8 month Contract with potential to extend\n\n\n\n\n\n\n\nIf you think you're the right person for this job, we’d love to hear from you!",
    "date": "2025-05-09T19:31:01.938329"
  },
  {
    "job_id": "4226374747",
    "link": "https://www.linkedin.com/jobs/view/4226374747/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=IJf4kTS4QDBDZw7xviNBYw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Java / VB Software Developer",
    "company": "Mindfore Technologies",
    "company_link": "https://www.linkedin.com/company/mindfore/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQF4-2P2DRxrfw/company-logo_100_100/company-logo_100_100/0/1630589331727/mindfore_logo?e=1752105600&v=beta&t=MiZ8WrirRAmza_JjmbGgc2lCjoQyAMWLa5gSIG72IW4",
    "place": "United States (Remote)",
    "description": "About the job\n\nJob Title: Java / VB Software Developer Location: Austin, TX – Remote Job Description:\n\n\n 8 Required Visual Basic (VB) Development Experience \n 8 Required Java Development \n 8 Required Database and query development for Microsoft SQL Server",
    "date": "2025-05-08T14:31:03.224390"
  },
  {
    "job_id": "4224218250",
    "link": "https://www.linkedin.com/jobs/view/4224218250/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=F6eREvv8gvSOnHj5kGyDcQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer Internship",
    "company": "Wealth.com",
    "company_link": "https://www.linkedin.com/company/wearewealth/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQFIl6IEVkgXFA/company-logo_100_100/company-logo_100_100/0/1696870884483/wearewealth_logo?e=1752105600&v=beta&t=_hQlC3els5A7nmmjnjORUb9pzJABKhyxc2Uqwg4S5xw",
    "place": "United States (Remote)",
    "description": "About the job\n\nWealth.com is the industry’s leading estate planning platform, empowering financial advisors to offer modern, comprehensive estate planning solutions to their clients. By combining cutting-edge technology, AI, and unmatched human expertise, we deliver a seamless experience that sets us apart. Beyond having one of the most coveted domain names in FinTech, wealth.com is a dynamic, revenue-generating startup experiencing rapid yet sustainable growth.\n\nA key reason behind our position as the #1 estate planning platform is our team. Our people thrive in a collaborative, supportive culture that fosters innovation and makes wealth.com a place where everyone truly enjoys working. Wealth.com is certified as a Great Place to Work for 2024 and named a 2024 finalist for Fast Company ’s Best Workplaces for Innovators!\n\nLooking to gain practical, hands-on experience in the field of software engineering?\n\nThe Wealth.com Technology Internship Program is a critical program within Technology Services that helps passionate early career professionals gain real-world exposure to ground breaking technology.\n\nSoftware Engineer Interns work collaboratively with Software Engineers to pursue a broad range of initiatives. By using technical skills and a thirst for innovation, interns will help produce user-friendly frontend interfaces and experiences.\n\nThe Software Engineer Intern Will\n\n\nHelp design, modify, define and implement technology solutions; building modern, architecturally sound components, tools and applications to meet strategic business goals.\nParticipating in an Agile environment, adhering to best practices and collaborating effectively with your teammates.\nHelp to build a React web application\nResearch and gather documentation to ensure the quality of user documentation; create progress reports.\nImprove system quality by identifying issues and common patterns, and develop standard operating procedures.\nEnhance applications by finding opportunities for improvement, make recommendations and design and implement systems.\n\n\nQualifications\n\n\nCurrently pursuing a Bachelor's degree in Computer Science, Software Development, or other technology-related degree\nMinimum GPA 3.0\nSolid understanding of one or more of the following programming languages, frameworks, libraries and data formats: JavaScript, React\nDemonstrated ability to operate in a team environment; good interpersonal and communication skills\nPrevious professional exposure to software development and/or engineering\nPlease note that U.S. Immigration sponsorship or work visa is not available for this position and candidates must have permanent authorization to work in the U.S.\nHours per Week: minimum 20; up to 40\nThis internship program will be June 2 - August 15, 2025\n\n\n$25 - $30 an hour\n\n$ 25.00- $30.00/ Hour\n\nThis position is not eligible for benefits\n\nWealth is an equal opportunity employer and encourages people from all backgrounds to apply. Should you have a disability or special need that requires accommodation, please let us know.",
    "date": "2025-05-09T14:31:04.550435"
  },
  {
    "job_id": "4214694351",
    "link": "https://www.linkedin.com/jobs/view/4214694351/?eBP=CwEAAAGWvBuWR90bIceT9FD3CSGRyBC_1FswOH-O7vIimHJeDMMXqNdv-x-yAUjIGNZYl6mpM2hzl5OUvzgAEhDIH-up0_BbLwUJhCFI3U5PuDJ5P7QxmjTv71uW9vntvLeRNmSrFAnSuSDNw3_8jHgM5KgfwTW80Z4zOjMMsfbXAn1OuDhYUIPN6cV7ND4zQJdzBUh-Avh9M2GdNzwpS-etcXnEFHoWdpflJeg6HjTj7iprbV7n0mqdryRxHlTBIVYifwzyl0w9fTDYjS3NDksTNXO5vXInjJcGVR-SPAGd64Hj6QAkUxfmoG7aUsH1GJhINY3QuSxUsBq7QOPNYD3if9xIAhvjks0Qo21qaunNfCWu4xbq1pB4UPA5S8MMuwGuAopKEFweWz0bAQ1hGpG7u8Qh0lir26hMKk9hIPMRkEpO3l3oH82ouqCb2dKMUdol31_Lmftkgu1-kEs71uttyFWUVPo7UywTiL7rPCoXCQlGnnhxXbo-R9UO7C17_qtqvrbBBrbgF4o&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=4ElGXhnseYdgLwKkbLq6aw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer with verification",
    "company": "Nira Energy",
    "company_link": "https://www.linkedin.com/company/nira-energy/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQFPO1pEBTvSPw/company-logo_100_100/company-logo_100_100/0/1630672290315/nira_energy_logo?e=1752105600&v=beta&t=A109cgM8dEoOYY8-9Xsr8orLRYmHdYI4g2eSiBLFcqA",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout Nira Energy:\n\nNira's mission is to help convert the US power grid to be 100% fossil-free.\nWe are profitable!\nNira is a software platform that helps renewable energy developers find the cheapest points on the grid to connect.\nWe focus on estimating the cost to interconnect with the electrical grid (aka the Interconnection Process). Depending on where developers connect, they may be on the hook to pay millions of dollars to upgrade power lines, substations etc.\n\n\n\n\nWhat You'll Do:\n\nAs a software engineer at Nira, you'll work on software and data products that our customers use every week. Your work will directly accelerate renewables getting built. This work could include rolling out new regions, adding new features or even building brand new products out.\n\nNira operates in the niche world of Grid Interconnection, which means as a SWE, you'll get to learn about how new renewables get connected to the grid. Day to day, you'll work very closely with Transmission Planning Engineers (TPEs) to get your job done. Both the SWEs and TPEs only have half the picture, so our teams have to be extremely cross-discipline and collaborative. Most teams are structured with 1 PM, 1 SWE and 1 TPE.\n\nMost of the code you'll write will be python data pipelines. There is occasionally some frontend work as well (having FE experience is not a requirement). However, the SWEs that do best here are the ones that don't really care what part of the stack they're working on - they're just excited to be building products that help fix climate.\n\n\n\n\nAbout You:\n\n4+ years as a SWE.\nMission-oriented and focused on working on climate.\nExcited about working with Transmission Engineers.\nOperate well in ambiguity and able to take ownership over large pieces of work.\nCapable of rolling with the punches; plans change at a growing startup.\nPython experience is a plus\nWe are hiring any kind of SWE, except for pure frontend engineers.",
    "date": "2025-04-26T14:31:05.773745"
  },
  {
    "job_id": "4225792412",
    "link": "https://www.linkedin.com/jobs/view/4225792412/?eBP=CwEAAAGWvBuWRzum0TPOUVM5TJuhwfESlUKN_oTVu9Jm9N3lUKYksr8bSYTrUU2y5LYXDUeDoIzWNiTy2wTNyXWLVSrRBchvDQpibHeINivrSotwHhF5aKTtJkPPJzhFg_tgUvgXOTXeAJkmmlPX2SHVPh489FveoQXdKH5BUV2gGSvEIkJVR64LGO8RZxcrTnP9bpxK3qwsWVzc3RFAskX27oGxsKKQIsibWdqYx0ma4e30mLypB9uKs2WtHGwQnLL-NaJwNOgcT8w__oHDYjNjCX1j72345rTHuRkQPsKjM-u7BYEkNq7nhlbi_D9gz-Rfpcu8a-Gie5YAgkBEl7PMZNWpRStw9R2navoDktWKX5gYg8WxzrI2HIh-WL6yqB0yvkAzk7F67bsdaakLOvSiY2sR4-m-rxwOIzmE1_WjVMLhDwHNp6Sodkm7WEDZCcQ55tKFOqcIBw8NhDrL8OEllyVMjY2qc2q6vvY6qN2Ondw4UZP7mXHSsqSPuAsEkTHN9uagxA&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=sbT58pbmdsR74E8O2YQ%2BeA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer with verification",
    "company": "Guidewire Software",
    "company_link": "https://www.linkedin.com/company/guidewire-software/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQEkvbgylJ8xYg/company-logo_100_100/company-logo_100_100/0/1719861372042/guidewire_software_logo?e=1752105600&v=beta&t=hwQsIJ3JxUS_vXznJGPXlF_1tHY6xPbHV2CmZ8y9rnI",
    "place": "San Mateo, CA (Hybrid)",
    "description": "About the job\n\nSummary\n\nAre you a result-oriented, polyglot programmer using 12-factor app methodology to craft your Cloud products? If so, we would like to meet you!\n\nGuidewire provides outstanding software for the second-largest financial services industry in the world: insurance. We deliver the core applications that Property and Casualty (P/C) insurers use to build their products, sell policies, settle claims, and bill their customers. We deliver SaaS solutions via Guidewire Cloud that enable our customers to rapidly innovate and drive measurable value. Guidewire Cloud is powered by the highly resilient Amazon Web Services (AWS) cloud infrastructure, with SLAs backed by experienced Guidewire teams and SaaS-certified partners spanning application management, system administration, security and compliance, upgrades, QA testing, health checks, and other services.\n\nJob Description\n\nWhat you get to do\n\n\nMaking an impact with your contribution in building the industry leading cloud platform as a service\nCraft microservices, components, & tools to automate the life cycle of highly available (HA), distributed services and applications on multiple platforms!\nEngineer quality, scalability, availability, and security into your code.\nProtect your products with the assurances of automated testing.\nDeploy containerized applications to AWS through your Continuous Integration (CI) and Continuous Deployment.\nWork with highly skilled team members, operations team, product managers, and architects as we collaborate to write code / algorithms, mentor one another and build infrastructure and software that matters.\n\n\nWhat You Bring To Guidewire\n\n\n1-3 years of relevant work experience\nA discerning comprehension of standard REST API / gRPC for data interchange\nPractical experience with microservices architecture concepts like Service Discovery / API Gateway etc.\nLinux debugging skills\nBoundary-pushing software development skills in one or more of the following frameworks & languages: Java / Golang / NodeJS / Python / equivalent\nAdvocate for IaaS abstractions, containers technologies & cloud platforms (like Kubernetes / Mesos / Cloud Foundry / OpenShift, Docker, AWS / GCP / Azure, Serverless)\nPromote proven architectures (\"SOLID\"/Hexagonal) and other design principles\nMethodically approach distributed tracing and monitoring of apps\nReinforce sound repeatable automated services.\n\n\nNice to Have\n\n\nSoftware development skills in one or more of the following frameworks & languages: Java / Golang / NodeJS / Python / equivalent\nContainer technologies: Docker, Linux debugging\nStrong interpersonal skills, a demeanor emphasizing team wins over individual success\nComfort working in an agile, social and fast-paced environment.\n\n\nWhat You Should Know About This Role\n\n\nThis is an office-based position with the flexibility to WFH as applicable\nThis position is regularly involved pair programming.\nHow our CCS group operates: https://medium.com/guidewire-engineering-blog/a-day-in-the-life-of-a-cloud-common-services-engineer-c67cf3debc57\nWhat the general Interview process will be: https://medium.com/guidewire-engineering-blog/preparing-to-interview-with-guidewire-cloud-common-services-team-7d0697592929\nDevelop Multi-Tenant Cloud Platform that caters to running all Guidewire applications and services (Refer: https://medium.com/guidewire-engineering-blog/guidewire-cloud-why-hybrid-tenancy-is-the-right-choice-56a0ff176032, https://medium.com/guidewire-engineering-blog/guidewire-cloud-why-hybrid-tenancy-is-the-right-choice-part-2-of-2-ba22c9888bb8\nDeeply involved in design and development of GWCP/ATMOS - infrastructure as code using technologies such as EKS (Kubernetes), Terraform, Golang. In addition handle Observability of the Platform (logs, metrics and traces). (Refer: https://medium.com/guidewire-engineering-blog/log-management-and-guidewire-cloud-platform-observability-73a033a34e9a)\n\n\nThe US base salary range for this full-time position is $84,000 - $156,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nDisability Accommodations and Guidewire’s Appeals Process. Guidewire provides accommodations to the hiring process to create a fair opportunity for candidates with disabilities to contend for open positions. Accommodation requests should be directed to Accommodations@guidewire.com. If things do not go as hoped, we invite you to use our appeals process. Guidewire promises to independently review any denied accommodation and any decision not to offer you the position. The appeals process is the same in either case. Within five business days of receiving a notice of denial of an accommodation, or receiving a notice of your non-selection for a vacancy, e-mail Accommodations@guidewire.com to make an appeal. Guidewire will assign a new decision-maker to review the request and/or hiring decision, who will then notify you in writing of a decision within 10 business days.\n\nAbout Guidewire\n\nGuidewire is the platform P&C insurers trust to engage, innovate, and grow efficiently. We combine digital, core, analytics, and AI to deliver our platform as a cloud service. More than 540+ insurers in 40 countries, from new ventures to the largest and most complex in the world, run on Guidewire.\n\nAs a partner to our customers, we continually evolve to enable their success. We are proud of our unparalleled implementation track record with 1600+ successful projects, supported by the largest R&D team and partner ecosystem in the industry. Our Marketplace provides hundreds of applications that accelerate integration, localization, and innovation.\n\nFor more information, please visit www.guidewire.com and follow us on Twitter: @Guidewire_PandC.\n\nGuidewire Software, Inc. is proud to be an equal opportunity and affirmative action employer. We are committed to an inclusive workplace, and believe that a diversity of perspectives, abilities, and cultures is a key to our success. Qualified applicants will receive consideration without regard to race, color, ancestry, religion, sex, national origin, citizenship, marital status, age, sexual orientation, gender identity, gender expression, veteran status, or disability. All offers are contingent upon passing a criminal history and other background checks where it's applicable to the position.",
    "date": "2025-05-08T14:31:07.006700"
  },
  {
    "job_id": "4218308538",
    "link": "https://www.linkedin.com/jobs/view/4218308538/?eBP=CwEAAAGWvBuWR9L0zlk8mIVHU4ooAIaG4_EDWfhTN79hOabaGzDk6_ugG813USl0AQgNQoxqfVKddv43l39S2DW0zkP3iMQ98O4841aWQmGrlyPQXCtHO5eIIaWuN-leT0nC3teLS7QcyRDCRF6ysaU8QZNAd4w_qMhE5yEIAZqLr1j3Ikl_LvI8nczJMzrZ8V_haYWoyti-YGHJdfUrlmHYOsV7Shdns3PUSNAnPZwfsrQSq3rjLD97yXWXqag5W2Uv1rnsOXv2EbcOjmXWsizG3v7pkV9SE8J5AViw4_sA_Ro_hfkIySDiMrob_tDvxnhSjRyl0jYeoNCCdk6tPYrbzrNRkg0YZv6fqOUjKN2LbllQyiWS6hcp2LFN8PDD6JO3KVo4e2HKalJ74Du4tfpjmulBuy08cAd-xuAgNGf0aA_lUX2rJxWV4s_10y3lVAv3tdLcQLTuNvzzPy1vaaypy1DgQGrT3dpDHVEaA5dgEamYrlPZk6TUtKCBZfczYQBrzhkqgg&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=ChNwW52Vx47hqPnHPAGHLg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "React Software Engineer with verification",
    "company": "The Planet Group",
    "company_link": "https://www.linkedin.com/company/the-planet-group/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQF8HZX7j61YuA/company-logo_100_100/B4EZaG0X.sHcAQ-/0/1746018604833/the_planet_group_logo?e=1752105600&v=beta&t=JZFBnfVg6LL8WfFqSvMrTJJ-d-FDjxwS6lTtS512nJE",
    "place": "United States (Remote)",
    "description": "About the job\n\nNO THIRD PARTIES \n\n\n\n\n**US CITIZENS and GREEN CARD HOLDERS ONLY**\n\n\n\n\nHours: 40/week - business hours\n\nLocation: Remote - Working EST hours\n\nDuration: 6 Months +\n\nInterview process: 2 steps \n\n\n\n\nClient is looking for an individual contributor to support the analysis, design, development, modification writing, editing, and implementation of software programming apps.\n\n\n\n\nREQUIRED SKILLS / EXPERIENCE:\n\nExpert knowledge and Experience of React\nHands on experience on React native applications\nCommanding grasp of HTML 5, JavaScript/TypeScript, CSS and related web technology\nKnowledge and Experience of State based design and implementation\nUnderstanding of building, publishing and using NPM modules\nFamiliarity with NodeJS, ExpressJS and general Mean stack development\nWork with an advanced collection of APIs and tools already in place\nDemonstrate design and UX sensibility\n\n\n\n\nDesired Competencies\n\nExperience with Cloud Hosted React application\n\n\n\n\nJob Functions Responsibilities:\n\nUtilize your collaborative skills to work with business partners, IT managers/staff, to ensure best possible UI/UX design implementation.\nWork on design considerations for our investment in React that gets beyond how to we implement and more around designing for re-use, code management, reduced scope of deployments, etc.\nBuild Interactive UI that works great on various browsers, screen sizes and tablets/phones.\nKey member of a small, but strong team working on company’s core applications.\nParticipate in all parts of SDLS, including design, development, documentation, testing and supporting production\nImplement Unique Component Ids to help UI automation testing ensuring quality and reliability.\nIntegrate security practices into CI/CD pipelines using Jenkins, Git.\nImplement governance and compliance tools to ensure adherence to regulatory standards.\nRespond to security incidents and conduct vulnerability and penetration testing.\nCollaborate with teams for secure software development lifecycle integration.\nMaintain regular and punctual attendance.\n\n\n\n\nAt The Planet Group, we connect Technology experts with opportunities that match their skills, goals, and ambition. From fast-moving startups to global enterprises, we partner with top organizations across industries—giving you access to roles where your contributions make a difference. Explore flexible options including contract, direct hire, and contract-to-hire, all supported by a team that puts people first.",
    "date": "2025-05-03T14:31:08.389453"
  },
  {
    "job_id": "4227061389",
    "link": "https://www.linkedin.com/jobs/view/4227061389/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=YgArnwcPVwu%2BSxEAERXAlA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Developer",
    "company": "ICANotes LLC",
    "company_link": "https://www.linkedin.com/company/icanotes-llc/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQEVkrPDZreJkw/company-logo_100_100/company-logo_100_100/0/1631330744195?e=1752105600&v=beta&t=dARS3BhnVBqx_9OMr6cqzFuNvL1Ra6e1Azrmdc_qENo",
    "place": "United States (Remote)",
    "description": "About the job\n\nFull-Stack Developer\n\n\n\n\nCompany Culture:\n\nAt ICANotes, we believe in fostering a culture of continuous improvement and learning. We prioritize adaptability over inflexible processes and encourage cross-functional teams to work together and collaborate to achieve shared objectives. We promote transparency and open communication within teams and stakeholders while fostering a culture of trust, respect, and accountability among team members.\n\n\n\n\nPosition Overview:\n\n\n\n\nWe're seeking an experienced and motivated Full-Stack Developer with the ability to work independently with minimal supervision. Someone who can design, develop and implement highly scalable multi tenanted SaaS applications using full-stack open-source technologies. At ICANotes, we believe in fostering a culture of continuous improvement and learning, with a focus on agile methodologies. We prioritize adaptability over inflexible processes and encourage cross-functional teams to work together and collaborate to achieve shared objectives. We promote transparency and open communication within teams and stakeholders, while fostering a culture of trust, respect, and accountability among team members.\n\n\n\n\nThis is a hybrid work position involving both remote and in-person days in our office in downtown Baltimore, MD\n\n\n\n\nResponsibilities:\n\nWork independently in a small team of developers in the design, development, and deployment of a scalable application running on AWS.\nHighly motivated with a sense of urgency in delivering highly complex multi tenanted SaaS solutions with a focus on quality.\nAbility to work independently through all stages of SDLC from design discussion to implementation to testing to production deployment.\nWrite clean modularized code with unit and functional tests.\nAbility to troubleshoot issues in production environments.\nParticipate in code reviews and help deliver solutions with minimum production issues.\nPassionate about technology and bringing new ideas to the team.\nIs a multitasker with the ability to work efficiently and effectively within deadlines without compromising quality.\nExperience working with a startup or enjoy working in a startup like environment with ambiguity and speed.\n\n\n\n\nQualifications:\n\nBachelor's Degree with a concentration in Computer Science or related is preferred.\nAt least 4 years of experience working as a Full-Stack Developer.\nProficient in node.js and HTTP-related servers.\nExperience with MySQL, Postgres, Typescript, HTML, and SaaS.\nProficient in front-end development with Angular/React.\nExperience with Docker and a basic understanding of micro-services.\nExperience with a cloud provider: AWS, Azure, etc.\nAbility to investigate and analyze information/problems and to draw conclusions.\nStrong analytical and problem-solving skills.\n\n\n\n\nPreferred Skills:\n\nHealthcare software experience\nExperience using APIs to interact w/ AI endpoints.\nExperience with NestJS, RxJS, Nx, Kubernetes, and Terraform.\n\n\n\n\nBenefits:\n\nHealthcare (medical, dental, vision) - company pays for up to 75% of health insurance for both employee and dependents - some plans with HSA options\nBasic term and optional term life insurance\nShort-term disability (paid for by the company) and long-term disability\n401(k) and employer-matched retirement plan\nPaid time off that includes 8 sick leave days per year (80 hour annual rollover), 6 personal days per year (rollover all), and 12 vacation days per year (rollover all)\n\n\n\n\nNote: This job description is not intended to be all-inclusive. Employee may perform other related duties as negotiated to meet the ongoing needs of the organization.\n\n\n",
    "date": "2025-05-09T14:31:09.672780"
  },
  {
    "job_id": "4223607278",
    "link": "https://www.linkedin.com/jobs/view/4223607278/?eBP=CwEAAAGWvBuWR9IuapSAtDKL4bGCURN3ep0GjdhDjNI0OGHG59BRt7ogG9hiw1kajm4H5ogtJF9ZjolwpPoZZs6MIpqk-HR334-eSofUNa2gA8aGRimL5bfsQI9sVP3FcE-sehvaDwj3-tq43qty5dW62TqVLMo8xsF11VFsBa2cs0cunBFwGkLO-AoOjHSd-PXchcI1cTzqDmkjShUEKlNGITuRkwZPKnE9GC1g69lNaUSKqbEew2mGSxEsqmuHuJ9dZJfcUjbbhIukYVkygSjrbsvB0MjpzzQy4zGwyoGQof_rpkHRvA-j-OTZQcypAj4DHcANounzosOWAzpvBn_F6ol9vuSjfHiFVUWHLRtGrc3nUuAL0_etqE2rrtvAoNvDFCNdNlN_zhLBqFBFL9Rz8uIr5RGZQRY5992B_AGFvGYTQD4lt90CKQhdE-ovl8YZBRow2Ng7s8YigIsAKrdH2sbR8YmO0cW1W6IJzBNBgFBNZVfWXUa-JK-6WTPjczNihfaFwAuhTPE&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=csoboOb346TcS3WAmUfhpw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Frontend Developer",
    "company": "Prime Team Partners",
    "company_link": "https://www.linkedin.com/company/prime-team-partners/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQGCKs8mBVQNsw/company-logo_100_100/company-logo_100_100/0/1692899302126/prime_team_partners_logo?e=1752105600&v=beta&t=TFpzlqjV1sK7xXHVUV8E8w6PEkckFBbk8UNBv-tYkBg",
    "place": "United States (Remote)",
    "description": "About the job\n\nFrontend Developer – Early Career\n\n100% Remote opportunity\n\nUnable to sponsor visa at this time\n\n$40,000-$45,000 base + $40,000-$45,000 company stock + $250/mo stipend\n\n\n\n\nAre you ready to be part of an indie-centric social music revolution? Our client is on a mission to empower independent artists and their fans by creating the most authentic, comprehensive platform in the industry. Featuring a full streaming service, vibrant community features, cutting-edge e-commerce tools, and countless ways to connect, our client is redefining how indie music is celebrated and experienced.\n\n\n\n\nWe're on the lookout for a Frontend Developer to join the journey. If you're passionate about indie music and have a knack for crafting consumer-centric services and mobile applications, this role is for you.\n\n\n\n\nWhat You’ll Do:\n\nDevelop and deploy robust, high-quality solutions that drive user satisfaction.\nCollaborate with cross-functional teams to design and deliver scalable applications.\nParticipate actively in Agile Ceremonies (Stand-ups, Retrospectives, etc.).\nOffer insights and suggestions for technical requirements.\nMaintain functionality as outlined by User Stories.\nContribute code daily to a shared repository (CodeCommit).\nInvestigate and resolve bugs across testing and production environments.\nWork with a tech stack that includes React Native, Next.js, and TypeScript.\nPartner with near-shore development teams for seamless integration.\n\nWhat You Bring:\n\nA deep passion for indie music and an understanding of its unique challenges.\n3-5 years of software development experience.\nProficiency with React Native, Next.js, and TypeScript.\nExperience in mobile development for iOS, Android, and React Native.\n\nWhy Join?\n\nBe part of an innovative platform transforming the music industry.\nWork in a collaborative and dynamic remote environment.\nCompetitive pay and growth opportunities\n\n\n\n\nPrime Team Partners is an equal opportunity employer. Prime Team Partners does not discriminate on the basis of race, color, religion, national origin, pregnancy status, gender, age, marital status, disability, medical condition, sexual orientation, or any other characteristics protected by applicable state or federal civil rights laws. For contract positions, hired candidates will be employed by Prime Team for the duration of the contract period and be eligible for our company benefits. Benefits include medical, dental and vision. Employees are covered at 75%. We offer a 401K after 6 months, we do not provide paid holidays or PTO, sick time is offered in accordance with local laws.",
    "date": "2025-05-07T14:31:10.949564"
  },
  {
    "job_id": "4189842654",
    "link": "https://www.linkedin.com/jobs/view/4189842654/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=bcJJhN3a2w7r6jrPL%2BzkDg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Summer 2025 Technology Intern with verification",
    "company": "Forbes",
    "company_link": "https://www.linkedin.com/company/forbes-magazine/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQF67bPz45hiLw/company-logo_100_100/company-logo_100_100/0/1696813943410/forbes_magazine_logo?e=1752105600&v=beta&t=-wlOilDjVY47F0n1Ff7sqrCIYNMHzbbLmn3rqB8uKs0",
    "place": "United States (Remote)",
    "description": "About the job\n\nForbes believes in the power of entrepreneurial capitalism and uses it on various platforms to ignite the conversations that drive systemic change in business, culture and society. We celebrate success and are committed to using our megaphone to drive diversity, equity and inclusion.\n\nForbes is looking for multiple summer interns to join the tech team, collaborating together on exciting future-looking projects. Summer Interns will work closely with their manager/mentor as well as a project lead to plan and execute work in a collaborative team environment. This is an opportunity to work across technical disciplines bringing your specific interests and skills to the table, in a highly collaborative environment. If this sounds like the opportunity of a lifetime to you, it is! We are looking to hire interns with skills and interest in the following topics.\n\n\nAutomation and Test Engineering\nFeature Development \nDevOps, Cloud and Infrastructure\n\n\nResponsibilities\n\n\nCollaborate with cross-functional teams to develop, test, and maintain software and data solutions\nContribute to the design and implementation of scalable and efficient code\nDebug and troubleshoot software issues\n\n\nThe Ideal Candidate\n\n\nYou have experience in any of HTML/CSS/Javascript, React, Kotlin, Java, AWS, GCP, Python, Node.js, Jenkins, Angular, Golang.\nYou are excited to deliver well documented work.\nYou pride yourself on your analytical skills.\nYou are excited about making something used by Journalists that write articles read the world over.\nYou are open minded and eager to learn new tools and skillsets.\n\n\nAbout Our Summer Intern Program\n\n\nOur internships are paid.\nThis internship is approximately 40 hours/week Monday-Friday.\nInternships begin mid-June and end mid-August\nInterns are invited to weekly presentations to hear from leaders within the organization.\n\n\nThis role can be fully remote (within the U.S.), in-person based out of Jersey City, NJ, or on a hybrid work schedule.\n\nThe hourly rate for this role is $21.00 - $21.00\n\nForbes has estimated the compensation range set forth above in good faith. The compensation range is what we believe we will offer, and ultimately pay, a successful candidate. In determining this range, we consider the experience, level of education (if applicable to the role), knowledge, skills, and abilities required to be had by a successful candidate as well as the budget and the company’s pay rates, generally. This said, we may have to make changes to our compensation estimates and job descriptions from time to time and we expressly reserve the right to do so. Should we make any such changes, this advertisement will be revised to reflect such revisions. We encourage you to occasionally re-visit this advertisement to ensure that you are abreast of any changes. Thank you for your interest in joining Forbes!\n\nForbes aims to offer employees the flexibility they need in order to be successful. Some positions may require candidates to be based in a specific location for consideration while some roles may be fully remote (within the U.S.) if it aligns with the needs of the position. This position is only open to candidates residing in California, Colorado, Connecticut, District of Columbia, Florida, Georgia, Maine, Maryland, Massachusetts, New Jersey, New York, North Carolina, Pennsylvania, South Carolina, Tennessee, Texas, & Washington. Due to business operations and compliance requirements, we are unable to consider applicants based outside these states at this time.\n\nForbes is an equal opportunity employer.\n\nStaff and Applicant Privacy Notice\n\nNotice of E-Verify Participation\n\n",
    "date": "2025-05-10T14:31:12.247581"
  },
  {
    "job_id": "4227150301",
    "link": "https://www.linkedin.com/jobs/view/4227150301/?eBP=BUDGET_EXHAUSTED_JOB&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=hgX8Oc23FUIzptoXyfHEqA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Java Developer",
    "company": "Inherent Technologies",
    "company_link": "https://www.linkedin.com/company/inherent-technologies-pvt-ltd/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C510BAQGmEh1ksznr8w/company-logo_100_100/company-logo_100_100/0/1630604464410/inherent_technologies_pvt_ltd_logo?e=1752105600&v=beta&t=PgqP_CkRt553UWz29ol2Vaf-f6YknOzW93pj-nLOAt0",
    "place": "Fremont, CA (On-site)",
    "description": "About the job\nThis job is sourced from a job board. Learn More\n\nPosition: Java Developer \n\nLocation: San Jose, CA ***Day 1 Onsite***\n\nResponsibilities\n\n\nDesign, develop, and implement software solutions within the Google development environment as part of the HR Engineering team.\nWrite efficient and well-documented code primarily in Java and Angular TypeScript.\nDesign and develop reusable components for various project requirements using Angular Typescript\nDevelop and maintain integrations with various internal Google systems through API development and other integration patterns.\nDesign and interact with the Spanner database to ensure scalable and reliable data storage and retrieval.\nWrite and optimize SQL queries for data manipulation, reporting, and analysis.\nIndependently manage assigned tasks, define timelines, and proactively communicate progress, risks, and dependencies to stakeholders.\nCollaborate effectively in person with Engineering Leads, Product Managers, and other\nTeam members within the HR Engineering organization in our San Jose office to understand requirements and contribute to the overall technical design.\nParticipate in code reviews to ensure code quality and knowledge sharing within the engineering team.\n\n\nQualifications\n\nMinimum Qualifications:\n\n\nEx google experience\nBachelor's degree in Computer Science or a related technical field, or equivalent practical experience. \nProven experience working within the Google development environment. \nStrong proficiency in Java.\nStrong proficiency in Angular TypeScript.\nSolid understanding and experience with Google frameworks, including Angular, Boq, and Borg.\nExperience in integrations development and API development.\nExperience working with the Spanner database.\nGood knowledge of SQL and relational database concepts.\nStrong project management skills and the ability to work autonomously to manage and communicate progress on assigned work.\nMust be able to work onsite in our San Jose, California office.",
    "date": "2025-05-09T14:31:13.581576"
  },
  {
    "job_id": "4225750470",
    "link": "https://www.linkedin.com/jobs/view/4225750470/?eBP=CwEAAAGWvBuWRw39YNiQt3lujeEQyLj6AbYyuIKBkKj65wPETWvdorqWiTjMQT09KpnC8jpLqrh5gOUNU6EPY8zwi-8WzpMfLxxRL3qtmyZF050o-ZgerjywZGbafyviVwuGVZh9f1mvNXDUtQ3PTE_aUNX5lP_8KPkEn3IfTyTv-1UtTpoa4-vWbY2FxjbtgDbtiabMA7BrStP-w54Vxddvpsh7Hz6pdupOk34r2QTkZvGaoNvOtmo_ADbYaXUMDbRd7ETf4M7XR46JHQkPa3QWwoassLQTWmL2f8hlG7tiEo8rmsHqCmsIRJVSt53e8QdUft-yNE7p63WRdZd5mL9n8dLIHFNBUsLYyyV9Voe0ABQFgU-WXTOiUBpgG43XtN9EOHvJFWxFElT3LtHdaHx81C2VIJYCjFX42_jwpuiPlUpeS4zmg7gz6noblqGskV-gsD5RiA5BnAVoSQEWV95dUnR1qi90ItqzKQ9DBnqE7HHaAmeE8qvIbxMOusLqN5u-h05WbOjc&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=eKYIarPH4516FUlD15Dd2A%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Senior Software Engineer",
    "company": "Radiant Dev",
    "company_link": "https://www.linkedin.com/company/radiant-dev/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQHsmarO-k02tQ/company-logo_100_100/company-logo_100_100/0/1650992179167?e=1752105600&v=beta&t=N1cTGqKKrWWNMPLFiUvh4V1d-QNMgntKgn41LX59L_c",
    "place": "United States (Remote)",
    "description": "About the job\n\nSenior Software Engineer (1 Staff Software Engineer opening and 2 Senior Software Engineer openings)\n\n\n\n\nLocation: Remote (Expect 10-15% travel for team collaboration sessions at minimum quarterly, but sometimes monthly)\n\n\n\n\nDepartment: Product Engineering\n\n\n\n\nEmployment Type: Full-Time\n\n\n\n\nReports to: Sr Manager, SW Engineering\n\n\n\n\nTarget Compensation: $121K-$131K with a 7.5% Bonus\n\n\n\n\nAbout the Role\n\nYou’ll be responsible for technical and architectural leadership across Product Engineering teams within the Web Experience domains. You’ll lead implementation of the full stack web experience and be responsible for all development practices with the web and services (integration) platform, while continuing to be hands-on technically and contributing meaningful to initiatives at the code level. You’ll champion code and architectural quality, implementing strategies to safely and reliably make changes to production systems frequently and sustainably. You’ll work closely our with UX/UI department, representing technical vision for our products in greater road mapping and planning exercises. You’ll collaborate collaboratively with designers, product managers, developers, and other leaders throughout the business to deliver compelling and efficient tools/products. You’ll bring a proactive attitude about risk, working to identify and resolve performance and scalability issues with the support of others in Product Engineering. You’ll also be responsible for coaching and training a team of developers partnering with Engineering Managers and Tech leads on annual performance reviews, and using your industry influence and knowledge as part of the panel that will hire new creative talent where needed.\n\n\n\n\nThis role is a full stack position, but we can consider candidates who are stronger on the back end, willing to do some front end work, and/or stronger on the front end and willing to do back end work.\n\n\n\n\nMust be willing to work in paired-programming model. While this is a Staff Engineering role, this position is also a hands-on-the keyboard/individual contributor role.\n\n\n\n\nWhat you will do: \n\nWork with and across Product Teams to develop a sustainable, performant and well-designed suite of products that meet RB Global technical standards\\\nDrive the adoption of designs and assist teams in meeting technical and business goals\nDevelop and publish new technical standards across the organization and drive adoption of those standards\nBuild skillsets within the team through partnership with Engineering Enablement teams and assure team members have the skills and tools necessary to achieve their team mission\nWork closely with Quality Assurance Engineers in coordinating the delivery of features related to web products\n\n\n\n\nExperience: \n\nMinimum of 10 years of enterprise web development experience, 7 years’ experience developing scalable performant solutions and setting engineering and architectural direction across a specific domain of an organization\nStrong understanding of enterprise technology stack\nDemonstrated ability to apply technology solutions to business problems\nStrong experience with Kubernetes and container deployment patterns solutions\nA deep focus on CI/CD and the ability to drive automated pipeline solutions\nAbility to articulate and explain technical solutions to stakeholders\nStrong understanding of enterprise technology stack\nWeb development experience in NextJS/Reach, Java, Springboot, Typescript, Javascript\nExperience working with Kafka, Honeycomb, Datadog, CircleCI, Github, AWS cloud, Kubernetes (any similar experience is acceptable as well)\nExperience in software testing during different development phases\n\n\n\n\nEducation: \n\nCollege diploma or university degree in the field of computer science, information systems, or software engineering or equivalent.",
    "date": "2025-05-07T14:31:14.812428"
  },
  {
    "job_id": "4225335965",
    "link": "https://www.linkedin.com/jobs/view/4225335965/?eBP=CwEAAAGWvBuWR9q0O_lCOdJmoYM2oM3Sf3xHtdbv-xtY7KTbEB_P2zIExyuxbVwziuwmRhDuM0kllNipk6LBoOzGchcn7Aqll1Mdv-KNGQMYFqphqzS7zPThOmkuG6FLer0r9OYcoL3X5D_ZmgsM_zSuhRT2HQwcwfcXrupi3YUk8SFH0-s6v_7hnh5Ukd5FyAM3LroFOggzsCk3SKqB3OMh2TZ84mWojqfikNfl6MXpcbF3ctN96y1L_ULMCAmEkPxhvH5TK-qTYhfFJ77xUQd-7I9IfALU4ivdXrJ8TOrJ8UO-dDd5qb1_I1Npa_xTTZZxFqXbqdEDxves7CyqyqQoqYd3yGLcOuxk8qzuBQLVysf3JLfIJxG5bk4VH-9DRTHNLmADw1XZyayatsSfHkkKNa9tbwxIbJHtVizngbtVAPbTe51fcai7PYt3Ag90IKOiUCPhupNEM0Xv3ZIRVVzNHwv7wBucuc4Ercw&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=VDDHbZQGFKbMbk9xCdFZpg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Developer (React & Java) with verification",
    "company": "Softcrylic",
    "company_link": "https://www.linkedin.com/company/softcrylic/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQE-IM9cTUhsig/company-logo_100_100/company-logo_100_100/0/1714996861432/softcrylic_logo?e=1752105600&v=beta&t=PSwiFThLwc8OYG5jtmQedFB3hhKK6BY2QjxYiz3pbsM",
    "place": "United States (Remote)",
    "description": "About the job\n\nWho We Are\n\nFor more than 20 years, we have been working with organizations large and small to help solve business challenges through technology. We bring a unique combination of engineering and strategy to Make Data Work for organizations.\n\n\n\n\nOur clients range from the travel and leisure industry to publishing, retail and banking. The common thread between our clients is their commitment to making data work as seen through their investment in those efforts.\n\n\n\n\nIn our quest to solve data challenges for our clients, we work with large enterprise, cloud based and marketing technology suites. We have a deep understanding of these solutions so we can help our clients make the most of their investment in an efficient way to have a data driven business.\n\nSoftcrylic joined forces with Hexaware to Make Data Work in bigger ways!\n\n\n\n\nWhy Work at Softcrylic?\n\nSoftcrylic provides an engaging, team-focused, and rewarding work environment where people are excited about the work they do and passionate about delivering creative solutions to our clients.\n\n\n\n\nWe are looking to add a Full Stack Developer (React & Java) to our team! This is a Full-Time position and a Remote role.\n\n\n\n\nKey Responsibilities:\n\nStrong experience in React.js, with hands-on experience in creating and managing functional components.\nSolid understanding of CSS for styling and layout design.\nImplement state management with Redux.\nStrong experience with Java Spring for backend development and API creation.\nKnowledge of Postgres SQL for database design and management.\nFamiliarity with Google Cloud Platform is a plus.\nCollaborate with cross-functional teams to ensure seamless integration of front-end and back-end components.\nWrite clean, efficient, and well-documented code while adhering to best practices.\nDebug and resolve issues across the stack to ensure high-quality application performance.\nStay updated on industry trends and emerging technologies to continuously improve development processes.\nStrong problem-solving skills and attention to detail.\nExcellent communication skills to effectively interact with team members and stakeholders.",
    "date": "2025-05-07T14:31:16.101349"
  },
  {
    "job_id": "4226380944",
    "link": "https://www.linkedin.com/jobs/view/4226380944/?eBP=CwEAAAGWvBuWR1UcjFTvjZpyvIXBj2lMoBH1DVZ9ICtzjUDTjcqbR6sx6Nd2Wsj3x4KCWh2IZ3v4pNMypqH2HXjXqFrsS8CSnpjmLmAx8oc-d4IURoz6A5KkFHZukVEgFQ17uH6fZicubD5CbXFN1yP0uq-gfvj9HT98MIdjFkn4mWyEB42XtfHUpPRFFQRtEXtnWyAop7NBc3aoCYoj2INF8wEQWMeLyzIhfOV7TvaVqiPu0ikLJgqucnLUE6D3iPNLaC2noPHPY-BlgkoVLzTkivt5Wv-g-zO5eSxqyRhP2tOAy21x1G_USm-AlAOF67l60gTPesioHSKr6a9A8xO8l3a1LyrgdQ0eUwg9wJLKFfyVX149uqg_9EQ_QuPkLjMF7qvUcXKq69gMjqtzxp4UQpwPFRcr9ABF50G_bIyD3uHo5hcv8HX3DAN8PRIJYMvQ14B4oH51Ao2nDMgsGDVh3xZGMEI6qk5Xb-VWt62Wd32rG5hssdDiHQhoFKGsgpJNWmFhYVctvyg&refId=NvMV06JqJLy2w71ZNJCBSg%3D%3D&trackingId=YGXapbHXmeEpKTq6XACqvg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full-Stack Developer - Remote",
    "company": "Vaco by Highspring",
    "company_link": "https://www.linkedin.com/company/vaco-by-highspring/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGTeZetJGf5Qw/company-logo_100_100/B4EZXzLx1XHUAQ-/0/1743541706398/vaco_by_highspring_logo?e=1752105600&v=beta&t=Rjs-fVtnBA3xHAQZqLfjLM7U8DUtjVt5G_gSRieZsTY",
    "place": "California, United States (Remote)",
    "description": "About the job\n\nTitle: Full-Stack Developer\n Employment: 6 Month Contract\n Location: 100% Remote\n\nRole Overview\n\nWe are seeking a hands-on, technically skilled Full Stack Developer with proven experience inthe Insurance industry, particularly in underwriting and policy management platforms. The idealcandidate is curious, technocratic, and collaborative-able to thrive in a fast-paced, agile environment. You will work closely with a cross-functional team to build scalable and secure applications that support core insurance business functions.\n\n \n\nKey Responsibilities\n\nDesign, develop, and maintain full-stack solutions using Java, .NET, or Python.\nExperience with cloud platforms like AWS or Azure.\nFamiliarity with low-code/no-code platforms such as Ungork.\nSupport, enhance, and modernize insurance platforms focused on underwriting and policy management.\nCollaborate with BAs, QAs, and Product Owners to gather requirements and deliver business-driven features.\nImplement DevOps practices including CI/CD pipelines, automated testing, and secure delivery.\nBuild and integrate REST APIs, GraphQL services, and messaging via MQ/Kafka.\n\nSkills and qualifications\n\nRequired\n\n4+ years of full-stack development experience (Java, Spring Boot, .NET, or Python).\nDemonstrated experience working in the insurance industry, particularly in underwriting and policy platforms.\nSolid understanding of cloud infrastructure (AWS, Azure).\nExperience using low-code/no-code platforms (e.g., Ungork).\nProficient in containerized and serverless architectures (Docker, Kubernetes, Lambda/Functions).\nStrong background in DevOps, CI/CD pipelines, and automation testing practices.\nExperience with RESTful API development, messaging (MQ/Kafka), and integrations.\nAgile team experience and comfort leading Scrum ceremonies when needed.\n\nDesired Skills and Experience\n\nRequired\n* 4+ years of full-stack development experience (Java, Spring Boot, .NET, or Python).\n* Demonstrated experience working in the insurance industry, particularly in underwriting and policy platforms.\n* Solid understanding of cloud infrastructure (AWS, Azure).\n* Experience using low-code/no-code platforms (e.g., Ungork).\n* Proficient in containerized and serverless architectures (Docker, Kubernetes, Lambda/Functions).\n* Strong background in DevOps, CI/CD pipelines, and automation testing practices.\n* Experience with RESTful API development, messaging (MQ/Kafka), and integrations.\n* Agile team experience and comfort leading Scrum ceremonies when needed.",
    "date": "2025-05-08T14:31:17.450188"
  },
  {
    "job_id": "4224665369",
    "link": "https://www.linkedin.com/jobs/view/4224665369/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=fVswCyQqPgP2uG5NEpYPCA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Cook'd",
    "company_link": "https://www.linkedin.com/company/cookd-dev/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGSAZmrxhlzcA/company-logo_100_100/company-logo_100_100/0/1730915764621/cookd_dev_logo?e=1752105600&v=beta&t=GQVjhLW5R5TQO4zDCHoc9PyAz-_F3YadDXAuQamjn9E",
    "place": "United States (Remote)",
    "description": "About the job\n\nThis Isn't a Role at Cook'd — It's a way to apply to all the companies we're partnered with.\n\n\n\n\nWe are partnered with a bunch of companies that are searching for AI, Full Stack, and Founding Engineers, and we're looking for candidate that can just ship!\n\n\n\n\nWhat You'll Be Doing\n\nWhile each company is different, most roles share a few core themes:\n\nBuilding and scaling backend systems, APIs, and data pipelines\nIntegrate AI models into production\nDesigning and shipping product features with a small, fast-moving team\nContributing across the stack, especially in Python, Node.js/TypeScript, and React\nWriting clean, maintainable code in a modern cloud-native environment (Docker, Kubernetes, AWS/GCP)\n\n\n\n\nYou Should Only Apply If\n\nYou have solid software engineering fundamentals\nYou enjoy being hands-on across the stack\nYou're able to learn new technologies quickly\nYou thrive in a fast-paced startup environment\nYou're excited about the intersection of software and AI \nYou're open to full-time, in-person roles in NYC\n\n\n\n\nYou Should NOT Apply If \n\nYou prefer highly specialized roles with narrowly defined responsibilities\nYou're uncomfortable with the ambiguity and rapid changes of an early-stage startup\n\n\n\n\nWhat We’re Looking For\n\nFor Solid engineering fundamentals and a builder’s mindset\nExperience working with APIs, databases, and distributed systems\nCuriosity and initiative — you like figuring things out\nAbility to ship clean code quickly without constant oversight\nEagerness to learn and grow in a fast-changing AI ecosystem",
    "date": "2025-05-09T14:31:21.778818"
  },
  {
    "job_id": "4223061365",
    "link": "https://www.linkedin.com/jobs/view/4223061365/?eBP=CwEAAAGWvBuaSYUVMJ_Wlcql5wOiYsKyH6App6BWz7ID3Pp6SkytZo0zd-Wtc8LzIAhsvymcXulKesIdVrXIJZ5cKxG8GQu4PtY2tm8RZks5bI3hPq_eLwjUgZ01uBV2JwEDkz7Msqo2Lakve0fqhKAtqXTtbJA-dTkTO9spco4DKbXYs78bkB1CnW5myciTzC8VfwuVD1Ti-S0UY3dQKX8qRbHecDDjcbR4FQn7v8hWb7w8psgE7m4B7xE9b45OFbxJDVFMQhsKmydNQm7WuG_2HElgW1sNe2NqKJj1HvLeGea6-o4Y_WQWLnx91OSpIE2XZXb2Mme2JmGfBTzBmSrT9iFVAYQFZXuQpG6qwONJsXvMGZlInRC-WWZJxusTHxS6WyJ8WDATe9Z2VeFphrhrMn3_O-Ln5hQD4Mvm1dp-ojnIYhqBlpaU0yCfG9RXb4jF5CGGLqevlwNlFGjuwBU4ob5M7FoSt5xfopzakwxg821bxE-or5DWKJBjU2wwKgLwRS3l8vmR&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=1P4%2FPIClC1oNRBLoo%2Ff5Xg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer with verification",
    "company": "Akkodis",
    "company_link": "https://www.linkedin.com/company/akkodis/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQFolAFb8XYDGA/company-logo_100_100/company-logo_100_100/0/1647603243944/akkodis_logo?e=1752105600&v=beta&t=h3yCDxqMxgJ1Ub6TgMl8MlJsWA4wkBv8DMi6jaZHeIs",
    "place": "United States (Remote)",
    "description": "About the job\n\nAkkodis is seeking a ServiceNow Developer our client based in VA. Its a remote and CTH role. \n\n\n\n\nPay Range:\n\nDeveloper: $50-$60/hr on w2 without benefits.\n\nLead: $75-$85/hr on w2 without benefits\n\n\n\n\nMust have:\n\n6+ years of experience implementing ServiceNow solutions. (For developer)\n\n9 + years of experience (for lead)\n\nServiceNow Certified System Administrator\n\n1+ years of scripting experience beyond basic ServiceNow scripts\n\nMust have a DHS Public Trust or Secret Clearance.\n\n\n\n\nEqual Opportunity Employer/Veterans/Disabled\n\nBenefit offerings available for our associates include medical, dental, vision, life insurance, short-term disability, additional voluntary benefits, an EAP program, commuter benefits, and a 401K plan. Our benefit offerings provide employees the flexibility to choose the type of coverage that meets their individual needs. In addition, our associates may be eligible for paid leave including Paid Sick Leave or any other paid leave required by Federal, State, or local law, as well as Holiday pay where applicable. Disclaimer: These benefit offerings do not apply to client-recruited jobs and jobs that are direct hires to a client.\n\nTo read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.akkodis.com/en/privacy-policy\n\nThe Company will consider qualified applicants with arrest and conviction records in accordance with federal, state, and local laws and/or security clearance requirements, including, as applicable:\n\n\n\n\n· The California Fair Chance Act\n\n· Los Angeles City Fair Chance Ordinance\n\n· Los Angeles County Fair Chance Ordinance for Employers\n\n· San Francisco Fair Chance Ordinance",
    "date": "2025-05-07T14:31:23.018757"
  },
  {
    "job_id": "4227784776",
    "link": "https://www.linkedin.com/jobs/view/4227784776/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=paU%2FMd4V%2B0B7%2B5Qt6r8JLQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "DevOps Engineer",
    "company": "Wiraa",
    "company_link": "https://www.linkedin.com/company/wiraa/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQE9LwORhIbvLg/company-logo_100_100/company-logo_100_100/0/1692029735102?e=1752105600&v=beta&t=Np5ZlAb_vfe3B-csdya_FnRMO8cNYIGcaFqD7mPIeOA",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout The Company\n\nRegScale is a cutting-edge Continuous Controls Monitoring (CCM) platform designed to deliver fast and efficient Governance, Risk, and Compliance (GRC) outcomes. We aim to revolutionize the industry by overcoming the inefficiencies of legacy GRC tools. Our innovative approach bridges security, risk, and compliance through comprehensive controls lifecycle management, significantly improving certification times, audit prep, and overall process efficiency.\n\nAbout The Role\n\nWe are looking for a highly skilled and creative Cloud & DevOps Engineer to join our team and play a critical role in scaling our operations. As a key technical expert in our cloud-native software company, you will be responsible for designing, implementing, and maintaining cloud and DevOps solutions. This position offers the opportunity to work on exciting and cutting-edge design challenges within a fast-paced startup environment.\n\nKey Responsibilities\n\n\nAdminister and automate all aspects of our Azure and Office365 cloud tools and workloads, including RegScale SaaS platform, lab environments, and DevOps using Infrastructure as Code.\nManage Azure infrastructure, including monitoring, patching, user management, and securing applications.\nWork with cloud-based systems via command line and SSH access to ensure system integrity.\nDesign and implement solutions for DevOps monitoring, networking, and security programs.\nMaintain DevOps pipelines, adding new features and integrations, troubleshooting, and optimizing performance.\nManage and administer Logging and Monitoring environments, including dashboards and alerts.\nContinuously enhance installation, configuration, and deployment processes for more efficient and repeatable RegScale installs.\nCollaborate with the Cyber Security team to implement required architecture components and policies, ensuring compliance.\nSupport the development team by assisting with changes, upgrades, and enhancements to RegScale’s product runtime and pipelines.\nReview cloud invoices periodically to ensure cost efficiency and make recommendations for optimizing expenses.\nWork with the Data team to build and maintain data analytics architecture.\nAdminister and maintain cloud-based backup, retention, and disaster recovery tools.\nDevelop and troubleshoot Dockerfiles, deploy containers to registries, and assist with container patching.\nContribute to a culture of creativity, innovation, and continuous learning.\n\n\nRequired Skills\n\n\nAdvanced knowledge of DevOps practices: Git-based source control, software tools, builds, artifact storage, CI/CD pipelines, static and dynamic code scanning tools, and deployments.\nExtensive experience with Azure, and proficiency in one or more other major cloud platforms (AWS, Google Cloud, etc.), particularly in IaaS and PaaS offerings.\nProven ability to translate high-level business requirements into actionable project-level scopes and solutions.\nStrong communication skills, both written and verbal, with the ability to collaborate across teams, including customers, engineers, sales, and executives.\nFamiliarity with cloud-native event-driven architectures and creating architectural diagrams.\nExpertise in scripting languages such as Bash, PowerShell, or Python.\nExperience in containerization with Docker and orchestration using Kubernetes, docker-compose, or serverless container workloads.\nProficiency with Infrastructure as Code tools like Terraform, OpenTofu, or Bicep.\nA self-starter mentality, with a passion for continuous learning and personal development.\nExperience in applying security baselines and patches to cloud-based systems.\n\n\nDesired Qualifications\n\n\nMinimum of seven years of experience as a Cloud, DevOps, or Systems Engineer, or a Bachelor's degree with 4+ years of experience.\nDesired certifications: Azure Cloud, Kubernetes, and/or DevOps Engineering and Architecture, including Infrastructure as Code.\nFamiliarity with Scrum and Agile Project Management processes.\nAbility to travel to the R&D office in Knoxville, TN up to 6 times per year (if remote).\n\n\nBenefits & Compensation\n\n\nCompetitive salary with exceptional benefits, including health insurance, retirement plans, and more.\nFlexible remote work with the opportunity to travel periodically to our R&D office.\nAccess to a culture that encourages innovation, growth, and continuous learning.\n\n\nEqual Opportunity Employer\n\nRegScale is committed to diversity and inclusion in the workplace. We are an equal opportunity employer and do not discriminate based on race, color, national origin, gender, sexual orientation, disability, or any other legally protected status.\n\n\n\nDesired Skills and Experience\n\nInformation Technology",
    "date": "2025-05-10T12:31:24.310344"
  },
  {
    "job_id": "4224650931",
    "link": "https://www.linkedin.com/jobs/view/4224650931/?eBP=CwEAAAGWvBuaSTvfd_3g3lv5qqrf-kVVAf2uaq9iai1RWQg0bM2hl_awlLbNET0xkKtLgOpm96rrO7jtfCVvO6NufJm4zqbDDp0SsJFmrrpgAgqu4wtfIwJv41Y0PgBTuldEzPIMmhETb0sdbAeVzcy2purYGBh7Y-Q6tiY5cksBwALiFc3sVChA4UbscQBdz7_5XFpnYBHTnNdZ3IH7uZNGXKgW6QVfVKwOV4XjFoqAPrRO36MJ232F_43NHOglRhJNoZQ5LOQhVYNYEDXM1MvhTi9Xd722BrnkueX8xFm63VGKCHqkQCAzrz8_yOzkXZie1vVuppvMXqTgbG4FUtVjPRbCwOMiCTQmcMgPbS7ASON3drs3aF3LEJ89-CLWRzunAMuHLZBaa1FsUVyJ9ymmhNvA7HQAbz4KC0hOMXiz6ozPpHmGjpS61C7Z0tcrczSbJBPZ_Nyz4bKl08uyvvtZblylFSDJ7tYLAYKTSDJ7z3xm_Fw5QSOaICLxpOiDfcicMRh_oA5SCDnKSQ&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=ZCqQgKJ1K7oBGHIiBMtdEw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Engineer with verification",
    "company": "EXL",
    "company_link": "https://www.linkedin.com/company/exl-service/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQHZga8kSwpMTQ/company-logo_100_100/company-logo_100_100/0/1719841183720/exl_service_logo?e=1752105600&v=beta&t=5rgmgsvftd0djWDrtLGm1SkaFw-oNWWceHmwXelJb1w",
    "place": "United States (Remote)",
    "description": "About the job\n\nHi,\n\n\n\n\nWe have urgent requirements for our direct client, please go through the below Job Description. If you are interested please send me your updated word format resume to Sudi.reddy@exlservice.com and reach me @ 520-231-4672.\n\n\n\n\nJob Title: Java Full Stack Developer\n\nLocation: Remote \n\nDuration : Full Time\n\n\n\n\nJob Description\n\nSenior, hands-on technical developer focused on building out the firm’s strategic data platforms. The successful applicant will take ownership of key projects and components and will be responsible for all phases of the SDLC including analysis and design, development, testing and deployment. As a senior member of the team, the candidate will be responsible for providing technical guidance to junior developers, including overseeing their deliverables, providing architectural guidance, enforcing best practices, and conducting code reviews. A potential candidate will need to understand system and enterprise architecture concepts and will be expected to understand how all components fit together and affect one another. They will work with a global and diverse team of peers as well as liaise closely with Business Analyst, Production Support, and Infrastructure teams. \n\n\n\n\nKey Responsibilities\n\nDevelop and Deliver assigned development projects within agreed schedule, quality and scope expectations.\n\nParticipate in all stages of the SDLC within an agile Scrum environment.\n\nInteract with senior management to define and drive architectural direction.\n\nInteract with PMO and translate reported problems/issues into JIRA items to implement.\n\nEnhance/Re-architect existing components to satisfy new performance and scalability requirements. \n\nProvide level 3 (escalation) support for the application.\n\nEnsure all components in the platform are fully compliant with tech standards.\n\nAnalyze database implementation methods to make sure they are in line with company policies and any external regulations that may apply.\n\nDevelop database design and architecture documentation for the management and executive teams.\n\n\n\n\nRequirements\n\nBachelor's degree with a minimum of 8 years of IT experience, OR in lieu of Degree, a High School Diploma/GED and 5 years of experience as Java full stack developer.\n\nSolid understanding of application infrastructures, including hardware, storage, network, databases, disaster recovery. \n\nStrong grasp of algorithms and data structures and how to best apply them to build optimal software solutions.\n\nUnderstanding of Metadata, its applications and management\n\nLogical thinking, Strong analytical and problem-solving skills; innovative and solutions oriented.\n\nEffective time management skills to manage multiple priorities with flexibility on time zones and timelines.\n\nExcellent verbal and written communication skills with ability to prepare and deliver effective presentation.\n\nProven experience building scalable, mission critical systems.\n\n\n\n\nTechnical Skills Required:\n\nJava full stack technologies\n\nAngular or other web-based UI frameworks\n\nRDBMS, SQL, PL/SQL, Oracle DB\n\nXML/XSD/XSLT and JSON\n\nModern source control, build and continuous integration solutions.\n\nUNIX/Linux Shell scripting\n\nSpring/Tomcat application server\n\nExperience using – JIRA, uDeploy, Sonarqube, TeamCity, Artifactory, BitBucket, Groovy, Maven/Gradle.",
    "date": "2025-05-09T14:31:25.527190"
  },
  {
    "job_id": "4225700603",
    "link": "https://www.linkedin.com/jobs/view/4225700603/?eBP=CwEAAAGWvBuaSWgkkKX0fB8uNjeDYaknTbLVMxdTu_oTnd5sCUDTD67gVl8b77Qnwibfg2U6C9jPwPvgxY9ftd9WZ6Nlpi41d6vdL_CrZk4SINBNMth0kvTJmXgpomln5mI83cR3sdJqMZEsgJQDqeCiNZBP9mDLZYVOrc9_aBFtG5-JVjJCypnllO655tfm6Vrw4yxbpulc6hOY1mjpoxOG6Pi6n0EXdS6TXtXTVM9Nl5xRx6BxO647OL0yKZBTjkHPfxYy6U9Djr8XRvlwk9gY83SgL2MmORgMrGvrvH8twUF3EfN5I9fS9GyuwrkT2Az_OfkxrQ03pwPvUmkbgOpNd6ou4gKSrL3kr8QPuUr3aWuKUskM_fbkxcTteYGI5uvg561RSjzWrI6P2396lhTDWXhh_7Tr0eFRhp9KZrN7CHq37LFNZbzDE-kait2CLFD0yS0eTjkVGq4eKeonaP0xg0ofmK2MtuAQE2c5iJ_ue6b_a4DPOj1IpfII7uKKyDODymYt_arlB4s&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=afj7DDGAbxtSBMfG%2FSp7iQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Developer (Java) with verification",
    "company": "Seneca Resources",
    "company_link": "https://www.linkedin.com/company/seneca-resources-inc-/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQGKU-Ttpj3vyw/company-logo_100_100/company-logo_100_100/0/1697140449976/seneca_resources_inc_logo?e=1752105600&v=beta&t=_dzGsQMBsvZXhhJRyvesTOvgYLUdvphU9ZWaGLRMqkc",
    "place": "United States (Remote)",
    "description": "About the job\n\n*MUST BE BILINGUAL IN SPANISH*\n\n\n\n\nPosition Title: Full Stack Developer (Java)\n\nLocation: Remote\n\nPosition Status: Contract to Hire\n\n\n\n\nPosition Description:\n\nOur client is looking for Full Stack Developer (Java) candidates for a position located in Birmingham, AL. Client is seeking someone with strong front end development skills, that is also proficient with Java.\n\n\n\n\nSkills:\n\nMust have front end development experience; react and\nReactjs\nAngular\nSome Java development experience\n5 -10 years of experience\nJavaScript, CSS, HTML and front end languages\nExperience with user interface design\nExcellent troubleshooting experience\nGood project management experience\n\n\n\n\nAbout Seneca Resources:\n\nSeneca Resources is a client driven provider of strategic Information Technology consulting services and Workforce Solutions to government and industry. Seneca Resources is a leading IT services provider with offices in Virginia, Alabama, Georgia, New York and North Carolina that service clients throughout the United States.\n\n\n\n\nWe are an Equal Opportunity Employer and value the benefits of diversity in our workplace.",
    "date": "2025-05-07T14:31:26.796947"
  },
  {
    "job_id": "4227175641",
    "link": "https://www.linkedin.com/jobs/view/4227175641/?eBP=CwEAAAGWvBuaSQoAEM8aUFS2p8hAyfb4MaffnTcw91p55M7ntopQBWw94of9RnlCsmvBcEVF8zyIGHneaMTAEHuBixZQ-kwI5kyOZDKmTT6EaahO6CbXBrkfPd7d6U4AlWRnRhSO08Jw6LBDrkawSDBNLaAG8Qjx9xx6QbaJJJA5Gz1jz42wGGqe1el8yrcmYGAksUW3YnBW4OvWSDh-gHhj6wMaFiEWGG8FHaYjzryFg-7b4BzEadt4dw8TvCazhOongmeCG3dhscwb-Mk4VQpCngTxcL111jBAvok2Waqv14mn7OWXnUP7cXhyMAdUGvMtsH6IssrcIfyVRgeh03hfiZKSLqYrrUcCi25HWmc4A5yGPaOYvM6tUIgQ9glRJR822kgqG1CTSkJTb71OhTEK0hXC7o1RGsANUvXsRTSxYiDhoU-VVUPPwblyf_5xnb8Q82r3w--prqTDO7-WkaVzUbxQF1jexTWnDbcFCe-yk1qVwKCmiY0U9vqtRyDN0oqkpk_VMvGrJOtGMg&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=wftyRlRLRs9N5%2BF26H5%2FoQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Java Developer with verification",
    "company": "Quantum World Technologies Inc.",
    "company_link": "https://www.linkedin.com/company/quantumworldtech/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQHwwzFMFfVMZg/company-logo_100_100/company-logo_100_100/0/1660656514003/quantumworldtech_logo?e=1752105600&v=beta&t=4HyYl0wp8vo4NKRCkhU0FPoIVj7aOWly57XZUb0GrGs",
    "place": "United States (Remote)",
    "description": "About the job\n\nResponsibility\n\nProvide support to capability owners for following availability.\nCurating golden repositories,\nDefining prompts,\nPerforming validations in pre-prod and prod environments.\nRelease support \nDeployment\nFunctional testing (Automation of functional testing)\nPerformance testing (Automation of Performance testing)\nRegular support to codegen platform\nAutomate regular support through intuit assist\nCodgen platform API creation support for BU usecase.",
    "date": "2025-05-09T15:31:28.014473"
  },
  {
    "job_id": "4225018802",
    "link": "https://www.linkedin.com/jobs/view/4225018802/?eBP=CwEAAAGWvBuaSf3W59g6n656v3RqrMvZP-hChF3tkL_JVH9nCuj_73qSnfgjoLWUdduCF3e8xsSQvuW0d5w2HCEeOsfwbENgAEVm5kd0Y0e3u52HvanUWGPePYjRE2cf1-f1tooQlzv8jNV4C3JPqMZEmCha4QAXYE2QwBBdegkesL6BreIsotK1wsA-NXg7QOZfFp14XzwkfY6wwFFJl_PS_UZCEZdlxoAHz_DVxtEzS7SAo7v8572OWHrq9cM-lTqOPP4AqYIoRAr69yD-Jzi7sh6ggOpMV1ntrW6LcypEHlk3l6tI82tOsw-NEybbIbP7ntSGjlLzLS1dn2vNz26Ym9t_ce7FrK4UHwU7rG10OXSohlI_ekyFfFGxYuY8D3EkBm2vkDrnGqhdPZd2YlFlc5l5fkWUNYyGnRfKeFCuWu9kFoVWZvfCUDSLEnAxkgnuQ3XI2vaUFy6QdCodFr9mm5tIHXHdcI9PdloXELP1Fxf_O04_bIwJvmG2TZEy1d_IJBVCnNKkzpI8BA&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=7Y5OWP4daWPT4yU2xEpMaw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Gyga Force",
    "company_link": "https://www.linkedin.com/company/gyga-force/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQF2CIdDiBaxUQ/company-logo_100_100/company-logo_100_100/0/1630598915775/gyga_tech_logo?e=1752105600&v=beta&t=KheOGYfxJim6LKCYw6HBYtAFDjSQyk-owZxItqKyKyU",
    "place": "United States (Remote)",
    "description": "About the job\n\nOur client is a rapidly growing e-commerce company based in Santa Clara, CA, looking to bring on a TypeScript Developer to help expand and maintain their customer-facing platform and internal tooling. This is a highly collaborative team environment, ideal for engineers who enjoy building clean, scalable code and want to make an immediate impact. The position is based in Santa Clara, CA but can be fully remote for qualified candidates in the U.S. \n\n\n\n\nResponsibilities:\n\n\n\n\nDevelop and maintain modern web applications using TypeScript\nCollaborate with UI/UX designers and backend engineers to deliver new features\nOptimize application performance and improve code maintainability\nWrite unit and integration tests for critical components\nParticipate in code reviews and contribute to team standards\nTroubleshoot and debug issues in production and staging environments\n\n\n\n\nQualifications:\n\n\n\n\n3+ years of experience in web development\nStrong proficiency in TypeScript\nSolid understanding of JavaScript (ES6+) fundamentals\nExperience with modern frameworks such as React, Angular, or Vue\nFamiliarity with RESTful APIs and asynchronous programming\nVersion control experience using Git\n\n\n\n\nBonus Qualifications:\n\n\n\n\nExperience working in an e-commerce or consumer-facing product environment\nFamiliarity with Node.js and backend services\nExposure to CI/CD pipelines and agile development practices\nExperience with testing libraries such as Jest or Cypress\n\n\n\n\nIncentives and Benefits:\n\n\n\n\nFully and Permanently Remote (Within the U.S.)\nUp to $165K Base Salary\nAnnual Bonus\nMedical, Dental, Vision, Life Insurance\n401(k) with Matching Company Component\n3 Weeks PTO\nPaid Maternity/Paternity Leave\n\n\n\n\nVisit the Gyga Force website for a full list of opportunities.\n\n\n\n\nWe kindly ask that you refrain from reaching out to us or any of our employees directly. We will get in touch with you if your background aligns with the qualifications for the position. For a full list of available openings, please visit our website.",
    "date": "2025-05-09T14:31:29.294100"
  },
  {
    "job_id": "4219734021",
    "link": "https://www.linkedin.com/jobs/view/4219734021/?eBP=CwEAAAGWvBuaSdNfxXjkvsfovJAAB1BT_eM4TRAVC-2Z2wqOmhL9jmHX7OSoZGwZ7jfxudmGty9WfuMbLN7P68giVpTbbhMIxVSTjQtWow_icMj_Ew1B51cVGrzi0QoDuvSQNw_oxe8CYqhZ58XMAoCW3sSzU-YODG3RYpX91BDmoZGCR0F-JfTruIwK-5xxTvS8SlOyIThZCPPlnbnQBKAbpNrY_3rmQq5p9uPH-Tkm0SbqYgNEnXNXlQQMIdzwMr2rAgvluycicKq-rk6RRFVFizzbe8JZ6nLIk_uXgkpmQU7aky3pzVcjosprQCpMOYB9OEX-InE7p7HCb2Uxr5ZqmTEXar8roYMKAToDimOQm054eUeWAo6jR0D-XTETMPXgoNrRjDvCtaYqKxj-IheothXCM9vLGrp30nWAKRgK89PbJ7Vrs88YXwqxHkiEjxf8C4IyB5dFs919Br6QtlXH5hvpthWN8JjMM4QHbNAVk6NreNCm-EOtDdSH7-lcmyMqNZONK1rQ&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=ns2ITMEfHOe%2FXF1ZoYeRpA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Frontend Developer",
    "company": "Sigmaways Inc",
    "company_link": "https://www.linkedin.com/company/sigmaways/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQHzmaXwD-nMAQ/company-logo_100_100/company-logo_100_100/0/1677268399034/sigmaways_logo?e=1752105600&v=beta&t=PGs440US5yK41fcHeQa2EPrDzEKLMNlY03yoPbRF9wI",
    "place": "San Francisco, CA (On-site)",
    "description": "About the job\n\nWe are looking for an experienced Angular Developer for designing and developing web applications and delivering robust solutions with our team of designers and developers.\n\n\n\n\nResponsibilities:\n\n\n\n\nDevelop dynamic, responsive and reusable web UI components using Angular (v15+ preferred).\nIntegrate with RESTful APIs and AWS managed Endpoints.\nSecurely manage authentication and authorization using OAuth2/JWT.\nHandle file uploads/downloads to from Amazon S3, including signed URL’s and access control.\nIntegrate with API Gateway + Lambda services to call backend functions.\nParticipate in CI/CD pipeline integration using terraforms or similar.\nCollaborate with backend and DevOps teams to design secure, performant cloud native applications.\n\n\n\n\nQualifications:\n\n\n\n\nBachelor’s degree in computer science, information systems or equivalent work experience\n\nFrontend/Angular\n\nAngular UI developer with AWS integration experience.\nStrong experience with Angular (15+) and Typescript.\nFamiliarity with RxJS, Angular Materials and component driven architecture.\nProficient in REST API Integration and state management.\nExperience in upgrading Angular versions.\n\n\n\n\nAWS services\n\nHands on experience with the following :\nAmazon S3\nAPI Gateway\nAWS Lambda\nIAM roles and policies\nFamiliarity with CloudWatch, and route 53 is plus\n\n\n\n\nDevOps/Tooling\n\nExperience using GitHub/GitLab.\nUnderstanding of CI/CD processes.",
    "date": "2025-05-03T14:31:30.536978"
  },
  {
    "job_id": "4224762839",
    "link": "https://www.linkedin.com/jobs/view/4224762839/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=EgqJ1RggL1lmQo1sYMtuOQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Front end Developer with verification",
    "company": "Premier Talent Partners",
    "company_link": "https://www.linkedin.com/company/premier-talent-partners/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQF_GUGxqE0Ifg/company-logo_100_100/company-logo_100_100/0/1716316653863/premier_talent_partners_logo?e=1752105600&v=beta&t=ZKDSITh4LWPyZosdx9pw7Q21C1_VsvQ551ITvc2PJ8E",
    "place": "San Francisco, CA (Remote)",
    "description": "About the job\n\nResponsibilities\n\n\nGather and evaluate user feedback\n\n\nQualifications\n\n\nKnowledge of coding languages (e.g. C++, Java, JavaScript) and frameworks/systems (e.g. AngularJS, Git)\n\n\nJob Highlights\n\n\n100% Remote and an 8-month contract \nTechnical Stack: React, JavaScript/Typescript/Python\nStrong experience in FastAPI integrations to HCM \nStrong communication skills and the ability to work with cross-functional teams\nStrong communication skills and the ability to work with cross-functional teams\nExperience working in agile environments and contributing to cross-functional sprint rituals\nPython/Postgres w/ FastAPI\nDropbox OAuth and Workday API\nOpenAI API and Llama Index\nAWS Elastic Beanstalk and RDS for PostgreSQL\nReact/TypeScript\nExperience with ChatGPT API a plus\nPast contributions to performance feedback, people enablement, or comms tooling is a plus\nExposure to Workday APIs, internal HRIS data models, or enterprise workflow tools (e.g., ServiceNow, Asana, Greenhouse)\n\n\nCompensation\n\n\n$48.97 - $67.59 /hour Pay Rate\n\n\nTo be considered for our current job openings, we kindly ask that you complete your registration by clicking the “apply” button.\n\nAt Premier Talent Partners, we are a people-centered recruitment firm with a strong focus on Skills-Based hiring. We specialize in placing individuals in roles ranging from entry-level to VP level across various fields, including Customer Success, Sales & Marketing, Finance & Accounting, Administrative, HR, Operations, and Technology. Our expertise spans contract/temporary, temporary-to-permanent, permanent, and payrolling services, and we are dedicated to promoting equitable hiring practices on a national scale.\n\n\nPlease note that compensation for the specific role will be determined based on your unique skills and experience. If you have an interest in exploring other positions similar to this one, please be aware that compensation rates and benefits packages may vary accordingly.\nWe do consider applications from qualified candidates with prior arrests and conviction records, in accordance with applicable regulations.\nIt is imperative that you have the legal authorization to work in the United States, as we do not provide sponsorship.\n\n",
    "date": "2025-05-09T18:31:31.901010"
  },
  {
    "job_id": "4219885173",
    "link": "https://www.linkedin.com/jobs/view/4219885173/?eBP=CwEAAAGWvBuaSVGgpxkAmH4OE8qSak0UpnJPMix3DymO08H9tOT0Rm6oAVETJmvSZaTJ8831Wu5-z35kSX_JdCaNRLvy15Hb_V2723KqK55SbxLiecvPnWXIRyBJh_BUSMhp-3XO6zgIG0c-bxT76tjgivqwT9x1veD79d6i7nPCJAZj4y-r0suKaqmrrLLmeT-hSodm4ouwA2IpeFa028PXIjJBxVCZmcEFj0XpkP6vK5FYB4K5m-7xLeMkbApUc_NsrarfpZRfUdGrPz_8VUxXnoJ0HHgIug8NvMf99jzWgQ6gkK_4trMGlF8YTDU5UptCX5-lcpY1FME12uAcH7d4O5IaUJXA6Vm8Zu3J641kvLW_KYgSzZdJfi0wCriqimpNrpbHALRDtSOPPAE6v_mVIN494LVr4R-dapaGqoTQvNNChqAUFwmcnjIEkl7dlSzBqZAo9IXqCShPzcoIXbTt6guKah5FWS4gXoxi-4y48U86GyNXGhWOh-bBs3oCzrBbDQIjPfBkzx0xYA&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=hMu8Epf77um%2F6Ft5FiRJbQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Staff Software Engineer",
    "company": "Shoplift",
    "company_link": "https://www.linkedin.com/company/shoplift/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGDn7eHCu_2zA/company-logo_100_100/company-logo_100_100/0/1718739663719/shoplift_logo?e=1752105600&v=beta&t=-iwNnyLVqIQqbRAWG0GpPWvbcQKRYUPIY8OCPIffmwA",
    "place": "United States (Remote)",
    "description": "About the job\n\nWho We Are:\n\nShoplift, a NYC-based SaaS startup, empowers thousands of e-commerce merchants like Kith, Liquid Death, Olukai, and more, to acquire customers more efficiently and profitably by optimizing their online storefronts with our intelligent, automated experimentation and personalization platform.\n\n\n\n\nYour Role:\n\nIn this role, you'll play an integral role in architecting and building new systems and features across every part of the application. We're looking for someone who is an engineer in every sense of the word; someone who loves to code, who is deeply knowledgeable about systems architecture, fundamental computing principles, and excels at building products from the ground up.\n\n\n\n\nAbout the role:\n\nAs our user base continues to rapidly grow, you'll be part \"city planner\" and part firefighter, developing a deep understanding of wide swathes of the product's most crucial components and designing new ways to make them scalable and sustainable\nYou'll take things from whiteboard to reality, contemplating and architecting large features with complex requirements\nYou will work cross-functionally with product managers, designers, and data scientists to deliver powerful and accessible features\n\n\n\n\nAbout you\n\nYou love solving big, hairy problems and obsess over them until you find a solution\nYou have experience with large, real-time data firehoses\nYou can bust out a ton of code, but can also have business-level strategy conversations\nYou love startups and are excited about being part of a fast-growing company\nYou're a top performer and like to work with other top performers\nYou're a quick learner. You can take a look at something you've never seen before and make sense of it quickly.\nYou care about the “why” and want to understand the bigger picture of how the business is helping customers\nYou’re thoughtful and resourceful. For you, problem-solving starts with a clear understanding of the context and an open mind to a wide array of potential solutions.\nYou’re not above getting your hands dirty. Whatever it takes to get the job done\nYou pride yourself on attention to detail\n\n\n\n\nRequirements\n\n6+ years of hands-on experience owning entire products or features\nExtensive experience managing database architecture and DB engines\nExtensive experience with Java or C#\nTypescript, JS\nExperience with ORMs (we use Entity Framework Core)\nExperience with asynchronous programming patterns\nExperience with Agile development practices, continuous integration and refactoring\nUnderstanding of microservices architecture and its deployment patterns in cloud environments.\n\n\n\n\nStrongly Preferred\n\nExperience with .NET 5+ runtime\nLocated in NYC-area and comfortable with hybrid work environment (we're flexible)\nExperience with the Shopify ecosystem and/or Liquid\n\n\n\n\nNice to have\n\nExperience with advanced statistics\nExperience training ML models\nExperience with ETL pipelines\nEducation: A bachelor's or master's degree in computer science, software engineering, or a related field\n\n\n\n\nWhat we offer\n\nCompetitive compensation that includes equity options\nFlexible remote work policy\nDaily Seamless lunch stipend (when in-office)\nFree food: bagels every Tuesday, pizza every Thursday, and a wide array of snacks\nGenerous time off policy, including paid parental leave\nCompetitive medical, dental, and vision coverage for you and your dependents\nCommuter benefits",
    "date": "2025-05-03T14:31:33.217860"
  },
  {
    "job_id": "4219894251",
    "link": "https://www.linkedin.com/jobs/view/4219894251/?eBP=CwEAAAGWvBuaSYQBSGBmVqiqEEXEFWGWig7z3zbjTYnhCYo0GJ5W2cpOT2h4-hjtBOLTFrQwL-ILKoLQ4ydLPi1MCdrDYpgQdtpbGwbqn049xX5CKULFpzhpL8qJQreGPtMxd1rn3_C5G_6xg4E389155DYxf1Qaww6YAQWpBOV0SGcq5Ki976UrhYP5L8LYwMQvzna8Dtf5mpREgbJlTl3hx_5xf-rJACkDJ0jpr5DMS-alsCHvp6ZAuX_yjDyAgYk66FlxGpUJnVw0RIaFYLMSn27S84MQOh3JCe6sii54Ng8Cvn2QpYxOWnCQeoXCEE2yGqOQzAer_NLblStV292BG6UB_u4nF6tdeR6M4KfrMtv4D43RVWI9Nrk4WdLcBVaRGCo6hy5WgYPCtabx1URMGZUcFZWp62F5_BLDSCsBgEMEiTeP0qfHepaUKAaRO96QLF1R0VVCXop2rhpfWRtye9ZtBRAN_b7j0mrkILpprIqPG73oH12VvfFHpb5cDxn7YO0qdr0t&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=NwEiC2PEeGS%2BdcfSmqsmGg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer Intern with verification",
    "company": "BRELYON",
    "company_link": "https://www.linkedin.com/company/brelyon/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQGFUsrgmb_m2Q/company-logo_100_100/company-logo_100_100/0/1630586937749/brelyon_logo?e=1752105600&v=beta&t=cYx3vob6Ak-eIBo9puFub1UBMXHUOEp7vgusttcEp7w",
    "place": "San Mateo County, CA (On-site)",
    "description": "About the job\n\nCompany Mission\n\nBRELYON is an early-stage startup (https://www.crunchbase.com/organization/brelyon) introducing virtual displays and generative rendering architectures to transform high bandwidth applications like gaming and trading. (See video: https://www.youtube.com/watch?v=UkP4JF5X6Fc)\n\nOur technology uses novel physics along with computational display techniques to create depth and panorama, creating an IMAX-like experience in a 32” monitor formfactor. We are enhancing the human-computer experience with a product design that jointly considers light and the visual experience of displays. We are currently growing our production capacity and have our products in the field worldwide.\n\nThe ideal candidate will collaborate with our software engineering and ML research team to optimize our current computer vision and ML pipelines. It involves conducting experiments on our display hardware and enhancing the viewing experience of 2D video and gaming content using developed ML/CV methods.\n\nRESPONSIBILITIES\n\nCollaborate with software engineers to refine existing software projects and make them ready for delivery.\nPerform code optimizations for existing software applications. Including profiling and benchmarking to identify performance bottlenecks. Finally, ensure code remains clean and maintainable by refactoring for simplicity and using asynchronous programming where appropriate.\nAutomate the deployment of ML applications including ones running in the cloud.\nTrain, evaluate and finetune ML models for segmentation and depth estimation. Generate video results using these improved models and test output on Brelyon’s multifocal displays.\nEnhance and optimize current video processing algorithms using parallel programming techniques.\n\nQUALIFICATIONS\n\nCurrently pursuing MS or PhD in Computer Science or comparable experience.\nProficiency in modern C++ and Python.\nExperience with performance analysis.\nExperience with video processing and machine learning-based methods.\nHands-on experience with CI/CD tools such as Github Actions or Jenkins.\nExperience with cloud environments such as AWS and Azure\nFamiliarity with containerization and orchestration (e.g., Docker, Kubernetes).\nFast learner with strong problem-solving and communication skills.\nSelf-motivated, organized, flexible, and able to balance and prioritize multiple diverse projects.\nTeam player mindset with effective collaboration skills with cross-functional partners.\n\n\n\n\nPREFERRED EXPERIENCE AND SKILLS\n\nKnowledge of CPU and GPU architectures.\nExperience with OpenCV, PyTorch, TensorFlow, or TensorFlow 3D.\nExperience with video segmentation and depth estimation methods.\nExperience applying and extending advanced computer vision algorithms.\nKnowledge of 3D math and linear algebra\nExperience with QT framework.\n\n\n\n\nBRELYON is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state, or local law.",
    "date": "2025-05-03T14:31:34.494539"
  },
  {
    "job_id": "4227149856",
    "link": "https://www.linkedin.com/jobs/view/4227149856/?eBP=CwEAAAGWvBuaSo-s7cU-KCFjKRClS-2CRNuCccj_C2rT7lox-51HTHsUH3ECuv9bULYn7sCPdTV94AaeiyoWY7xzCdM-Evt32W5kHZWwwGtRL77IqCl1i57rkTDRHs0M9oP0mYwGgYODCYi30pb4I0oXqIrAmzAU-e9GvgBd26JYYYpnu37ZLzDBRerfUZB752ZABSV6UDAOmi27CXqTKJ842DMYVVHfrzRnoR90s4ybZNQ-F07PyqJlmhXhIeEJEpWqnF-LwUvPmtH6gCMHPgCRoCLKe8JCaFvynSnSD5fiyRrJFPb6-R54LMgRci8SOpVrTUnOHPoWPS7E9hsN3VG5JflYyMbCl1BTpjYPKdtuoo1IdvCwH-GGSeqs_iejWv_ZVYnWmxuXTODoFzOBRF5da_6k4UfZitrYGZya78MUpta4AVQiPRJiIbg-AMBzSYmQQnu9GhfVk2vi7JUGvwMRBEI6m4HMV8sCpob9AgG4ZLBZALCsDobngzdo0FcWc8ec8AHPjA&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=5qXP%2BkmJiOtGCVycn42d7Q%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Lead Software Engineer",
    "company": "Thrizer",
    "company_link": "https://www.linkedin.com/company/thrizer/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQH5ftnlujeRNg/company-logo_100_100/company-logo_100_100/0/1689206294504?e=1752105600&v=beta&t=NnRb9tzYR95UoTowMHD1VJkEQrd5EswNacyinshBF4k",
    "place": "United States (Remote)",
    "description": "About the job\n\nLead Engineer (Fullstack + Infrastructure)\n\n\n\n\n\n\n\nAbout Us\n\nWe are a small, passionate team dedicated to making a difference in the world of health and wellness. In a system where health insurance determines care accessibility, we are building a solution that supports providers in earning their worth without compromising their client’s ability to afford care. Learn more about our mission at https://www.thrizer.com/about-us.\n\n\n\n\nThrizer operates at the intersection of fintech and healthcare. Our web application serves as a payment processor for our providers and a medical biller for our patients. The goal is to bring speed and transparency to the flow funds between patient, provider, and insurance so that everyone gets paid fast and reliably.\n\n\n\n\nWe are now rebuilding and re-architecting the platform to simplify the codebase, improve performance, and prepare for scale. To lead this next phase, we’re hiring a Lead Engineer who will take full technical ownership of our product. You’ll work directly with the founder to modernize the backend, refactor infrastructure, and set the foundation for an engineering team.\n\n\n\n\nUS Remote with travel\n\n\n\n\nThe Role\n\nYou’ll be the principal engineer responsible for:\n\nOwning backend development (Node.js + Typescript) and API design\nOverseeing and optimizing infrastructure and deployment (cloud services, containerization, etc)\nHandling frontend work as needed (AngularJS and future frontend improvements)\nLeading our transition to an API-first architecture\nWorking closely with the CEO on technical decision-making — you’ll have autonomy, but we’ll collaborate closely\nBringing an AI-first mindset to development, using AI tools to enhance development and explore AI integrations where appropriate\nLaying the groundwork to build out an engineering function at the company\n\n\n\n\n \n\nKey Responsibilities\n\nRedesign and refactor backend systems and architecture for clarity, scalability, and performance\nEvaluate and optimize our current cloud infrastructure\nMaintain and extend the frontend as needed while planning for future frontend evolution\nParticipate in code reviews, providing constructive feedback to maintain and improve code quality\nWork with the CEO to balance speed, quality, and strategic trade-offs\nEnsure test coverage and reliability without unnecessary process overhead\nApply AI tooling to improve workflows and product features where practical\n\n\n\n\n \n\nMust-Have Qualifications\n\n8+ years of Backend Expertise: Typescript/Node.js fluency, production API design, schema design\nInfrastructure fluency: Hands-on experience with containerization (Docker) and cloud deployment (Azure preferred, but any major cloud acceptable)\nStartup experience: Served as lead or early engineer at an early-stage startup; comfort working in messy, real-world codebases\nFrontend familiarity: Willing and able to handle frontend tasks\nCollaborative ownership mindset: Able to work independently but eager to collaborate on major decisions\nDomain Passion: Excited about the health, wellness, and fintech spaces\nSelf-Directed and Growth-Oriented: Curious, fast-moving, and able to operate with minimal oversight; communicates clearly and works effectively within a distributed team\n\n\n\n\n \n\nNice-to-Have Qualifications\n\nExperience with MongoDB or other NoSQL databases\nAngularJS experience\nAI feature development or AI-assisted development workflows\nAzure and Kubernetes experience\nStrong testing and documentation discipline\nExperience in scaling product or engineering teams from 0-10\n\n\n\n\n \n\nWhy Join Us?\n\nImpact: Shape the technical foundation of a growing product at a mission-driven company\nOwnership: Lead development, architecture, and infrastructure from Day 1\nGrowth: Help build the team and evolve into a long-term leadership role\nCompensation: You will be paid well and paid now. We don’t do equity gambles.\n\n\n\n\n\n\n\nReady to Own It?\n\nIf you’re ready to take technical ownership and help rebuild a smarter, scalable platform, apply here. Please be sure to include a link to your GitHub and personal website (if you have one) with your application. We want to see the projects you’ve worked on more than just your resume.",
    "date": "2025-05-09T14:31:35.780319"
  },
  {
    "job_id": "4223039949",
    "link": "https://www.linkedin.com/jobs/view/4223039949/?eBP=CwEAAAGWvBuaSqEkQiGy9Z6Tl3EFqNvy4E-Vn4x3sVj4btjhzLfJg0BTzOnZ_d2LRn7JnaMtPozGkBsqmu7ktRPily63I_i1s1T3Rb_0YqP7_ThvDlHgZMfLeWM64YfT92aVmBvf7lSatqHWsjwebUJTy57WaQdOQvdZSNfDV97qXOYaJTZPVtxgTttmM-mH_gnLBojqdV77FC7ng6AgOHuMekg4N0Z53nVADh3tFR7BKJ-9SjyAHNCmdsavyJddXu62B5ocTJ3JsRkMUxWTM-ivC_Ez7Ym7k-BIz9eyow4IbaH1-KR8ctq4wjT6rvnv-prSur_rPGfoHb5OBlamwOhv5258d9jvl1uZYmddqa4kq1onltLTeQcVbYQ7E-TbupnrKOiUaHTuwZDvxD4d1E3nB4ejcn8fPgJsmKX_TmKDQxCFu4UJpjJFNQ03R6vE5zNzMSVC9N30_FTrZCaTjLICZqAYWc96tJXZmoA5JTROMHAd_8aQQoFkOjQAkLG0LaoV9DT8BNBHXVk&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=1%2FKHAio2qhnDxUS5rw%2FA0A%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Senior Software Engineer",
    "company": "BlockTal",
    "company_link": "https://www.linkedin.com/company/block-tal/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQH-SVBEmbDaHg/company-logo_100_100/company-logo_100_100/0/1636148233884/block_tal_logo?e=1752105600&v=beta&t=eKAB12o4aE9Qi7_gY0AZUhokPLag1NzUHCFKldF7l7g",
    "place": "United States (Remote)",
    "description": "About the job\n\nIntroduction:\n\n\n\n\nBlockTal is partnered with one of the most innovative financial infrastructure companies in the world. Currently valued in the billions, they are combining the stability of traditional finance with the innovation of blockchain technology. This Senior/Staff Software Engineer will play a key role in shaping their core blockchain infrastructure—designing scalable microservices, owning critical systems end-to-end, and building robust APIs that power seamless integration with global payment networks.\n\n\n\n\nDoes this sound like you?\n\n\n\n\n6+ years of professional software development experience with Java or Go\nExperience leading small teams on architecture and system design\nA strong understand of RESTful API design and development principles\nExperience with SQL databases and designing schemas\nExperience working with payment systems\nHands-on professional experience with blockchain, Web3, or other crypto-related technologies and ecosystems\n\n\n\n\n\n\n\nCan't wait to hear more about this position?\n\n\n\n\nClick Apply below and reach out to Jeremy (Jeremy@BlockTal.com) and they will be more than happy to share more details.\n\n\n\n\n\n\n\nBlockTal is extremely committed to working with equal opportunity employers helping build a diverse and inclusive workforce. We put the people we work with at the heart of everything we do and dedicate all we do to playing a part in developing an industry that represents a variety of backgrounds, perspectives, and skills.",
    "date": "2025-05-07T14:31:37.056732"
  },
  {
    "job_id": "4225027113",
    "link": "https://www.linkedin.com/jobs/view/4225027113/?eBP=CwEAAAGWvBuaSvAoNVnfjg-7r4fmWWhcQ-Zn4hRNfmJiB6C9sioCAjg9BwHZ99EAJ7PtAD5oAjuFGLKrIh3pq98hROuETTBXF2MQw6B86sNKquy_cKgYkpT1GjeBdUzTNsuRA9i56-UCTkNUAOSTxZkr5KVKqmSPgTErCWwaQL-owezwvISfYn1gfrSAh0d4rtCAm7UUPFhfB5E0bGK4Q1C07NB44sU-_Mt216AywPGldRdeVGwVu1TnazTEHw2BYZ7M7uGuG9CJSmQjw3Fp65HThLMdKJ3fGJ7hrRKrpD68UMSpsA9rURvciMd6yv82UoVwNTJDW4WnFgsEUp6jmab3A3lKaShRGmCiuTgDgnaA7iizMbwm99efRDdsUQyqtaFPH9qlZrmQL6DN91A-8UFabuWzO1vpsD1HbWU-X4wiLFVzrq1I6N0L1YO0VaE9LtqukA30Hsv-GXwcZycyL9TEaALqQh60qO8DZMommVmpxQvUs73GPaK58WnYLFaPKfj0QUJ9r2BpyKYiyZAS&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=UymdgYuPINugiKZMWT5nwg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "React Developer",
    "company": "HirePlus Infotech LLC",
    "company_link": "https://www.linkedin.com/company/hireplus-infotech-llc/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQHp6iH4SmFTZQ/company-logo_100_100/company-logo_100_100/0/1671028833197?e=1752105600&v=beta&t=vNBsauYHyIp8u1y8m4N2Byl8fN7E-gF_5MzPb9ulSdU",
    "place": "United States (Remote)",
    "description": "About the job\n\nOne of my clients is looking for React Developer with AEM - Grand Rapids, MI (100% Remote) for a contract role.\n\n\n\n\nPlease Note: Client is only considering candidate from MI, OH, IN, KY, WI, IL state only.\n\n\n\n\nW2/1099 only.\n\n\n\n\n5+ years of React experience is required. \nExperience creating components in AEM is highly preferred.\nExcellent written and verbal communication skills are required.\n\n\n\n\nIf interested, please send your updated resume at harsh@hireplusinfotech.com",
    "date": "2025-05-09T14:31:38.357803"
  },
  {
    "job_id": "4224309227",
    "link": "https://www.linkedin.com/jobs/view/4224309227/?eBP=CwEAAAGWvBuaSoZ2PwjRbeECO0Gd4m4p5FZIXX8-ei1OuufYy0uupal0z_AFZnQ9YYyXfEAr52ENB7Ez10efTS-_c_tt-G7jdkBb_We2KX5gjOmOXdNBBg8Q8HaV3VimD-qqVyRFWidD54pGsYNXP56WhVejkWY-6ttkqQRUZtnSWRKZoYmKoG5b-aDSShmAXg3L8bNNwy_VS8GjcOL6WYS4uRn7At_RTwXHv60qiP-OYIcif6qFg19VXl8BiOiiw-YXyNhgjYV8xl4NbqrNfBfF3PIu2yI5wFcrpP3NeRwZ3bN1r23rT0p0tgiaWUDnVuqZRqYBZi6XsYrR5i5I5OKs6QO_AmF5Ep6AvPxyoNeOXRm5JL-3hYl4wh7g9p8klmctMlLkxGJDY8xvf2BVulzTi77jkS7j-chCy4c-Cff4_oBl40nk9bsuHWADA5e8ySUPaaT-ReuMbgaSPKqRGXwNhawKzGgdCsjEFbzxODEIzVKqETYYhC35ANAo4lj3QmzjVLV6CA&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=adu4Eo8TCZkb2Xe9PoIaLQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Senior Software Engineer (Full-Stack)",
    "company": "DX",
    "company_link": "https://www.linkedin.com/company/developer-experience/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQEFTkOwVfIECw/company-logo_100_100/company-logo_100_100/0/1683840698097/developer_experience_logo?e=1752105600&v=beta&t=34hMHcLe3wxs4K6vSjzZv_Vd93p_hO0-056gC1THQ8I",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout DX\n\nDX helps companies build world-class engineering organizations by providing leaders with insights into developer experience and productivity. DX is bootstrapped, profitable, and consistently growing revenue more than 3X year over year. We’re headquartered in downtown Salt Lake City with customers like Indeed, Etsy, Dropbox, Twilio, Pfizer, and Vanguard.\n\n\n\n\nAbout the role\n\nWe are looking for a product-minded engineer who can be proficient across our tech stack that includes Rails, Postgres, React, and Tailwind. You'll design and deliver features with a high degree of independence, working directly with customers from product discovery to support.\n\n\n\n\nOur engineering team is extremely small and we aim to keep it that way. This means that each person on our team carries significant weight and responsibility, and must ship a lot. In return, we have great compensation, zero bureaucracy, little to no meetings, and the opportunity to immensely impact the business each day.\n\n\n\n\nFor this role, we're looking for someone senior, ideally with 10+ years of overall experience and 5+ years of Ruby on Rails experience. You'll be focused on building products that are used by tens of thousands of developers and engineering managers worldwide.\n\n\n\n\nOur team is mostly based out of Salt Lake City, so candidates must have at least 5-hours of overlap with Mountain Time zone. The compensation range for this role is $160,000 – $280,000 base salary, plus additional equity compensation.\n\n\n\n\nWhat makes a great fit\n\nYou are task-oriented and thrive off getting stuff done, day in and day out. You love knocking things out at a fast pace.\nYour output and work ethic consistently exceeds that of your peers and you want to work on a team where others match your level.\nYou’re accustomed to carrying a lot of weight, e.g., being the first to jump on a bug, going the extra mile to get something done today vs tomorrow, or proactively helping with projects that aren’t your own.\nYou are proficient with Ruby on Rails, with added depth in areas like database optimization, JavaScript, CSS, or infrastructure.\nYou want to work hard—you can consistently put in a full 40 hour week, with occasional spikes when needed.\nYou feel comfortable directly communicating with customers and writing tactful support emails.\n\n\n\n\n\n\n\nCompensation & Benefits\n\nBase salary range of $160,000 – $280,000\nMeaningful equity in a high-growth, profitable company\n401k with 4% match\nUnlimited PTO\nFully covered medical insurance",
    "date": "2025-05-06T14:31:39.654497"
  },
  {
    "job_id": "4223784104",
    "link": "https://www.linkedin.com/jobs/view/4223784104/?eBP=CwEAAAGWvBuaSon0grPaIwgdSfVuRy1v7poPxcZi9NE5cXbT-tyr-qHVpYV2fNxNh525kkZXCaT2-WK-R8RHm-bmBl2ulZ5f_sr_SH8QOfPDOlNvM2aV5UOsC4K7mNsk4yMB8lS1_qg9TwJs6WB_e1L8i6BlN4IRe-KPpqC4p8oHRXvIG1VL-SXOngrySxBmlVa7R8tQ6UBW95uD08srdHWhvO9GPAxdqDkxStNoz2ECHsfxrFcnGeK9N19P2oKozlWBSbZW3GesXxgP9bq68-vpfj2sYZPUan7baDJDlo-oRDXlC1CuV8wjAzvoKDSd1UthC9Y6VoAMt4KHsWcg9YoKrGP3MORUQ1WxObvVhBdOQCS1JmidA24DbtdyY-Iye14uXZ6M5oGRraxwOZzYqimQSHTkZsT_oAGrdcbtCKWQIlsr9Tgfi-tF1R75OAG0YRB3dESjtuMT3HHEnqn_m5ZeYTIm6NKqX8O2cr1yypRO5258T7cWlsLVmAbaL09Uk54r16JhcNzh&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=mhKMLwSLl9v4HDB2olxtXw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Sr. Java with Apache SPARK",
    "company": "iTeckSoft Inc.",
    "company_link": "https://www.linkedin.com/company/itecksoftinc/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQE7n0EDVKjFbA/company-logo_100_100/company-logo_100_100/0/1727677546596/itecksoft_incorporation_logo?e=1752105600&v=beta&t=S1tuwJ0dvo6YrRTDkvMsAKVmHxRueVLZzOMv9gpymyo",
    "place": "United States (Remote)",
    "description": "About the job\n\nDetailed Job Description min 200 words\n\nProvide technology consultation. Assist in defining scope and sizing of the work. Implement the solution. Create technology differentiation. Leverage partner technologies. Participate in competency development with the objective of ensuring best fit and high-quality technical solutions\n\n\n\n\nMust Have Skills (Top 3 skills only)\n\nJava, Apache, Spark, Cassandra, K8\n\n\n\n\nNice to have skills (Top 2 only)\n\nCICD Docker & Kubernetes, Azure Cloud\n\n\n\n\nTop 3 responsibilities you would expect the subcon to shoulder and execute:\n\nLead the team. Guide the team technically and help in understanding requirements.\n\n \n\nEnsure active communication with client and clarify all the offshore teams queries.",
    "date": "2025-05-08T14:31:40.899167"
  },
  {
    "job_id": "4227152844",
    "link": "https://www.linkedin.com/jobs/view/4227152844/?eBP=CwEAAAGWvBuaSgbv2u_rIyehB15olNX_C99rBFGTpXNfxDZi28FyUKrEgoPZJHv-G2ViXAL6d7Mtu0TAxFZ5m0Dq8bUJnl_Dh0zMINYLpDtxcFC1CVFiA3AT1oqEtHFwzd-yS6co7IBXCMvkZVLNRtFSZC_bUwhj5lCMpjFCfrpV69RmX1gms0po1X9baUbrmmHiPpkTAZv6rm4DtQkqY_XKAof_LoGKlbgTY8IwBold4plhbcODtsAD36rRBh7ZL7yQcdRWOz1vQiV2kKSrnEo2wg05B8PdUc1u_Nj2FZsnzTbr96dR0itV58BWsbLsOUg7IE9N_YyON1UQ0t1Fv7l7AHW9FOnE5OhN9aY3djhzNlhw61OYMgovMrh55L5vQE6ZJh22yilU9r2AFnuCNmb_fuNISo5ZQJL2YQRyd36-kCouHHtC-ecfYmN9AbQIA81qP4RBZaB-DE15VvE-x4A19nrx4WiCioFObJeaAnOKZ9ETn06hPI674wrWHIaAfvQHZGr47WGZ7u5LzcL2&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=JZQtXqmZy0445VcKnBiYnQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Javascript Developer",
    "company": "A1FED",
    "company_link": "https://www.linkedin.com/company/a1fed/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQHKIF_ND_cl8g/company-logo_100_100/company-logo_100_100/0/1633402142804?e=1752105600&v=beta&t=JSgFxtBoQa_iVVmZQ1AlTOSEWqEP1oo6VHvvU1rCz5E",
    "place": "United States (Remote)",
    "description": "About the job\n\nOpportunity Overview:\n\nWe are assisting a Department of Defense (DoD) health IT program in modernizing 25+ legacy Ext.js applications into React.js. Our internal team has developed an AI-powered tool to automate the conversion process, and we need a React.js Developer to validate, test, and refine the resulting output. We are looking for someone to support this effort (on a full or part-time) for approximately 3 months (may be extended). Individual must be a US Citizen and have a Secret Clearance OR DoD Public Trust. \n\n\n\n\nThis role is focused on reviewing and correcting AI-generated React code, ensuring functional alignment with the legacy system. It is ideal for candidates experienced in React who can work independently and ensure technical soundness in a compliance-driven environment.\n\nKey Responsibilities:\n\nAnalyze and validate AI-generated React.js code converted from Ext.js\nDebug and resolve functional issues to ensure output meets original application behavior\nDevelop and execute tests to confirm performance, accessibility, and functionality\nCollaborate with internal team members and government stakeholders in an Agile environment\nApply secure coding and accessibility best practices appropriate for DoD and healthcare systems\nContribute to documentation and process improvements for the migration tool and QA steps\n\n\n\n\nRequired Qualifications:\n\nU.S. Citizenship and active DoD Secret Clearance or DoD Public Trust (AFMED-compatible)\nBachelor of Science (B.S.) in Computer Science or Information Systems – or five (5) years of programming experience\nTwo (2) years of experience in each of the following: React TypeScript, Ext JS, .NET Framework with C#, XML, JSON, SQL, HTML, and Object-Oriented Design\nTwo (2) years of application experience with: roles and authentication, user-defined functions, structured reporting, dynamic form generation, MVC frameworks, and APIs\nStrong debugging and testing skills in React environments\nProficiency in JavaScript (ES6+), HTML5, and CSS3\n\n\n\n\nPreferred Qualifications:\n\nExperience with AFMED, MHS GENESIS, or other Military Health Systems\nFamiliarity with Ext.js legacy architecture and migration patterns\nUnderstanding of DoD compliance frameworks (HIPAA, FISMA)\nExperience with Git, Jira, and automated testing tools\nPrevious experience aligning to DoD labor categories (e.g., Web Developer)\n\n\n\n\nAdditional Details:\n\nWork Arrangement: 100% Remote (U.S. only)\nSchedule: Full-Time preferred; Part-Time (20+ hrs/week) considered\nCompensation: $40/hour–$50/hour (W2 or 1099 only)\nDuration: 3-Month Contract (Potential for Extension)\nEmployment Type: W2 or 1099 – No Corp-to-Corp",
    "date": "2025-05-09T14:31:42.227291"
  },
  {
    "job_id": "4227176047",
    "link": "https://www.linkedin.com/jobs/view/4227176047/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=J%2B2XfiqMAkK08byBkeD9sQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer with verification",
    "company": "Maven AGI",
    "company_link": "https://www.linkedin.com/company/mavenagi/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQEvjxlM6wIC8A/company-logo_100_100/company-logo_100_100/0/1732109706614/mavenagi_logo?e=1752105600&v=beta&t=uTdxdZ2HPskIloc6QiZLTQdoVxR0i5nzQaMRSYMKuJ4",
    "place": "United States (Remote)",
    "description": "About the job\n\nCompany Overview:\n\nMaven AGI is an enterprise AI platform on a mission to unleash business artificial general intelligence (AGI), starting with customer service. Founded in July 2023 by executives from HubSpot, Google and Stripe, Maven builds conversational AI agents capable of delivering accurate, autonomous support that delights customers at scale.\n\nOur platform unifies fragmented systems, integrates knowledge and personalization sources, and enables intelligent actions - all without costly system changes. We're laying the foundation for a future where our technology handles complex tasks, allowing people to focus on what they do best: creative problem-solving, relationship building, and delivering exceptional customer experiences.\n\nWe've started by reimagining the enterprise customer experience with a support use case. We believe that today's support experience is broken: slow and painful for customers, and expensive and human capital intensive for companies.\n\nWe are building Maven to deliver better, cheaper support, for both end users and agents. With recent advancements in Generative AI, it is now possible to deliver delightful customer experiences at a fraction of today's cost.\n\nTeam:\n\nMaven has assembled a world-class team of Engineers from Google, Meta, Amazon, and Stripe, and is supported by executives & Advisors from OpenAI, Google, HubSpot, and Stripe.\n\nPosition Overview:\n\nAs a Senior Software Engineer at Maven AGI, your role is pivotal in the development and maintenance of our software systems. This position operates within a fast-paced and collaborative environment, tackling complex technical challenges, and contributing innovative solutions to enhance our products.\n\nWhat You'll Do:\n\n\n Software Development: Lead the design, coding, testing, and deployment of high-quality software applications\n Architectural Design: Collaborate across teams to architect software systems for optimal performance, scalability, and reliability\n Security and Privacy: Implement and maintain security and privacy measures, such as data encryption, access controls, and compliance with relevant regulations, throughout the software development lifecycle\n Coding and Scripting: Create clean, efficient, and maintainable code in languages such as Java, Typescript, and more\n Problem Solving: Identify and resolve intricate technical issues to ensure software solutions align with business goals\n Testing and Quality Assurance: Implement unit tests, integration tests, and automated testing to maintain software quality\n Documentation: Produce and update comprehensive documentation for code, software architecture, and development processes\n Code Review: Actively participate in code reviews to ensure code quality and knowledge sharing within the team\n\n\n\nRequirements\n\n\nWho You Are:\n\n\n Education: Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field\n Experience: Proven experience as a Software Engineer with 3+ years of software development experience\nTechnical Skills:\nProficiency in one or more programming languages (e.g., Java, TypescriptSt, Python, JavaScript)\nFamiliarity with software development methodologies (e.g., Agile, Scrum)\nKnowledge of database systems, cloud technologies, and web development frameworks\nExperience with version control systems (e.g., Git)\n Problem-Solving: Strong analytical and problem-solving skills with a passion for addressing complex technical challenges\n Communication: Excellent written and verbal communication skills, facilitating effective collaboration with cross-functional teams\n Adaptability: Willingness to learn and adapt to new technologies and programming languages as necessary\n\n\nBenefits\n\n\nWhat We Offer:\n\n\n High Impact in cutting-edge field: Be at the vanguard of AI innovation\n Compensation Package: Competitive salary, comprehensive benefits, and meaningful equity stakes\n Inclusive Culture: A diverse and welcoming work environment where everyone's voice is heard\n\n\n\nWhat unites us is our Values and the passion we share to live by them:\n\n\nDo right for our customers\nWe are data-driven\nBe entrepreneurial\nStrive to be better, together\n\n\nMavenAGI is an equal opportunity employer that values diversity and is committed to fostering an environment where everyone feels included.\n\nJoin us in changing the face of enterprise customer support.",
    "date": "2025-05-09T14:31:43.566047"
  },
  {
    "job_id": "4219100634",
    "link": "https://www.linkedin.com/jobs/view/4219100634/?eBP=CwEAAAGWvBuaSsv4Uzoyv7Op4VB3EG7uNlN5aXXfXfAGV-Uc6HOvIZIgo5FjaonGWvWd3abZ1yiG43vFHYjgNdSftvbFp9HWUj55dBJPAK8LDVmHcqCyPasRXZPbd6jftluFtmYLG10w0f4C3Qe87zwGUmE0eo0U3VzqAK2DIKC2AsBelLwsH_hGgeLZYPT7Xg0QFnbzWW5VjkOM1aIfA14Gc7Jzl54jnVDgm1ttqN8WQcW6FYqYmpYxd0bx7RjpL91SYzKGTesEkFv-Npr3xUBcUwF_QhSnslY4Fc6sNjwvk8rcOGedrHDea4hT9lLfEkv5l5ukpdFkSFPlT4lpilZoQ_xPQbR_LrinX76qEI8A-xaXSAhNEQSQaw7GvAd6elK1asaP5L0fPrM-iwoea2jbl1-jGTqSo0hamUwNEGQoP0mjUAc2FpxiiA2HDpEMMa06cKNngJ2u9oRt8332BpW-72ntOsYTgXqnB7qR0_5EWInjMeKtjXhKYHd83uPkPsuZbD9STiRE&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=W8U75y%2BYSiYgDGgCnwFWgw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Newcore",
    "company_link": "https://www.linkedin.com/company/newcoresearch/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGxZnHmQqxZTA/company-logo_100_100/company-logo_100_100/0/1724936365166/newcoresearch_logo?e=1752105600&v=beta&t=GWM2L37qVaG4tm3fNHROvwsH9_FVVKPZlGYws1s_VNM",
    "place": "United States (Remote)",
    "description": "About the job\n\nNewcore has partnered with a cutting-edge infrastructure protocol utilizing machine learning to empower Web3 applications.\n\n\n\n\nThe team is looking for a Solidity team to join their team and focus on designing, engineering, and auditing Solidity smart contracts.. If you are interested in joining a dynamic, small team to create real impact, this opportunity is for you\n\n\n\n\nKey Responsibilities\n\nSmart Contract Development: Write smart contracts that orchestrate machine learning workflows and manage arbitration and settlement processes.\nSecurity Audits: Conduct audits of smart contracts and their integration points within the broader codebase.\nTesting and Debugging: Ensure the codebase is production-ready through thorough testing and debugging.\n \n\nRequired Skills and Qualifications\n\nExperience: 3+ years of production-level Solidity experience, particularly with contracts handling significant fund flows.\nRollups Knowledge: Strong understanding of rollup technologies.\nTesting Frameworks: Familiarity with modern testing tools such as Mocha and Chai.\nComputer Science Fundamentals: Solid background in core computer science principles.\n\n\n\n\nPreferred Skills\n\nExperience with smart contracts interacting with oracles.\nBackground in venture-backed startup environments.\nConceptual understanding of machine learning workflows.\nHands-on experience with AI systems in production\n\n\n\n\nDetails\n\nThis is a Remote-first opportunity\nCompetitive base salary + meaningful equity/token upside",
    "date": "2025-05-03T14:31:44.824523"
  },
  {
    "job_id": "4223644249",
    "link": "https://www.linkedin.com/jobs/view/4223644249/?eBP=CwEAAAGWvBuaSrF8KehyiD_YNvybeoI7eQcqSw32BE6qOT7yEyB7BG7kR5hcCm3N0M3ImhKht2F6gee-_N7nuARzEtyNl6zrqys8HHFOntsGddxZ2Zm8EXxWlFv9az74ku6HlIF06XIpUxA6McPlKi5iJ6m2T9FwWJRHthEdCmw1rsYnoFUoDmwXtYlMmUbEENqvkys3XTq-NL3sFW3HSZTzsvFMYF9s-KjtIra8sbZGLVtmRtp3VhzT-wXC33q9rcYCqLMEIUa1EYdh2vsqTIy7QSsRvAFv1Xh3Lf9sXIB13ra12Z_BKI19C3BDCW9xtLO7sqxM-K9bdMeIsVBb6ZFsujeyX1_Cym7kE30ti_nMPGaJuaL-GV9PezltMM-O8H8APIlo8keTtQHF3CykyqFoAtbZOp87h9hCJH6K1M1FBib99y9ahPuxFY6KLL7S-YETLdRqEvF1FQLCZblpnLP3b59FojovNKCwT36HzE80TEApUa9CRgf8E-MW1Nqh_1T7w7Y&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=pPJFmOLY98gLmh%2B1XP8oXQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Principal Software Engineer",
    "company": "Demand IQ",
    "company_link": "https://www.linkedin.com/company/demand-iq/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQHl0CJAfoWLsA/company-logo_100_100/company-logo_100_100/0/1631755959821/demand_iq_logo?e=1752105600&v=beta&t=njKKAt004k2WDE3iltw_LBJCGld2vYVT8qHLI4glATU",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout Us\n\n\n\n\nDemand IQ is a powerful website plug-in that transforms home improvement contractor sites into e-commerce-style platforms, enabling homeowners to receive quick, ballpark quotes for home upgrades. By completing a short survey and utilizing satellite imagery, property data, and AI, Demand IQ delivers accurate project estimates in seconds. Perfect for industries like remodeling, roofing, solar, and HVAC, the platform helps contractors capture more qualified leads, filter out prospects with unrealistic budgets, and facilitate online project sales. Based in Denver, Demand IQ has raised $5.8M in Seed funding, generates seven-figure revenue, serves hundreds of contractor customers, and is on track for a Series A within the next year. \n\n\n\n\nWhat We Are Looking For\n\n\n\n\nWe are seeking a highly motivated and experienced Principal Software Engineer to join our growing team. In this role, you will play a critical part in designing, developing, and maintaining our core platform, with a strong emphasis on backend systems and architecture. While the role is backend-leaning, an appreciation for clean, intuitive user experiences and collaboration with engineers and designers is highly valued.\n\nYou’ll work across the full scope of our product, partnering closely with other senior engineers, product managers, and designers in a fast-paced, agile environment. A key aspect of this role includes direct interaction with our customers—understanding their challenges and helping translate their needs into thoughtful, scalable technical solutions.\n\nThis is primarily an individual contributor role, but it also involves providing technical leadership. There is potential for rapid advancement, with the opportunity to transition into a Head of Engineering or CTO role within 6 to 12 months, depending on performance and company growth.\n\n\n\n\nKey Responsibilities\n\n\n\n\nDesign, develop, and maintain core components of the Demand IQ platform, focusing on scalability, reliability, performance, and a user-centric design. This includes contributing to the architecture and implementation of features across the entire platform.\nWrite clean, well-documented, testable, and efficient code (primarily in Go and React) that adheres to industry best practices and contributes to a maintainable codebase.\nCollaborate closely with product managers, designers, and other senior engineers in an agile environment to translate business requirements and customer feedback into technical solutions. This will include direct interaction with customers to understand their pain points and needs.\nDevelop, deploy, and maintain robust React-based embedded widgets designed for seamless integration into diverse customer websites, ensuring compatibility and performance across various environments.\nIdentify and proactively address potential challenges and limitations associated with deploying embedded software onto external websites, such as handling conflicts with existing site scripts, managing CSS encapsulation, and ensuring smooth interoperability with third-party website components.\nParticipate in code reviews, providing constructive feedback to ensure code quality and consistency across the team.\nTroubleshoot and debug complex issues, identifying root causes and implementing effective solutions.\nContribute to the improvement of our development processes, including CI/CD pipelines, testing frameworks, and coding standards.\nStay up-to-date with the latest frontend technologies and UX best practices, evaluating their potential application to the Demand IQ platform.\nProactively identify and address technical debt and ensure long-term maintainability of the codebase.\nWork within an AWS environment, leveraging its services to build and deploy scalable solutions.\nWork directly with customers to understand their problems, propose solutions, and help implement those solutions.\n\n\n\n\nSoft Skills:\n\n\n\n\nOrganization and strong attention to detail\nCommitment to high-quality product and scalable code\nDedication to front-end design and its impact on user experience\nStrong empathy for users and stakeholders\nAbility to simplify complex concepts for non-technical audiences\nProfessional presentation and clear communication with customers\nHigh intelligence with a humble and approachable attitude\n\n\n\n\n\n\n\n\n\n\nRequirements:\n\n\n\n\n5+ years of professional software development experience.\nStrong interpersonal skills, with the ability to collaborate effectively with cross-functional teams and communicate technical concepts to non-technical audiences.\nProficient in Go and React, with experience building RESTful APIs.\nExperience with core AWS services, including S3, SQS, ECS, RDS.\nExtensive experience with the React ecosystem, including state management, component libraries, and build tools.\nProven expertise in embedding and maintaining software components on external websites, addressing cross-domain concerns, script loading performance, and compatibility issues.\nExperience building and scaling web applications, preferably in a SaaS environment.\nExperience with relational databases, specifically PostgreSQL.\nExperience with unit, integration, and end-to-end testing.\nProficient with Git for version control.\nExperience working in an Agile environment.\nStrong analytical and problem-solving skills, with a proactive approach to identifying and resolving issues.\nA genuine interest in understanding and addressing customer needs.\nA great team player, but also able to work autonomously.\n\n\n\n\nPreferred Qualifications:\n\n\n\n\nExperience with React Native.\nFamiliarity with micro-frontends and experience managing JavaScript SDKs for third-party integrations.\nFamiliarity with no-code tools (e.g., Webflow, Typeform, Shopify).\nUnderstanding of the home improvement industry.\nExcited about working in a fast-paced, scaling startup environment. Comfortable with ambiguity and change.\nNot satisfied with the status quo. Great at finding problems and addressing them proactively.\n\n \n\nCompensation & Benefits:\n\nFully remote – work from anywhere in the U.S.\nCompetitive salary: $170,000–$200,000\nEquity: 0.25%–0.5% ownership\nBenefits: 401(k), medical, and dental insurance\n\n\n",
    "date": "2025-05-08T14:31:46.101945"
  },
  {
    "job_id": "4227100539",
    "link": "https://www.linkedin.com/jobs/view/4227100539/?eBP=CwEAAAGWvBuaSoOhzW3D8SUamjZYYYTXoG0IixPlx3_BEdOc-66PI81kXkg1aTAwiyTeBzH7LM_7V-MYNQ6FAKAea9EGePuY6Zg1fgNgIUKIk173mphnCRIENxYQkKM-ayjfCQF4nHzz7AxUqlfxi1LqqJAlPW-ZMvoEjyMVFkspzBQE4ktmrGHM56SNrHttmnJrHtdsDRAL7xtLx1gXK5tyoJk1LPrhr8hu9qrg7I7j34s8-2pIBckeS_YFZVdVDvOQnprCCRWV4WduD2L0jMj5xghrzRQU-8RcMc-ip08dEh5tkflpvFFq55VKkDFMJ8bIjw0ei5qUfWjLhHvts5mPuaVc76nr4VOzHNoM9gT_tBvL-xkPy1sohXmJdo_RCFgaivjYLQKLCnbqtWbz0NhZc_R-eyZgXghqNAuI1SJIOuWik4WB114XAFkjI_nvBJQ9XEeAH57-zZpVucHtdX2KC8t_PfWCvrPrsURu6-2YY-wYzAAWC6QwnmIdcjuHusJd-mmfUcPLC5IbQA&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=5gMH3x%2FMR3fdeuRi1G66GA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Goliath Partners",
    "company_link": "https://www.linkedin.com/company/goliath-partners-inc/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQEGxoU_V_HCSw/company-logo_100_100/company-logo_100_100/0/1675096738538/goliath_partners_inc_logo?e=1752105600&v=beta&t=tee61T_c1AtE4TecrSRH12l96YZFnmZL3Dx77yDdQ-I",
    "place": "United States (Remote)",
    "description": "About the job\n\nWe are working with a US-based HFT trading firm that is looking for a seasoned Software Engineer with C++ and execution experience to join their team. They are offering remote work opportunities in order to expand their networking abilities around the world and provide a great work-life balance.\n\n\n\n\nRole:\n\nWork on all elements of the trading stack, including market integration, order flow & execution.\n\nComponent of Strategy Implementation with the Quant team.\n\n\n\n\nEssential Skills:\n\nBS in CompSci, Math, Stat or similarly related field.\n\nCore background in C/C++ engineering developing trading systems (Trad-Fi is of interest and/or Crypto - don't categorically need D1 Crypto expertise).\n\nIdeally familiarity with order flow & execution will help get up to speed quicker.\n\nExchange gateway connectivity a big plus, as is LL (not a dealbreaker).\n\n\n\n\nBeneficial Skills:\n\nMasters/PhD in STEM related subjects\n\nKnowledge of Python\n\nWork experience with a disruptor, startup, or trading enterprise\n\n\n\n\nComp:\n\nOur client is looking at paying up to $450,000 USD for this opportunity with an attractive benefits package.\n\n\n\n\nIf interested, please apply and Goliath Partners will be in touch!",
    "date": "2025-05-09T14:31:47.461548"
  },
  {
    "job_id": "4222659919",
    "link": "https://www.linkedin.com/jobs/view/4222659919/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=0eqJN5lOC1uFPM91%2Bn6ClQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer, CI/CD (Remote - US)",
    "company": "Jobgether",
    "company_link": "https://www.linkedin.com/company/jobgether/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQEFATQCdWa6tg/company-logo_100_100/company-logo_100_100/0/1635587710644/jobgether_logo?e=1752105600&v=beta&t=wVyri86acQwWgC1v31pfii29kqrmOYBr3jhSV31lFBk",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout Jobgether\n\nJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.\n\nOne of our companies is currently looking for a Software Engineer, CI/CD in the United States.\n\nThis role offers a unique opportunity to build and maintain core systems that power the continuous integration and deployment processes used by millions of developers. You will design and optimize high-performance microservices, contribute to intuitive frontend interfaces, and ensure the scalability and reliability of mission-critical infrastructure. With a blend of deep systems engineering and product-centric thinking, you'll directly shape the developer experience and help deliver faster, more iterative shipping workflows across the web. This is an ideal position for engineers passionate about scale, speed, and enabling world-class development.\n\nAccountabilities:\n\n\nDesign and develop high-performance backend microservices supporting the deployment lifecycle\nMaintain and enhance distributed systems and APIs used across the platform\nContribute to frontend improvements for deployment interfaces\nIdentify and implement opportunities to increase system performance and reliability\nParticipate in on-call rotation and own incident response for CI/CD infrastructure\nCollaborate with internal teams and engage with the broader developer community\n\n\n\nRequirements\n\n\n3-5 years of experience building full-stack or backend-heavy applications\nProficient in JavaScript/TypeScript and familiar with React or similar frameworks\nStrong understanding of API design, distributed systems, and CI/CD practices\nExperience writing scalable, testable, and maintainable code\nAbility to work collaboratively in a remote team and communicate clearly\nBonus: Expertise with React or Next.js, open-source contributions, or prior CI/CD platform work\n\n\n\nBenefits\n\n\nCompetitive compensation, including equity\nComprehensive healthcare coverage\nGenerous flexible time off policy\nHome office setup allowance and provided equipment\nProfessional development support, including events and mentorship\nFully remote with optional in-person collaboration spaces\nSalary range (New York base): $156,000-$270,000, adjusted by location\n\n\n\nJobgether hiring process disclaimer\n\nThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.\n\nOur AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.\n\nOur process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.\n\nIf you are among the top 5 candidates, you will be notified within 7 days.\n\nIf you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.\n\nThank you for your interest!\n\n",
    "date": "2025-05-07T14:31:48.794817"
  },
  {
    "job_id": "4227460741",
    "link": "https://www.linkedin.com/jobs/view/4227460741/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=1XqnUDtlXvRl8%2B7c0x%2FFJw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Backend Engineer",
    "company": "Wordly",
    "company_link": "https://www.linkedin.com/company/wordly-inc/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4E0BAQE4zBds94i1_w/company-logo_100_100/company-logo_100_100/0/1630575596310?e=1752105600&v=beta&t=v6pA9DD1ilwa4WD1DvlOjUJ7gpzJXXzyUL7LWAC5-GA",
    "place": "United States (Remote)",
    "description": "About the job\n\nJoin Wordly's fast growing global team! \n\nAs a Backend engineer at Wordly, you will use your expertise to implement various software solutions across Wordly’s technology stack. Not only will you help maintain existing software, but you will also have an active role in developing new features that will be actively used by Wordly’s end-users to fulfill their real-time translation needs.\n\nIn this role, you will be a member of a highly collaborative development team. As part of this team, you will help plan the technical work that needs to be done to accomplish a given set of engineering objectives. You will then help execute the plan by producing high quality, scalable, and robust code that meets the technical specifications as laid out by the team.\n\nMinimum Qualifications\n\n\n2+ years of hands-on experience in implementing, and delivering software engineering solutions from set product requirements. \nExperience working with dependency injection frameworks such as Micronaut, Spring Boot, etc. \nExperience using the Git version control system. \nProficiency in the Java and/or Kotlin programming languages. \nComfortable working with a fully remote team. \nSelf-motivated and able to work independently with minimal supervision. \n\n\nDesired Qualifications\n\nIn addition to the minimum qualifications, the ideal candidate meets some or all of the following desired qualifications.\n\n\nFamiliarity with microservice architectures. \nExperience with distributed messaging brokers and/or event streaming platforms such as RabbitMQ, ZeroMQ, Kafka, etc. \nExperience using NoSQL databases such as Mongo, Cassandra, etc. \nExperience with distributed caches such as Redis, Valkey, etc. \nB.S. degree in Computer science or equivalent from an accredited institution. \n\n\nResponsibilities\n\n\nWork within an engineering team to deliver software solutions with guidance from senior engineers. \nHelp devise work plans to meet engineering objectives. \nAssist in maintaining existing software solutions. \nContribute to Wordly’s engineering processes and culture to maintain a cooperative and supportive environment for all. \n\n\nLocated in Los Altos, California, Wordly is an exciting tech startup that is looking to grow its engineering and GTM teams! From virtual meetings to large, in-person conference venues, Wordly strives to provide high quality, real-time translation services in 50+ languages to anyone, anywhere. \n\nWordly caters to numerous customers around the world which include local organizations and businesses; government entities; Fortune 500 companies; and much, much more. While this is a fully remote position, office space in Los Altos, California is available for San Francisco Bay Area residents that wish to utilize it.\n\nTo learn more about Wordly visit www.wordly.ai and follow us on our LinkedIn page.\n\n",
    "date": "2025-05-09T22:31:50.067970"
  },
  {
    "job_id": "4184721472",
    "link": "https://www.linkedin.com/jobs/view/4184721472/?eBP=BUDGET_EXHAUSTED_JOB&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=VNvUKSjCFMZ1iSRc5XWHBg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer Internship (12 months)",
    "company": "Clerkie",
    "company_link": "https://www.linkedin.com/company/clerkie/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQGVO0QuAs2sCA/company-logo_100_100/company-logo_100_100/0/1704914169399/clerkie_logo?e=1752105600&v=beta&t=-k5xqfXtuS4wRRkmuvK7F0boVeJViaXU1hw_0YLEgTc",
    "place": "San Francisco, CA (Remote)",
    "description": "About the job\n\nAbout Clerkie\n\nClerkie is a fintech startup on a mission to democratize financial wellness using the power of artificial intelligence. Launched in 2018, Clerkie began with an app, aiming to help the nearly 123 million underserved Americans in need of financial guidance. Since its inception, the company has expanded its services and now pairs consumer guidance with cutting-edge B2B software. By pairing the two through the Clerkie network, these tools have become the go-to resource for creditors looking to manage loan losses while simultaneously helping millions of borrowers get out of debt.\n\nClerkie is a remote-first company, with over 30 employees spanning 4 time zones across the United States. To date, the company has raised $41 million, including a $33 million Series A round in early 2023. Investors include leading financial and venture institutions, including Citi Ventures, Left Lane Capital, Wellington Ventures, Flourish Ventures, and Vestigo Ventures.\n\nAbout the internship\n\nAs the newest addition to Team Clerkie, this Software Engineer Intern will work across our Engineering function to contribute to Clerkie Fiber, our B2B CRM, designed to transform the debt industry.\n\nThis 12-month paid internship is designed for soon-to-be or recent graduates who are excited to kickstart their career in software engineering. You'll work across the full stack, collaborating with engineers on frontend, backend, and infrastructure projects. Whether you're optimizing APIs, refining user interfaces, or contributing to our architecture, your work will have a direct impact.\n\nThis isn't just another short-term internship - it's an investment in your growth. The ideal Clerkie team member is curious, collaborative, and eager to grow in a fast-paced environment. Clerkie's culture values a customer-first mindset and a bias for action - we're looking for someone who's excited to dive in and learn.\n\nWhile this opportunity is remote-first, Clerkie offers the option to visit or work from our SF HQ at any time.\n\nHere's what you will do\n\n\nDevelop and maintain Clerkie Fiber, our flagship B2B CRM, collaborating closely with backend, frontend, product, and design teams\nWork across the full tech stack, from frontend interfaces (Next.js, Tailwind CSS) to backend services (Node.js, AWS, MongoDB)\nBuild robust and scalable APIs to support our platform's growing user base\nOptimize performance and ensure a seamless, user-friendly experience\nWrite clean, well-structured, and maintainable code with a strong emphasis on scalability and security\nContribute to system architecture decisions, helping shape the future of Clerkie's technology\n\n\nMinimum qualifications\n\n\nA soon-to-be or recent graduate (class of 2024 or 2025 preferred) with a degree in Computer Science, Software Engineering, or a related field\nProficiency in JavaScript/TypeScript and experience with React.js, Next.js, or Node.js\nComfortable working with databases (SQL or NoSQL, e.g., PostgreSQL, MongoDB)\nAbility to manage project priorities, meet deadlines, and deliver results independently\nExcitement for being part of a small, fast-moving team where every day brings new challenges and opportunities to learn and grow\n\n\nPreferred qualifications (ranked by priority and not required):\n\n\nPersonal or school projects involving full-stack development\nExposure to AWS, Docker, or CI/CD pipelines\nExperience with testing frameworks (Jest, Mocha)\nInterest in fintech or financial literacy\n\n\nOther adds\n\n\nPassion for our mission\nExperience building and scaling products\nProactive team player who can work with others towards a common goal\nExtreme focus on the user with a healthy obsession for solving their needs\nCommitted to being a part of something bigger than yourself\n\n\nOur salary range\n\n\n$90k - $110k \n\n\nOur Benefits\n\n\n🩺 Medical, dental, and vision insurance (if eligible)\n🏝 Paid time off & company holidays\n🧑‍💻 Annual company retreat with the Clerkie team (this year we're headed to the Bahamas!) \n📈 Hands-on mentorship & professional development\n\n\nOur Process\n\nOur hiring process is intentionally designed for you to interview Clerkie as much as our team is interviewing you. We've built a 5-step process that allows for a two-way assessment across skills, behaviors, values, technical ability, ways of working, and adaptability in a lean startup environment.\n\n\nApplication & Coderbyte (async candidate time) \nIntro Screen w/ People team (20-30 minutes via Google meet)\nTake-Home Challenge & Live Review w/ Sr. Engineer (challenge is async candidate time, live review is 45 mins via Google meet) \nLive Coding Challenge w/ another Sr. Engineer (90 minutes via Google meet) \nFinal Management Meeting w/ SLT (45 minutes via Google meet)\n\n\nBefore we extend any offers, all candidates must successfully complete a standard background check in addition to a reference check. These checks are conducted in tandem to ensure a safe, secure, and compliant environment for all Clerkie team members and stakeholders. We approach this stage with transparency and sensitivity, and candidates will be provided with clear information about the process.\n\nApplicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time.",
    "date": "2025-04-10T14:31:51.337801"
  },
  {
    "job_id": "4224725745",
    "link": "https://www.linkedin.com/jobs/view/4224725745/?eBP=CwEAAAGWvBuaSrtERX9GlNVsAGF_njFs6fv36vTPDPZ8zvCz7c6ubVOjWW66_m_yZ5b9CKeQ9oxJH2PRuSf4qQVbXy-guU-q5DZHd1iSuJt3Cof_Qhy8-HoNogfSflmT53QyXc9aGinPkltkov4mXP88FMTAX_2LHmFp4nk_RDDz_y9T8p-QyTPSoh54jxWhjFCw_DwGyJXNZUzk_I0pXID-jPpAN50wvNSJw3IwV_l5BY6LKkCLCv4IZwuntucuZzbEi91OISyfWwCTyYMJo0K-Zh6an_T-6fgJRzqC7XhJqtwJvEOjX1-T5dwl3JMDwRolxEcmbUXYL551th4zcGvq2H2xCD3EOgXkayNDVWMvjkq9JDhioKviRRLiU_qdZZt1e_h0JWfHyQr2GkMDFiI2l7JQn6kI3T67YT6HQtoV69uAdxN9xi92t92SxDxklWpTn1I6ietqgIye7rbhAsImLO6S4kwrfRF9mmPfFX4ORbJ2zK0_ZbVJMIGdEQWo-dG26K9mgmEVM8SqLQ&refId=pgtmCzsxAKNUx%2BjzZYvB2w%3D%3D&trackingId=F18Q3BTwARE%2BWWG83yl9PA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Engineer with verification",
    "company": "Tenth Revolution Group",
    "company_link": "https://www.linkedin.com/company/tenthrevolution/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQG1cF08hlVJUQ/company-logo_100_100/company-logo_100_100/0/1713427059617/tenthrevolution_logo?e=1752105600&v=beta&t=QGv7PLpYxMrXcBgXmREhCjDOBjeQu4PpmrBYCQGJbU4",
    "place": "United States (Remote)",
    "description": "About the job\n\nJob Title: Software Engineer\n\n\n\n\nLocation: Hybrid (Onsite 1 day per week or every other week, flexible)\n\n\n\n\nTech Stack: .NET, SQL, Angular or React, Azure or AWS\n\n\n\n\nWe’re looking for a passionate and skilled Software Engineer to join our dynamic team. You’ll work in a collaborative environment, contributing to innovative projects while using cutting-edge technologies to solve real-world problems.\n\n\n\n\nKey Responsibilities:\n\nDesign, develop, and maintain applications using .NET, SQL, and modern frameworks like Angular or React.\nCollaborate with cross-functional teams to deliver high-quality software solutions.\nWork with cloud technologies like Azure or AWS to deploy and scale applications.\nContribute to all phases of the software development lifecycle, including planning, implementation, testing, and support.\n\n\n\n\nWhat We’re Looking For:\n\nProficiency in .NET, SQL, and experience with either Angular or React.\nStrong experience with Azure or AWS cloud platforms.\nProblem-solving mindset and the ability to work effectively in a team environment.\nExcellent communication and collaboration skills.",
    "date": "2025-05-09T14:31:52.605432"
  },
  {
    "job_id": "4224649249",
    "link": "https://www.linkedin.com/jobs/view/4224649249/?eBP=BUDGET_EXHAUSTED_JOB&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=uWuMKYOQIvZmMjtufrMk4g%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer",
    "company": "Cook'd",
    "company_link": "https://www.linkedin.com/company/cookd-dev/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4E0BAQGSAZmrxhlzcA/company-logo_100_100/company-logo_100_100/0/1730915764621/cookd_dev_logo?e=1752105600&v=beta&t=GQVjhLW5R5TQO4zDCHoc9PyAz-_F3YadDXAuQamjn9E",
    "place": "United States (Remote)",
    "description": "About the job\n\nThis Isn't a Role at Cook'd — It's a way to apply to all the companies we're partnered with.\n\n\n\n\nWe are partnered with a bunch of companies that are searching for AI, Full Stack, and Founding Engineers, and we're looking for candidate that can just ship!\n\n\n\n\nWhat You'll Be Doing\n\nWhile each company is different, most roles share a few core themes:\n\nBuilding and scaling backend systems, APIs, and data pipelines\nIntegrate AI models into production\nDesigning and shipping product features with a small, fast-moving team\nContributing across the stack, especially in Python, Node.js/TypeScript, and React\nWriting clean, maintainable code in a modern cloud-native environment (Docker, Kubernetes, AWS/GCP)\n\n\n\n\nYou Should Only Apply If\n\nYou have solid software engineering fundamentals\nYou enjoy being hands-on across the stack\nYou're able to learn new technologies quickly\nYou thrive in a fast-paced startup environment\nYou're excited about the intersection of software and AI \nYou're open to full-time, in-person roles in NYC\n\n\n\n\nYou Should NOT Apply If \n\nYou prefer highly specialized roles with narrowly defined responsibilities\nYou're uncomfortable with the ambiguity and rapid changes of an early-stage startup\n\n\n\n\nWhat We’re Looking For\n\nFor Solid engineering fundamentals and a builder’s mindset\nExperience working with APIs, databases, and distributed systems\nCuriosity and initiative — you like figuring things out\nAbility to ship clean code quickly without constant oversight\nEagerness to learn and grow in a fast-changing AI ecosystem",
    "date": "2025-05-09T14:31:55.844291"
  },
  {
    "job_id": "4223207234",
    "link": "https://www.linkedin.com/jobs/view/4223207234/?eBP=CwEAAAGWvBwhb-cmZyrKQVRHHOan1u9T2ji_hjJsB7CLDQU5QmrH0znTWnr6DM_vvL8GuN-Hr13zTYW5Mr0dK46OXrpcDbEgknCHzXLc4Ydf9I_UAMCOq_Ynkihtc5-PrKHE-9aBSx8vT_RDFCiwZ5HKVwfufQ_nfPOy0M9aoPNl_EyD57J61bkHARDMF0BcuOarBnb0nU_Nyy0AbKLWKKv1twy_WLlaAUBEUj0Aj7Cv2spNtwt8WaU_nCwDASzURlwGLW6JHkrKizIRSxpbq0zUMCifDHGQ1ZmyKWNvDCIeAFkHj2yKKFUsJYalwqWjOsqah8fGu9DtWWXQAVhTNGvTh1m98juA3tWCrPdMad_yp-xKj3u2JSiJ3vipSHmpyqbwtV4ac_o2KDdD_T5dOuaRdM6qWDAfHCsDeXnl07imuShX8U1L-ggVOn1My6wcribHNtWp_eFAePVzzaZmkiCrdOst56dXF7snAU1WtQkAAicqy30LQUdbL9UL4-Oep1uBGAQkS0CBmoM&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=kd9NsB5bBQjSjGzfihRcdw%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Engineer with verification",
    "company": "Robert Half",
    "company_link": "https://www.linkedin.com/company/robert-half-international/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQFP6-a3z7Fm8Q/company-logo_100_100/company-logo_100_100/0/1696341221977/robert_half_international_logo?e=1752105600&v=beta&t=Umf0t07UBppq8kb7gD6zg7_t_mlwn1CZkeHz_Rvpbn8",
    "place": "United States (Remote)",
    "description": "About the job\n\nFull-Stack Engineer (70% Front-End Focus)\n\n\n\n\n100% Remote\n\n\n\n\nEmployment Type: [Full-time/Contract/Permanent]\n\n\n\n\n\n\n\n\n\n\nAbout the Role:\n\n\n\n\nAre you a motivated, resourceful full-stack engineer who thrives in lean, dynamic teams? Do you bring exceptional front-end skills coupled with robust backend experience to the table? Our client is searching for a proactive leader who can take ownership of projects, work collaboratively across teams, and grow into a Principal Engineer or Architect role over time. This is an incredible fully remote contract to permanent opportunity to contribute meaningfully to projects, ensure their sustainability, and drive impact across a rapidly evolving tech landscape.\n\n\n\n\n\n\n\n\n\n\nKey Responsibilities:\n\n\n\n\nFront-End Development: Design and implement robust front-end solutions, focusing on JavaScript frameworks like React, Knockout, and jQuery, as well as CSS for multi-device formats.\nBackend Development: Build API layers and backend systems using Java or Python to complement the front-end integrations.\nMaintain High Performance: Contribute to distributed systems with 99.999% reliability and ensure no lag in video/audio streaming and asynchronous applications.\nOwnership of Projects: Take charge of assigned projects, follow up to ensure completion, and proactively collaborate with team members to keep tasks moving forward.\nSustainable Code Practices: Implement unit tests, write clean and maintainable code, and create documentation to support Tier-2 production debugging.\nCross-Project Collaboration: Expand beyond your assigned project to bring fresh perspectives to other initiatives, roadmap development, and timelines.\nLeadership Opportunities: Demonstrate potential and willingness to grow into Principal Engineer/Architect roles by showcasing domain expertise and leadership skills.\n\n\n\n\nExperience:\n\n\n\n\nPreferably 3-5 years at a single company to show meaningful contributions, long-term impact, and the ability to navigate multiple project phases.\nCandidates from smaller organizations rather than large enterprise environments are preferred.\nA demonstrated ability to take ownership of their work rather than requiring constant instructions.\n\n\n\n\nTechnical Expertise:\n\nFront-End Proficiency: Expert knowledge in JavaScript frameworks (Knockout, React, jQuery), in addition to CSS knowledge tailored for multi-form devices.\nBack-End Understanding: Solid grounding in Java or Python, with the ability to integrate front-end and backend seamlessly.\nFamiliarity with containerization and building asynchronous applications.\n\n\n\n\n\n\n\nMindset:\n\nSelf-starter who proactively keeps projects moving and grows beyond their assigned scope.\nA collaborative team player who reaches out to others, follows through, and integrates deeply into a lean team environment.\nStrategic focus on documentation, sustainability, and debugging production issues in partnership with Tier-2 teams.\n\n\n\n\n\n\n\nTechnology Stack:\n\nFront-End: JavaScript (Knockout, React, jQuery), CSS (multi-form devices).\nBack-End: Java or Python.\nOther Skills: Distributed systems, containerization, asynchronous application development.\n\n\n\n\n\n\n\nReady to take the next step in your career journey? Apply today to become part of this innovative and forward-thinking team.",
    "date": "2025-05-07T14:31:57.215781"
  },
  {
    "job_id": "4227073815",
    "link": "https://www.linkedin.com/jobs/view/4227073815/?eBP=CwEAAAGWvBwhb5lZ2Ph5numPtrd2x9AfgyLj6S6BIh8spAlk4F3sPs4CO19SIY6BQXLVtAW9LRYlS-oXwjgKDau6EzXC6-e5_iUxY7lZ9Bk-tugifauSu1JNdP5jYpcXYzmHGmsRFlGGtpDD2u-ILhULjqKFBXjAu06hR30ccV46K-kmVziWT4DYShyTh5rfV1OEt_oYRNe-ddFrL01knBPFVclG7eyF4dndsU2JEy87bjVM7hifgVKkwLCKpg5r3YBLr5_Z8I-eb9jN3pNp45MJsx0RihVRmZOdCqNXVaJ3cZk0GihXIg23nTUN8C9Y-XJyEaj_7wMCgJcT7VypWxJqwrr5MyfELpJNDW6cLFJfYpva61ba8McMXyv-nELJe_au3jzRoUS6IBE_80XUZbIVMR6JUjJ9i4XFEOyzTpOJYF4rnUIoEX88-t5RkUmYRPH7pZWhZbYfi9f8zB09f0Y-5pDxoRi7p5pv4NCbQa1i65V6h7qRbTcmSNWfO9q0pqEyW-idyEApuPc&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=X5fEsCeJiXE8%2Fax6dkiF1w%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Python Developer with verification",
    "company": "Tailored Management",
    "company_link": "https://www.linkedin.com/company/tailored-management/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQHK8d4sG9ESiA/company-logo_100_100/company-logo_100_100/0/1686979185110/tailored_management_logo?e=1752105600&v=beta&t=vQCSdchz9ql3LM_o_0L6ys6SvR3b-fdzoJj--sUFiCc",
    "place": "United States (Remote)",
    "description": "About the job\n\nJob Title: Software Engineer \n\nLocation: Remote\n\nContract: 12 Months\n\nPay Rate: $60/hr,W2\n\nBenefits: Medical, Dental, Health\n\n\n\n\nJob Description:\n\nWe are hiring a software engineer developing next-generation 3D computer vision platforms for AI/AR/VR applications: specifically, the role focuses on developing data pipeline, tooling and infrastructure to enable high throughput low latency data processing with next-gen 3D computer vision algorithms.\n\n\n\n\nJob Responsibilities:\n\nDevelop software features (Including infrastructure, data pipeline, and algorithms) for 3D computer vision platforms\n\n\n\n\nSkills:\n\nStrong ability to code in Python and C .\nVerbal and written communication skills, problem solving skills, customer service and interpersonal skills.\nStrong ability to work independently and manage one’s time.\nStrong knowledge of the full software development lifecycle: from business/systems analysis, through requirements gathering and functional specification authoring, to development, testing and delivery.\nStrong ability to troubleshoot issues and make system changes as needed to resolve issues.\nStrong knowledge of computer hardware and software.\nCan solve well-scoped challenging software problems. Can work at fast pace\n\n\n\n\nEducation/Experience:\n\nBachelor's degree in computer science, software engineering or relevant field required.\n1 year coding experience using Python and C in industry.\n\n\n\n\nTop 3 must-have HARD skills\n\nStrong Python and C programming skills\nStrong ability to work independently and manage one’s time.\nVerbal and written communication skills, problem solving skills, customer service and interpersonal skills.\n\nGood to have skills:\n\nKnowledge in computer vision area, especially in 3D reconstruction (Structure from Motion, SLAM)\nStrong ability to troubleshoot issues and make system changes as needed to resolve issues.\nStrong knowledge of computer hardware and software.\n\n\n\n\nInterview Process/Format:\n\n1 python coding interview (0.5hr)\n1 c coding interview (0.5hr)\n1 system design interview (0.5hr)",
    "date": "2025-05-09T14:31:58.489551"
  },
  {
    "job_id": "4227788333",
    "link": "https://www.linkedin.com/jobs/view/4227788333/?eBP=BUDGET_EXHAUSTED_JOB&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=2lXTCXlnDe4JrQMblNRVDA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Backend Engineer",
    "company": "Wiraa",
    "company_link": "https://www.linkedin.com/company/wiraa/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQE9LwORhIbvLg/company-logo_100_100/company-logo_100_100/0/1692029735102?e=1752105600&v=beta&t=Np5ZlAb_vfe3B-csdya_FnRMO8cNYIGcaFqD7mPIeOA",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout The Company\n\nRock Rabbit is a fast-growing, AI-powered SaaS company focused on accelerating the decarbonization of buildings. Our mission is to streamline the process of electrifying homes by making it easy and reliable for participants to find and claim rebates, tax credits, and financing for electrification projects. Through our platform, we aim to make building decarbonization more affordable and equitable, while also helping incentive providers manage their programs more efficiently. With strong venture capital backing, a talented team, and a commitment to solving climate change, we are rapidly expanding across the nation.\n\nAbout The Role\n\nWe are looking for a skilled Mid/Sr. Back-End Engineer to join our dynamic, fully remote team. In this role, you’ll have the opportunity to work on a platform that directly contributes to reducing greenhouse gas emissions in the building sector. You will be responsible for designing, developing, and maintaining APIs and services that power our platform, working closely with product and frontend teams to ensure seamless integration and scalable solutions. If you're passionate about sustainability and building impactful technology, this is an exciting opportunity to contribute to solving climate change.\n\nResponsibilities\n\n\nActively participate in the technical design and development of Rock Rabbit’s SaaS platform.\nBuild and maintain APIs, services, and systems across the platform.\nCollaborate with frontend engineers to ensure effective API consumption by client applications.\nWork closely with subject matter experts (SMEs), product, and design teams to understand end-user requirements and translate them into practical technical solutions.\nDevelop high-quality, maintainable, and scalable code that drives the functionality of the platform.\nNavigate rapid development cycles and adapt to changing project demands.\nStay up-to-date with the latest industry trends and best practices to enhance the platform and development processes.\n\n\nAbout You\n\n\n6+ years of back-end development experience, ideally with SaaS platforms.\nProficient in Python, asyncio, and SQLAlchemy.\nStrong understanding of database schemas, service-oriented architectures, data modeling, and scalable application design principles.\nExcellent problem-solving, communication, and teamwork skills.\nExperience with agile software development processes and tools.\nComfortable working in an early-stage startup environment, with a flexible and adaptable mindset.\n\n\nCompensation & Benefits\n\n\nBase salary range of $120,000 - $160,000 (depending on experience), plus equity and benefits.\nComprehensive benefits package, including medical, dental, and vision insurance, and 401(k).\nRemote-first work environment with flexible hours (must overlap by at least 5 hours with San Francisco, CA timezone).\nUnlimited PTO for a healthy work-life balance.\nEquity grants in a venture-backed climate start-up.\nRegular team-building events and a collaborative company culture focused on making an impact.\n\n\nEqual Opportunity Employment\n\nRock Rabbit is an equal opportunity employer. We are committed to creating an inclusive environment where employees from all backgrounds feel valued. We encourage applicants of all races, colors, religions, sexual orientations, genders, and other identities to apply.\n\n\n\nDesired Skills and Experience\n\nInformation Technology",
    "date": "2025-05-10T12:31:59.748402"
  },
  {
    "job_id": "4218025841",
    "link": "https://www.linkedin.com/jobs/view/4218025841/?eBP=BUDGET_EXHAUSTED_JOB&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=ZKGLXDVmhXDlxOgvRN%2Fr0A%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Staff Software Engineer - (Remote - US)",
    "company": "Jobgether",
    "company_link": "https://www.linkedin.com/company/jobgether/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C4D0BAQEFATQCdWa6tg/company-logo_100_100/company-logo_100_100/0/1635587710644/jobgether_logo?e=1752105600&v=beta&t=wVyri86acQwWgC1v31pfii29kqrmOYBr3jhSV31lFBk",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout Jobgether\n\nJobgether is a Talent Matching Platform that partners with companies worldwide to efficiently connect top talent with the right opportunities through AI-driven job matching.\n\nOne of our companies is currently looking for a Staff Software Engineer in United States.\n\nWe are seeking a seasoned Staff Software Engineer to play a key role in building technology that enables personalized care delivery. You will join a cross-functional team focused on creating tools for care providers and patients, integrating multiple data sources to deliver scalable, secure, and intuitive digital health solutions. This is a full-stack engineering role that will involve leading architectural decisions, mentoring peers, and delivering high-impact features across a cloud-based ecosystem. You'll thrive here if you're mission-driven and excited to solve complex technical challenges in a fast-paced, collaborative environment.\n\nAccountabilities:\n\n\nDesign, develop, and maintain population health tools and scalable cloud infrastructure\nIntegrate third-party platforms and APIs (including FHIR) to support patient and care provider needs\nWrite, review, and optimize full-stack code using modern frameworks like TypeScript, Node.js, React, and GraphQL\nLead by example in promoting engineering excellence, clean code practices, and security compliance\nPartner with clinical, product, and design teams to deliver features that improve patient outcomes\nMentor team members and contribute to recruitment efforts to build a diverse, high-performing engineering team\n\n\n\nRequirements\n\n\n6+ years of experience in software engineering, including 2+ years in a technical leadership role\nProficiency in modern full-stack technologies such as Node.js, React, PostgreSQL, and GraphQL\nStrong background in integrating third-party APIs and managing cloud infrastructure (GCP preferred)\nExperience working in regulated environments with a focus on compliance and data privacy\nExcellent communication skills, with the ability to collaborate across diverse technical and clinical teams\nA deep interest in healthcare innovation and a passion for mission-driven work\nComfortable drafting and reviewing technical design documents and influencing system architecture\n\n\n\nBenefits\n\n\nSalary range: $170,000 - $190,000 annually\nHealth, dental, and vision insurance\nLife insurance and retirement benefits\nEquity participation in the company\nGenerous paid time off, including vacation and sick leave\nRemote-friendly role with collaboration opportunities across the U.S\nInclusive and mission-driven team culture\n\n\n\nJobgether hiring process disclaimer\n\nThis job is posted on behalf of one of our partner companies. If you choose to apply, your application will go through our AI-powered 3-step screening process, where we automatically select the 5 best candidates.\n\nOur AI thoroughly analyzes every line of your CV and LinkedIn profile to assess your fit for the role, evaluating each experience in detail. When needed, our team may also conduct a manual review to ensure only the most relevant candidates are considered.\n\nOur process is fair, unbiased, and based solely on qualifications and relevance to the job. Only the best-matching candidates will be selected for the next round.\n\nIf you are among the top 5 candidates, you will be notified within 7 days.\n\nIf you do not receive feedback after 7 days, it means you were not selected. However, if you wish, we may consider your profile for other similar opportunities that better match your experience.\n\nThank you for your interest!\n\n",
    "date": "2025-05-03T14:32:00.961092"
  },
  {
    "job_id": "4221611999",
    "link": "https://www.linkedin.com/jobs/view/4221611999/?eBP=BUDGET_EXHAUSTED_JOB&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=SuErCMGjuj3LFKL%2FgFHL%2Fg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Software Engineer Intern (Fall 2025)",
    "company": "Genesis Therapeutics",
    "company_link": "https://www.linkedin.com/company/genesistherapeutics/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C560BAQFwjS7SpcfesA/company-logo_100_100/company-logo_100_100/0/1630670758676/genesistherapeutics_logo?e=1752105600&v=beta&t=2WAmmVRhas_GgU265oQ3xWtzXttGCEpkg2odZnYt93c",
    "place": "Burlingame, CA (Hybrid)",
    "description": "About the job\n\nGenesis Therapeutics is building a world-class software team to solve problems in drug discovery through machine learning, biophysical simulation, and computational chemistry. We are looking for engineers excited to help develop new medicines and play a critical role in building out our software platform.\n\nYou will\n\n\n\nBuild and expand on tools for visualizing molecules and proteins, analyzing machine learning models, and managing complex chemical workflows\nWork closely with machine learning engineers and medicinal chemists to develop and productionize new computational methods for molecular property prediction\nHelp scale our data infrastructure to handle billions of datapoints and thousands of parallel deep learning and molecular dynamics jobs\n\n\n\n\nYou are\n\n\n\nA strong software engineer who will write code quickly and uphold our code quality standards\nA deep thinker who reasons from first principles over pattern matching\nInterested in learning about biochemistry and the drug development process\n\n\n\n\nWhat We Offer\n\n\nThe opportunity to work on high impact tools and products that are immediately deployed to accelerate the discovery of new medicines\nStrong technical coworkers in AI, software, and chemistry, who all have a powerful mix of intellectual curiosity and humility. The team reads and discusses 1-2 machine learning or chemistry papers every week to stay on top of the field and inspire new ideas\n\n\n\n\nGenesis Therapeutics is unifying AI and biotech to discover novel and breakthrough treatments for patients with severe and devastating conditions. Genesis was founded on groundbreaking molecular ML research and since has established itself as the industry leader in AI for small molecule drug discovery. Our team of accomplished biotech leaders and expert drug hunters joins forces with deep learning researchers and software engineers who are pioneering predictive and generative AI technologies for molecules.\n\nOur team has created the industry's most advanced molecular AI platform called GEMS (Genesis Exploration of Molecular Space), to accelerate and optimize small molecule drug discovery and to enable the discovery of novel first-in-class and best-in-class small molecule drugs for challenging and/or undruggable targets.\n\nThe company has leveraged GEMS to build an internal pipeline with multiple programs against high-value targets, including data-poor and canonically undruggable targets where GEMS is uniquely advantaged. In addition, Genesis has signed AI-focused platform collaborations with major pharmaceutical companies, including most recently Incyte Corporation (Feb 2025) and Gilead Sciences (Sept 2024).\n\nWe raised a $200M series B in August 2023, and have raised over $300M in funding from top technology and biotech investors, including Andreessen Horowitz, Rock Springs Capital, T. Rowe Price, Fidelity, Radical Ventures, NVentures (NVIDIA's VC arm), BlackRock, and Menlo Ventures.\n\nGenesis is headquartered in Burlingame, CA, with a fully integrated laboratory in San Diego. We are proud to be an inclusive workplace and an Equal Opportunity Employer.",
    "date": "2025-05-03T14:32:02.271415"
  },
  {
    "job_id": "4224311175",
    "link": "https://www.linkedin.com/jobs/view/4224311175/?eBP=CwEAAAGWvBwhbz51mLKPWp5qHmxQYGI3xET3tjNec9c4j1PG_VHRfgmIr5cddQQmRvicJrjU6ZgxKM1Q3RcY3QVnszWPTax62c1Uk76CXDc76dLH-AlP7qqrPz_8bvcL5pDkYau0hiRryPcFX3M04qhTLOucfkWcIhafTKA5qVTjmb9ArQhDBDXD7s_rfVbwdjIab2WQwmXctCl5uwiurR-dzzba-lg0W6-MLPk81LToG-qxDTWUO3A6Ek2NuOe0nPBxStDh1s_T97xkd8LK1XbE-ZcgfSbwt87KQMSvrWuzoSdvxGG4wHLJlJKwKzeMAnzf7a6zEHKNbcQbSvYnh6KaITIbYA_FykvM_c0GWriy4zbV94q5qmsJ_n0nWNzfQ2jYedQGG0MEssMULbqevTXo4_tx7G8pih2WnVb_eDuM5YAfOlj8jxD4_rAQ2FCGPuNUEPj6HYWVs-_frDIYrZnATK9OW7lHqydiCp--P9n6JeYdLIQWuIq9X5XjDFs5pa0VhmjXnw&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=B%2Fao6y%2FF0SCouDF845nSaA%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Senior Software Engineer with verification",
    "company": "NGIS",
    "company_link": "https://www.linkedin.com/company/ngis/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D560BAQEOQvOIpMqVFA/company-logo_100_100/company-logo_100_100/0/1708910664221/ngis_logo?e=1752105600&v=beta&t=9McQ73m-b9YWxYonrN0P3VBfd8PvC2YsumgMMz8MqBs",
    "place": "United States (Remote)",
    "description": "About the job\n\nAbout NGIS\n\nNGIS EU is a global leading dedicated Geospatial and Sustainability company. We are an impact focused company with a mission to use our skills and capabilities to address significant global challenges including climate change, biodiversity and sustainable development. We are a Google Premier Partner and we specialise in designing and building high performing software solutions including both customer specific solutions (business to business model) as well as our own Software as a Service products.\n\n\n\n\nThe Opportunity\n\nWe are looking for a full-time Senior-level Software Engineer to join the NGIS EU in team in Canada, UK or Italy to help with the development and delivery of our TraceMark Software as a Service products. The TraceMark Sustainable Solution factory includes products for:\n\nSustainable Sourcing (https://tracemark.com/eudr)\nSustainable Cities (https://tracemark.com/flow) \nSustainable Fashion (https://materialsimpactexplorer.com/).\n\n\n\n\nAs a Senior Software Engineer, you will be responsible for building full-stack web, desktop and mobile applications based on customer requirements. You will primarily be working on TraceMark Software as a Service solutions as part of a high performing, multinational software development team. You will need to have strong written and verbal communication skills and be able to work independently, occasionally dealing directly with clients.\n\n\n\n\nAbout You\n\nAt least 5 years of commercial software development experience and familiarity with agile software development processes\nAt least 2 years developing Angular CLI applications\nAt least 2 years developing applications using .NET Core and/or Node.js\nExperience in developing and maintaining systems on either SQL Server, MySQL or PostgreSQL\nExperience in developing and maintaining systems hosted in either Microsoft Azure, Amazon AWS or Google Cloud Platform\n\n\n\n\nThe following skills will be highly regarded\n\nPython development\nMobile development experience\nAdobe Creative Cloud experience especially Xd for mock-ups\nAny experience with mapping tools, GIS, or spatial data\nCustomer engagement and communication skills\nPlease feel free to provide any links to public git repositories\n\n\n\n\nWhat to expect when you join our team\n\nRemote work arrangements\nStrong team and impact culture\nVaried project work, the chance to work with new and leading technology\nAnd importantly – the opportunity to make an impact\n\n\n\n\nOur Values\n\nWe are passionate, unified and professional. We are an impact focused business both in what we deliver for our clients and the projects we choose to support. We care about making a positive impact in the world. We use software and data to tackle issues such as sustainable development, biodiversity and conservation, preservation of Indigenous rights and interests, climate change and disaster risk reduction.\n\n\n\n\nJoin our Team\n\nIf you are a Senior Software Engineer who shares our values and aspirations and is passionate about making an impact, we want to hear from you!",
    "date": "2025-05-06T14:32:03.651185"
  },
  {
    "job_id": "4223942808",
    "link": "https://www.linkedin.com/jobs/view/4223942808/?eBP=CwEAAAGWvBwhb8-IGc2uI1kjoC-iwVJj5HDLmSVZl0v5BcGraDNPm0dhpXo72YbTaRGBmT5iaATjMWfgBe8yB0--F4lVuA0FsZ_J_AkYKy-tAn_e5QHikTSdyAPmPYleLAt4zENcP3LHP9omfZUovoGKqBmHr-bp7CKYQFzyPu4L8rSoJWBOp3AY_G0FLYGpJyWqG0CtxVUfV7PfrfRYWqKUL0S82koeEFnmxFdyQ1iz6-hL-uvJ9MzSQqZEFvd70XxVanG2V2v8nB-70NLQJdxceeXXUO-1tdS5LI96ij1Ua6LjU0Xt8peCg_NMtMwkbpm6pceR5r2cTpYL19Vpi-g65RpahbqD7xyRK2JqJISyE3xdkQEs5kNf8qrAoi6DA4hmdPLh60-Bin-Kd12EFja-ZhsogclUPbubZi5eDG2mNjwy_qfhzYruPTBv0VfR0M69i4utvBB-0rfFKOb-OkDOhZhGdpI21yZM5lhigimj1Ry0WoJE8ZIZbN5jSlnqxg812sIXMQ&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=myzGBrq9hKUVBCgxWBdR3w%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Developer (ReactJS | Java) with verification",
    "company": "Seneca Resources",
    "company_link": "https://www.linkedin.com/company/seneca-resources-inc-/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQGKU-Ttpj3vyw/company-logo_100_100/company-logo_100_100/0/1697140449976/seneca_resources_inc_logo?e=1752105600&v=beta&t=_dzGsQMBsvZXhhJRyvesTOvgYLUdvphU9ZWaGLRMqkc",
    "place": "United States (Remote)",
    "description": "About the job\n\nPosition Title: Full Stack Developer (ReactJS | Java)\n\nLocation: Remote\n\nPosition Status: Contract to hire \n\n\n\n\nPosition Description: \n\nOur client is looking for Full Stack Developer candidates with a strong focus on React.js. The ideal candidate will bring strong experience in front-end technologies and a solid understanding of user interface design principles. This role also requires some experience with Java and AngularJS.\n\n\n\n\nKey Responsibilities:\n\nDesign and implement responsive, high-performance user interfaces using React.js (primary) and AngularJS (secondary).\nCollaborate with cross-functional teams to deliver scalable front-end solutions.\nTroubleshoot and resolve front-end issues efficiently.\nTranslate business needs into functional UI/UX components.\nContribute to code reviews and maintain high standards for front-end codebase.\nSupport front-end integration with Java-based back-end systems.\n\n\n\n\nRequired Skills:\n\nReact.js – advanced proficiency and recent project experience (most critical).\nAngularJS – working knowledge.\nExperience with Java (back-end integration).\nProficiency in JavaScript, HTML, and CSS.\nStrong understanding of user interface (UI) design principles and best practices.\nExcellent debugging/troubleshooting skills.\nFamiliarity with version control (e.g., Git) and modern development workflows.\nSolid project and time management capabilities.\n\n\n\n\nAbout Seneca Resources:\n\nSeneca Resources is a client driven provider of strategic Information Technology consulting services and Workforce Solutions to government and industry. Seneca Resources is a leading IT services provider with offices in Virginia, Alabama, Georgia and North Carolina that service clients throughout the United States.\n\n\n\n\nWe are an Equal Opportunity Employer and value the benefits of diversity in our workplace.",
    "date": "2025-05-05T14:32:04.913978"
  },
  {
    "job_id": "4225420183",
    "link": "https://www.linkedin.com/jobs/view/4225420183/?eBP=CwEAAAGWvBwhb7-P39B9LsYvicTmFvHIWMCcEqgC73rCb9TXw1G8MmRoGQHsg9Ba3uBXkKOgM3GAhtuXmW2LIXVqKYnY-XayHImDhKXrJdsp8j9hOm_bOt0BHOjXR2hQ8nsTAke9i4S_lyoerQV2yJUYWKsTIxgylicJdKvZL5wqHLEIMjp16ePmb9ffm4KMSZ5Z6yZ8tyGvkzKioKJxDS_ZhSiyzeV_DXY1G90kM3wBgKgo1MIeHtLjVCHN2OOEXgiLfW-dc5ftduaAtyh13mg4qbkET6Ji6b_cJAqYsrC9Dk5wY_DvJNsPxtBN4mpydXscLgpXEQKVw0Lj6aal4fjIQ0Oq4P3jaggLuAxVCoFhbDps3Po040t3i2CzZ2ufrBuy5Yvq3Yi00_pcRlADjdXA33bFGb-jkyivhKQ7CMJ1GkAeVJWXAxjgBLoh0ZYN9IXT8oysEbdgzHkKdpZfMbmI4tmllqiK-gDzE2Ol_A&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=DxVQzoEmwO%2FgcG%2F8Uc5WsQ%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Systems Software Developer - 100% Remote with verification",
    "company": "Lensa",
    "company_link": "https://www.linkedin.com/company/lensa/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/D4D0BAQEkHa-0Aki9XQ/company-logo_100_100/B4DZaKylu7GsAQ-/0/1746085240184/lensa_logo?e=1752105600&v=beta&t=UwGSab7rveIoqtIdc015pa1BUIbcOzfalQVV-6VCkwA",
    "place": "United States (Remote)",
    "description": "About the job\n\nLensa is the leading career site for job seekers at every stage of their career. Our client, Citizant, is seeking professionals. Apply via Lensa today!\n\nSystems Software Developer - 100% Remote (REF1566P)\n\n\nFull-time\n\n\nCompany Description\n\nCitizant is a leading provider of professional IT services to the U.S. government. We seek to address some of our country’s most pressing challenges in the areas of Agile application development, Enterprise Data Management, Enterprise Architecture, and Program Management support services – focusing on the U.S. Departments of Homeland Security and Treasury. We strive to hire only ethical, talented, passionate, and committed “A Players” who already align with the company’s core values: Drive, Excellence, Reputation, Responsibility, and a Better Future. No matter how large we grow, Citizant will retain its collaborative, supportive, small-company culture, where successful team effort to address external and internal customer challenges is valued above all individual contributions.\n\nJob Description\n\nSalary Range: The expected pay range for this position is up to $125,300 yearly. The exact pay rate will vary based on skills, experience, and location.\n\nOverview\n\nWe are seeking a highly skilled and experienced Systems Software Developer with a proven track record in developing, maintaining, and supporting advanced software systems for an upcoming opportunity. Your role will entail developing and implementing a fully integrated systems infrastructure, facilitating Continuous Integration/Continuous Delivery (CI/CD) processes, and performing technical integration activities to minimize program critical risk exposure.\n\nThe ideal candidate will bring a wealth of knowledge in various IRS tax processing systems, including but not limited to submission processing systems, corporate data systems, compliance and case processing systems, and modernized systems. You will work closely within an Integrated Project Team (IPT) that includes IRS staff and other contractors, adopting the Iterative Enterprise Life Cycle (ELC) development path and methodology to support the IPT in various capacities.\n\nResponsibilities\n\n\nEnsures the AD production baseline is maintained with accurate software configuration management across multiple releases, ensuring lifecycle environments are ready for use. \nDevelops and implements a fully integrated systems infrastructure, complete with related management processes. \nActively supports Continuous Integration/Continuous Delivery (CI/CD) initiatives, ensuring seamless integration from end-to-end in the software development and deployment process. This includes continuous compilation, testing, and delivery of source code to test environments for immediate error detection. \nPerforms upgrading configurations, delivery automation, and backlog grooming sessions. \nMinimizes program critical risk exposure and ensures that technical solutions are safe, secure, extensible, and scalable. \nEstablishes and documents standard operating procedures for both technical integration and broader project or program activities. \nOffers in-depth knowledge on a variety of IRS tax processing systems, including submission processing systems, corporate data systems, compliance and case processing systems, and modernized systems. \nWorks as a key member of an Integrated Project Team (IPT) that includes IRS staff and other contractors. This involves adopting the Iterative Enterprise Life Cycle (ELC) development path and methodology and supporting the IPT in various capacities. \n\n\nQualifications\n\n\nMinimum of 5 years of professional experience in software development, with a strong focus on systems software. \nDemonstrated experience in developing software solutions using Java, including Java EE/SE, JSP, JSF, and Hibernate, showcasing the ability to address complex development challenges. \nProven ability to design, develop, and integrate web services using service-oriented architecture (SOA) principles, reflecting a deep understanding of distributed systems architecture. \nExperience with Oracle 10g/11g environments and Oracle Real Application Clusters, as well as implementing middleware rules engines like Drools, showing proficiency in database and middleware technologies. \nExpertise in implementing continuous integration and deployment processes with tools such as Jenkins, GitLab CI/CD pipeline, and automated testing techniques, demonstrating a commitment to modern development practices. \nExtensive experience working in Agile/Scrum development environments, indicating adaptability, effective teamwork, and a commitment to iterative development and continuous improvement. \nProven experience with cloud-based development and deployment and API containerization technologies like Docker and OpenShift, demonstrating knowledge of modern infrastructure and deployment methodologies. \nExperience in implementing cyber security policies, procedures, and best practices, including understanding the Federal Information Security Management Act (FISMA), to ensure secure software development practices. \n\n\nDesired Skills\n\n\nExperience in a senior development role is preferred.\n\n\nEducation\n\n\nA Bachelor’s or Master’s degree in Computer Science, Information Technology, Engineering, or a related field is highly recommended.\n\n\nClearance Requirement\n\n\nUS Citizenship & Active IRS MBI\n\n\nAdditional Information\n\nCitizant strives to be an employer of choice in the Washington metropolitan area. Citizant associates accept challenging and rewarding work and in return receive excellent compensation and benefits, as well as the opportunity for personal and professional development.\n\nCitizant is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status.\n\nJob Location",
    "date": "2025-05-10T05:32:06.161783"
  },
  {
    "job_id": "4224565560",
    "link": "https://www.linkedin.com/jobs/view/4224565560/?eBP=BUDGET_EXHAUSTED_JOB&refId=9T9ipFe1HiIWjuZxtSa1eQ%3D%3D&trackingId=1%2B2qZEkaVV2bkhdRN9F1cg%3D%3D&trk=flagship3_search_srp_jobs",
    "title": "Full Stack Software Engineer",
    "company": "Comcate",
    "company_link": "https://www.linkedin.com/company/comcate/life",
    "company_img_link": "https://media.licdn.com/dms/image/v2/C510BAQHphZyftAEUkA/company-logo_100_100/company-logo_100_100/0/1631334666097?e=1752105600&v=beta&t=SX2bBnTPzvNpBb344sn_6fQ5Rfx2MYlf7fhJ28p6Sck",
    "place": "Oakland, CA (Remote)",
    "description": "About the job\n\nFull Stack Engineer\n\nFull-Time | Remote | US-Based Company | South America Candidates Targeted\n\nComcate is seeking a Full Stack Engineer with a passion for AI-assisted development. We are a mission-driven SaaS company helping local governments modernize how they serve their communities. If you want to work with purpose and take ownership of real technical challenges, this role is for you.\n\nAbout Us\n\nFounded in 2000, Comcate builds cloud-based software used by thousands of public sector employees across the U.S. We operate two live applications: a legacy system built in PHP and a modern, AI-accelerated platform built with Node.js, TypeScript, and React, hosted on AWS GovCloud.\n\nWe are a remote-first team, with members across the U.S. and Latin America.\n\nResponsibilities\n\nFull-Stack Development\n\n\nDesign, develop, and maintain applications using Node.js, TypeScript, and React\nImplement and optimize APIs and front-end interfaces\nContribute to the architecture and design of both new and existing systems\n\n\nAI-Enabled Development\n\n\nUse tools like Cursor, Copilot, and Windsurf for coding, testing, and architecture\nChampion and experiment with AI-driven workflows to increase team efficiency\n\n\nInfrastructure as Code & DevOps\n\n\nProvision and manage infrastructure using Terraform (or similar tools)\nMaintain and improve CI/CD pipelines and deployment workflows\nSupport production and non-production environments in AWS (Commercial and GovCloud)\n\n\nTesting & Quality Assurance\n\n\nWrite and maintain unit, integration, and end-to-end tests\nApply best practices to ensure code reliability and quality\n\n\nMonitoring & Observability\n\n\nImplement and maintain monitoring, alerting, and logging with Datadog or similar tools\nTroubleshoot and resolve performance or reliability issues\n\n\nProduct Thinking\n\n\nWork closely with product managers and designers to deliver user-centric features\nParticipate in product planning and contribute technical insights\n\n\nOwnership & Autonomy\n\n\nTake full ownership of projects from concept through release\nTackle complex technical problems and drive solutions independently\n\n\nStartup Environment\n\n\nWork in a fast-moving environment with evolving priorities\nContinuously evaluate and adopt new technologies\n\n\nRequired Qualifications\n\n\n5+ years of full-stack development experience\nStrong experience with Node.js, TypeScript, and React (or similar frameworks)\nHands-on experience with AI coding tools such as Cursor or Copilot\nProficient with Terraform or similar infrastructure as code tools\nStrong grasp of DevOps practices, including CI/CD and cloud deployments\nExperienced in writing and maintaining automated test coverage\nFamiliarity with monitoring tools such as Datadog or New Relic\nProven ability to work independently and within distributed teams\nComfortable working in a fast-paced, agile, and remote-first environment\nExcellent English communication skills\nBonus: Experience with GIS or legacy PHP systems\n\n\nLocation & Work Schedule\n\n\nFully remote role\nCandidates based in South America preferred\nMust be available to work at least 4 hours per day overlapping with US Eastern or Central Time\n\n\nPowered by JazzHR\n\n5pDE9Dzlu2",
    "date": "2025-05-06T14:32:07.506045"
  }
]